{"status": "OK", "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "results": {"replyLimit": 3, "totalParentCommentsReturned": 25, "depthLimit": 0, "callerID": null, "comments": [{"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21657139, "approveDate": "1488459138", "userID": 63148335, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21657139, "editorsSelection": false, "commentBody": "Trump's people, \"the best people, people you don't even know\", fit together perfectly.  Russia has vast natural resources, oil in particular, and Trump is interested in oil money.  Tillerson is an oil man, and was already working on getting his fingers into the Russian oil \"pie\".  <br/><br/>I believe that it is possible that Trump's whole team -- Sessions included -- could have been blinded by lust for wealth, and that Trump's real scheme is to shift from Middle East oil to Russian oil dependency.  (That's part of the reason he ignores climate change, by the way...)  I believe that the whole team has been working with the Russians on this business deal, which included the level of unconstitutional actions the GOP Congresspeople are so fond of: gerrymandering, voter suppression.  You know, that might not seem so criminal on the surface.  Meanwhile, the Russians are not so naive, and have their puppets neatly arranged.<br/><br/>However, even if Trump and family and friends are merely ready to ruin America for self-serving greed, their actions are still treasonous, when the puzzle pieces are fitted neatly together.  <br/><br/>Ignorance of what treason is, is no excuse for perpetrating treason.  Educate them, and lock them up.", "permID": "21657139", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Ithaca, Ny", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Lois Werner-Gallegos", "status": "approved", "replyCount": 0, "createDate": "1488453408", "timespeople": 1, "trusted": 0, "recommendations": 5, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21656132, "approveDate": "1488459138", "userID": 68890766, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21656132, "editorsSelection": false, "commentBody": "We once again have the assessments from intelligence sources that the Russians \"efforts to intervene in elections worldwide\". But we aren't told what evidence led to that conclusion.<br/><br/>We are told of \"Russia’s meddling in the election\" but again no evidence, or even a description of the evidence. The unclassified version of the FBI report that was released spent 2/3rds of the report arguing that RT New Service was a Kremlin front--and then went on to suggest that the numerous American sources that appear on that channel were Russian dupes at best.<br/><br/>Again, conclusions but no evidence. All these conclusions may be accurate and logically point to an effort to interfere with the election. But if they are, why was it handled so clumsily and why were Russian fingerprints left everywhere?<br/><br/>I return once again to the evidence that supports the conclusion. Unfortunately at this point evidence that for reasons yet to be explained remains classified and secret. <br/><br/>What is also strange is the initial story came from a leaked source from the House Intelligence Committee. So at some level the \"evidence\" has been revealed to some, but we don't know who.<br/><br/>If it's the press, why haven't they made it part of the story? Surely the FBI report that has been released could have contained some facts to support their conclusions.<br/><br/>There are a lot of missing parts to this story beyond AG Sessions faulty memory or inability to understand what \"any contacts means.\" But the lack of facts is troubling.", "permID": "21656132", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "New York", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "drspock", "status": "approved", "replyCount": 0, "createDate": "1488430176", "timespeople": 1, "trusted": 0, "recommendations": 1, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "n/a", "sharing": 0, "reportAbuseFlag": null, "commentID": 21657953, "approveDate": "1488459138", "userID": 12863706, "replies": [{"recommendedFlag": null, "updateDate": "1488470694", "commentTitle": "<br/>", "sharing": 1, "reportAbuseFlag": null, "commentID": 21658105, "approveDate": "1488470694", "userID": 36564446, "replies": [], "depth": 2, "parentID": 21657953, "commentSequence": 21658105, "editorsSelection": false, "commentBody": "So the Russians were involved but with Hillary?  Yeah, why didn't Flynn and his Boss (for 5minutes) use that as a defense?<br/><br/>Instead of Flynn resigning (and Trump Accepting BTW) before having his first staff meeting?", "permID": "21657953:21658105", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Here", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "MarkAntney", "status": "approved", "replyCount": 0, "createDate": "1488459387", "timespeople": 1, "trusted": 0, "recommendations": 1, "parentUserDisplayName": "Bob", "commentType": "userReply"}], "depth": 1, "parentID": null, "commentSequence": 21657953, "editorsSelection": false, "commentBody": "Not much critical thinking here. Why would Putin not want Hillary to win? She had been totally ineffective as Secretary of State. Russians are the ultimate chess players. There is no reason to think the Russians would have not have believed the Hillary/Democratic landslide predictions of the media. The only thing clearly in their interest is that the new administration is weaken by the secret revelations. The information hacked or leaked from the DNC certainly would serve that purpose for the expected incoming Democratic administration. Doubt in is the integrity of our election serves to decrease the contrast with Putin's corrupt regime, and ensures  the opposition party here will be given ammunition to gum up the new administration with law suits and investigations.   It's hard to see how Trump's push to revitalize our economy and rebuild a robust military capability would be in Putin's interests. Obama activist Democrats are the masters of the smear; witness what they did to Romney. So they plant a trail of innuendo to fuel the efforts to hobble the new administration.", "permID": "21657953", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Alabama", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Bob", "status": "approved", "replyCount": 1, "createDate": "1488458753", "timespeople": 1, "trusted": 0, "recommendations": 3, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21656712, "approveDate": "1488459138", "userID": 74447368, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21656712, "editorsSelection": false, "commentBody": "The reporting on Russia's hacking into our election is a prime example of why the media fails.  The action against our election has a broader context and the media's ahistorical reporting fails to inform the public of that context.  <br/><br/>This is why Republicans for so long gotten a way with saying that the reason we were attacked on 9/11 is that \"they\" hate us, in a total vacuum where US and European action in the middle east over the course of a century had no influenced on the modern jihadist movements that has sprung up in the middle east and around the world<br/><br/>Here too the Stuxnet virus that our government along with our allies used in order to try and undermine Iran's nuclear program has a part to play in the use of Cyber weapons in modern warfare, both on the battle field and in politics.  Stuxnet opened a new front in warfare, a front that Russia is aggressively perusing.  <br/><br/>I find it remarkable how little appreciation people have for the fact that we're at war and that if what is alleged is true, not only did we suffer a major blow, but our reaction to it sets a very dangerous precedent for future actors who might take a lead from Russia's presumed success in this arena.<br/><br/>Just because Russian tanks aren't rolling down Avenue of the Americas doesn't mean that we weren't invaded. If the public remains in the dark about the power of cyber warfare then America is left in an extremely vulnerable position.", "permID": "21656712", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Fl", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Miles", "status": "approved", "replyCount": 0, "createDate": "1488447320", "timespeople": 1, "trusted": 0, "recommendations": 3, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21656122, "approveDate": "1488459138", "userID": 48063402, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21656122, "editorsSelection": false, "commentBody": "It is no wonder that Trump wants to divert attention away from this damning cabal of lies and obfuscation.  <br/><br/>This information needs to be headlined by every media outlet across the nation.  Instead it is probably deep sixed where ever possible.  The people responsible for following this up such as intelligence commitees in Congress  and Jeff Session's Justice Department have every reason to cover it up and Democrats who yell foul are accused of being hysterics.  even public protesters are accused of being for hired employees.<br/><br/>It is one more reason why we must keep our focus on exposing Trump for the criminal liar he is , a difficult and long path but the only one possible if we desire to control the spread of a dictatorship in this country.", "permID": "21656122", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Colorado", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "just Robert", "status": "approved", "replyCount": 0, "createDate": "1488430129", "timespeople": 1, "trusted": 0, "recommendations": 1, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21657879, "approveDate": "1488459138", "userID": 59960698, "replies": [{"recommendedFlag": null, "updateDate": "1488462284", "commentTitle": "n/a", "sharing": 0, "reportAbuseFlag": null, "commentID": 21658256, "approveDate": "1488462284", "userID": 71649917, "replies": [], "depth": 2, "parentID": 21657879, "commentSequence": 21658256, "editorsSelection": false, "commentBody": "Would someone please just explain how Russia took control of American voter's hands and FORCED them to mark their ballots against their will ... thus throwing the election results for Trump?  Or, how they manipulated the electronic results so as to NULLIFY the reported \"popular vote win\" by HRC??  Because if you cannot produce EVIDENCE that one or more of these type \"rigging\" events or FORCED VOTER MANIPULATIONS occurred, then you got NOTHING!", "permID": "21657879:21658256", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Due South, USA", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Make Jed's Day", "status": "approved", "replyCount": 0, "createDate": "1488460068", "timespeople": 1, "trusted": 0, "recommendations": 0, "parentUserDisplayName": "VMG", "commentType": "userReply"}], "depth": 1, "parentID": null, "commentSequence": 21657879, "editorsSelection": false, "commentBody": "This whole scenario is very disturbing. It's not about the democrats losing the election. If that were the case the Democrats had more of a case when Bush was elected by the Supreme Courts's hanging chads decision. Maybe they should have been more forceful then and we wouldn't have the mess we do in the Middle-East, but that is now history.<br/>This Russian connection must be resolved and brought out into the open no matter who is involved. If Trump or his people had no involvement he should welcome an independent  investigation. The Republicans had numerous investigations about Benghazi. This is far more serious and could affect the entire Trump administration. Just like Watergate, this needs a thorough bipartisan investigation. ", "permID": "21657879", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "NJ", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "VMG", "status": "approved", "replyCount": 1, "createDate": "1488458397", "timespeople": 1, "trusted": 0, "recommendations": 15, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21656639, "approveDate": "1488459138", "userID": 53529556, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21656639, "editorsSelection": false, "commentBody": "I've been a Democrat for nearly 40 years and most certainly did not vote for Trump, but I'm confused as to why it's okay for Clinton campaign staffers to have repeated communications with Chinese officials during the campaign (particularly given the extensive and well-known history of Chinese attempts to influence U.S. elections through donations to both Clintons, Hillary's brother Tony Rodham, Bill's lifelong friend Terry McAuliffe, and the Clinton Foundation) but problematic for Trump campaign staffers to be communicating with Russian officials.  <br/><br/>Shouldn't the politicians who are so earnestly calling for investigations of Russian influence also be calling for similar investigations with respect to attempted Chinese influence?  Or the influence of other governments via financial contributions?<br/><br/>Why would it be okay for foreign governments to influence U.S. elections with monetary contributions that underwrite the media-related activities of a David Brock but not okay for foreign governments to influence U.S. elections with \"fake news\" which is essentially nothing more than the spreading rumors and innuendo that Americans can choose to believe or disbelieve?  <br/><br/>I'm deeply disappointed that President Obama, who I voted for twice, has elevated his views above the votes of the American people and has actively worked to undermine the democratic process, however much he may dislike the outcome.", "permID": "21656639", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "KS", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "GM", "status": "approved", "replyCount": 0, "createDate": "1488445367", "timespeople": 1, "trusted": 0, "recommendations": 1, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21656115, "approveDate": "1488459138", "userID": 65256487, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21656115, "editorsSelection": false, "commentBody": "The question to ask oneself is what if the Obama administration did not take the action it did. I still have faith both in our intelligence community as well in the wisdom of President Obama. They knew a lot, not only of what was being revealed but also of the characters of Trump and his campaign associates. The writing was on the wall during our eternal past election, and it remains to this day: That the now-President Trump's life-long patterns have been that of deceit and exploitation...all for him. He and his cronies are more than capable of covering up the truth, and perhaps destroying it. It may have cost Secretary Clinton the presidency, but we should appreciate that little by little we are learning how a thug like Putin and an individual like Trump can threaten our democracy as we know it.", "permID": "21656115", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Santa Rosa, CA", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Kathy Lollock", "status": "approved", "replyCount": 0, "createDate": "1488430078", "timespeople": 1, "trusted": 0, "recommendations": 1, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21657661, "approveDate": "1488459138", "userID": 74003506, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21657661, "editorsSelection": false, "commentBody": "That the Obama administration apparently took additional steps to preserve the intelligence perhaps speaks to suspicions the information would not be thoroughly investigated or shared.<br/>The suspicions, in my view, were brought by candidate and president-elect Trump himself, actions by individuals around Trump, and a GOP-led Congress seemingly willing to drag its feet in investigating Russian cyber attacks of the DNC and individuals in the Clinton campaign.<br/>The questions that need to be answered revolve around an American presidential candidate with an unusual affinity for Putin and Russian foreign policy, and a campaign message quite similar to European white nationalist political parties, many funded openly by Putin's political apparatus. There are too many coincidences to ignore in terms of the future of American national security. ", "permID": "21657661", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "GA", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Kathy White", "status": "approved", "replyCount": 0, "createDate": "1488457192", "timespeople": 1, "trusted": 0, "recommendations": 7, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21656636, "approveDate": "1488459138", "userID": 54672139, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21656636, "editorsSelection": false, "commentBody": "Let's imagine for one moment that Hillary Clinton is appointed to the position of U.S. Attorney General and, during her confirmation hearings, denies - in the same manner as Sessions - any contact or communication with Russian officials, a categorical denial underscored and provided by a written statement.  Subsequently, investigations disclose the occurence of two separate meetings between Clinton and Russian officials, one in the privacy of her office, a glaring omission.  Would Sessions, as a U.S. Senator, and his blood hungry Republican colleagues, be as forgiving?  Faulty memory, like ignorance of the law, is an unacceptable excuse.  Sessions should resign.  He has tarnished irreparably his credibility.  And, so far, in so little time, We the People have seen and heard much that calls into question the veracity of the positions taken by this Administration.  ", "permID": "21656636", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Cannes, France", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Jacques Triplett", "status": "approved", "replyCount": 0, "createDate": "1488445329", "timespeople": 1, "trusted": 0, "recommendations": 4, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21656052, "approveDate": "1488459138", "userID": 13957398, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21656052, "editorsSelection": false, "commentBody": "Obama had every reason to approve this action. Even if we are unable to connect the dots and implicate Trump in the election hacking, Trump's on air invitation in July 2016 to Russia to hack into Hillary's emails impelled the Obama administration to deter Trump operatives from rigging the presidential election and provide the intelligence community with sufficient information for investigation. Session's hands appear dirty in this matter because of his convenient memory lapse about his contacts with the Russians, and that he must recuse himself from further involvement in investigations is non-negotiable. If congressional Republicans do not sever Sessions from the pending investigations, it will leave the wolf in charge of watching the hen house.", "permID": "21656052", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "New Hartford", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "nzierler", "status": "approved", "replyCount": 0, "createDate": "1488429701", "timespeople": 1, "trusted": 0, "recommendations": 1, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21657556, "approveDate": "1488459138", "userID": 51415176, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21657556, "editorsSelection": false, "commentBody": "The right made this bed, by their endless investigations of Hillary, now they must lay in it. Will the right put country before party? Time has come for the right to put up or shut up. To think that the Obama administration had information so damming that they had to spread it around so it could not be destroyed by the incoming Trump administration should scare the hell out of all Americans. How can government want us to trust government when it looks like government can’t trust itself? Calls for a special prosecutor is in fact saying we can’t trust our elected officials to police themselves. Trump who along with Clinton thought he could never win probably was thinking more of post-election business deals than post-election governing. Post-election Trump making nice with Putin is only making people think what does the Russians have on him? This is starting to make the server in Hillary’s bathroom look like child’s play. Both sides of the aisle need to stop waving their battle flags and put the country before party. ", "permID": "21657556", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "New York", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Steven McCain", "status": "approved", "replyCount": 0, "createDate": "1488456516", "timespeople": 1, "trusted": 0, "recommendations": 8, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 1, "reportAbuseFlag": null, "commentID": 21657469, "approveDate": "1488459138", "userID": 59365796, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21657469, "editorsSelection": false, "commentBody": "As a prosecutor, it is imperative an independent investigation occur w/o politics influencing the process.  Sessions cannot head an investigation that must look into his own activities during the election process.  Numerous \"investigations\" by numerous entities can serve only to muddle the process and foul the outcome.  Its time ethics and the interests of the United States take precedence over party loyalty.  ", "permID": "21657469", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Wisconsin", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "j.", "status": "approved", "replyCount": 0, "createDate": "1488455963", "timespeople": 1, "trusted": 0, "recommendations": 11, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "n/a", "sharing": 0, "reportAbuseFlag": null, "commentID": 21656628, "approveDate": "1488459138", "userID": 66767942, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21656628, "editorsSelection": false, "commentBody": "What's more impressive: the sheer volume of deceit, lies and chicanery afoot in the current administration or the willful ignoring (and acceptance) of nearly everything Americans normally detest in a President and administration? <br/><br/>We've seeen bans, (did I mention) lies, corrupt alliances, wonton spending proposals, a hasty kneecapping of gov't agencies/regulations and the incessant need to place the blame anywhere outside of responsible reach. <br/><br/>But hey, Wall St hit 21k, talk of border walls, conflicts of interest, xenophobia and a policy tweeting commander in chief is the new norm. <br/><br/>Somehow one would think this level of subterfuge and incompetence would've been uncovered only after years of investigation and failure. <br/><br/>Hasn't even been a full 3 months. <br/><br/>Buckle up.", "permID": "21656628", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Brooklyn NY", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Mark D", "status": "approved", "replyCount": 0, "createDate": "1488445182", "timespeople": 1, "trusted": 0, "recommendations": 1, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21656016, "approveDate": "1488459138", "userID": 63499211, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21656016, "editorsSelection": false, "commentBody": "If, as many readers have commented, there are several reasons to believe that Russia compromised US sovereignty with the collusion of Trump and a number of his acolytes, what next? Impeachment? Charges of treason? <br/><br/>If so, what of VP Pence? He, too, was a member of the Trump-Pence election team and he, too, was elected due to the same issues as was Trump. Should he then, too, be charged with being a member of the conspiracy that led to Trump's electoral win? And what of the growing number of cabinet secretaries, such as Tiilerson, Sessions, Ross who have had ongoing relationships with nefarious Russian figures? Could the conspiracy, if there was one, extend out to them and, if so, should not they be charged as well? <br/><br/>After all, the Nixon White House produced many members, such as H.R. Haldeman, John Erlichman, Charles Colson, Vice-President Spiro T. Agnew, who were either removed from office and/or were imprisoned. <br/><br/>After all, compared to the current situation, Watergate was indeed small potatoes.  ", "permID": "21656016", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Murphysboro, Illinois", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Dochoch", "status": "approved", "replyCount": 0, "createDate": "1488429547", "timespeople": 1, "trusted": 0, "recommendations": 2, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21657348, "approveDate": "1488459138", "userID": 78255853, "replies": [{"recommendedFlag": null, "updateDate": "1488462177", "commentTitle": "n/a", "sharing": 0, "reportAbuseFlag": null, "commentID": 21658332, "approveDate": "1488462177", "userID": 71649917, "replies": [], "depth": 2, "parentID": 21657348, "commentSequence": 21658332, "editorsSelection": false, "commentBody": "Discussions ... aka, verbal communications, somehow CHANGED THE LEGITIMATE OUTCOME of the election?  How EXACTLY does that happen ... and how many votes were SWITCHED so as to offset HRC's \"millions of popular vote majority\" results?<br/><br/>This whole thing is the biggest WITCH HUNT in the history is US politics", "permID": "21657348:21658332", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Due South, USA", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Make Jed's Day", "status": "approved", "replyCount": 0, "createDate": "1488460320", "timespeople": 1, "trusted": 0, "recommendations": 0, "parentUserDisplayName": "William", "commentType": "userReply"}], "depth": 1, "parentID": null, "commentSequence": 21657348, "editorsSelection": false, "commentBody": "There has been an enormous and continuous denial from our elected Republican Congressmen, presidential appointees, and associates of the Trump campaign about any collusion with the Russians during the Presidential campaign.  Even when confronted with undeniable evidence that the contacts took place, the stock answer is always 'we did not discuss the election campaign'.   I have yet to find any statements as to 'what' was discussed during these meetings. I'm pretty sure it wasn't to discuss the weather.", "permID": "21657348", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Michigan", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "William", "status": "approved", "replyCount": 1, "createDate": "1488455036", "timespeople": 1, "trusted": 0, "recommendations": 5, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21656612, "approveDate": "1488459138", "userID": 56867866, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21656612, "editorsSelection": false, "commentBody": "Men like Trump will never have enough money and we elected him while ignoring the fact that he has avoided all the norms of decency, propriety, and disclosure heretofore followed by all previous presidents. Based on a preponderance of the evidence there is little doubt that both Trump and his wannabe and actual billionaire cabinet have all too cozy a relationship with the Russian Government. Does anybody really doubt that the lure of incredibly vast amounts of easy money could easily be the driving force behind this dystopian prequel to the conversion of our democracy to a Soviet-style dictatorship?<br/>Congress, the Republicans, must ensure that a special prosecutor is appointed immediately (Leon Panetta?) to investigate this matter and allowed unfettered ability to pursue any and all evidence wherever it may lead. We cannot afford to ignore the possibility that there has been treason committed against the United States by any official of the government. This matter is too grave and the possible consequences too horrific to allow us as citizens of this great country to just stick our heads in the ground and hope for the best...", "permID": "21656612", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Mountain West", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "DCreamer", "status": "approved", "replyCount": 0, "createDate": "1488444758", "timespeople": 1, "trusted": 0, "recommendations": 2, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488458958", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21654936, "approveDate": "1488458958", "userID": 54452364, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21654936, "editorsSelection": false, "commentBody": "Anything new to report? ", "permID": "21654936", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Oklahoma", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Stephen", "status": "approved", "replyCount": 0, "createDate": "1488423712", "timespeople": 1, "trusted": 0, "recommendations": 1, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459384", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21656770, "approveDate": "1488459384", "userID": 21237624, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21656770, "editorsSelection": false, "commentBody": "If Trump and his administration are innocent, then they should do their utmost to prove it:  not by crying \"fake news,\" but by removing ANY doubt of conflict-of-interest (and thus having Sessions recuse himself from involvement with an investigation), and by releasing Trump's tax returns to show that he (and his family) have absolutely no business debts or obligations to Russia.  All of the grandstanding by Trump and his surrogates just adds to the guilt factor.   <br/><br/>What saddens me, however, is that the Obama administration, in their characteristic caution, and despite their efforts to leave a breadcrumb trail of evidence, may have played into the Trump camp's inevitable, and vertiginously spinning, narrative that claims of Russian interference are not serious, but merely partisan.  ", "permID": "21656770", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "San Francisco", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "arcadia", "status": "approved", "replyCount": 0, "createDate": "1488448322", "timespeople": 1, "trusted": 0, "recommendations": 1, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21657346, "approveDate": "1488459138", "userID": 60339062, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21657346, "editorsSelection": false, "commentBody": "Almost 3 million people marched on January 21.<br/><br/>We need double that on April 15. We need Congress and the courts and the state houses to know that it is imperative that Trump's taxes be released. That the Russian connection be fully investigated by a special prosecutor. That we will not be satisfied with less. That we will not go away or sit down and shut up. <br/><br/>Republican majorities in Congress and the state houses must be made to realize that the call for for an investigation into the ties between the Trump campaign and Russian intelligence, is an act of the highest patriotism, essential to the preservation of our constitutional government. ", "permID": "21657346", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6033/9062/cropped-60339062.jpg?0.2882255055010319", "userLocation": "Montclair, NJ", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Deborah", "status": "approved", "replyCount": 0, "createDate": "1488455021", "timespeople": 1, "trusted": 0, "recommendations": 8, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21656575, "approveDate": "1488459138", "userID": 65594900, "replies": [{"recommendedFlag": null, "updateDate": "1488473327", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21658588, "approveDate": "1488473327", "userID": 69739789, "replies": [], "depth": 2, "parentID": 21656575, "commentSequence": 21658588, "editorsSelection": false, "commentBody": "This is the real \"story\". Good luck seeing it pursued in the main stream press.", "permID": "21656575:21658588", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6973/9789/cropped-69739789.jpg", "userLocation": "East Coast", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Daphne", "status": "approved", "replyCount": 0, "createDate": "1488461267", "timespeople": 1, "trusted": 0, "recommendations": 0, "parentUserDisplayName": "anne vincent", "commentType": "userReply"}], "depth": 1, "parentID": null, "commentSequence": 21656575, "editorsSelection": false, "commentBody": "The Obama White House bugged jounalists (Rosen,etc) phones and home as well as others who dared to write any negative information about Obama. In order to win his second term, we know the IRS utilized immoral and illegal methods to target Republican groups, and we know that the Obama White House obstructed investigation of that entire scandal, by destroying computers and records and emails and lying about it.  We know from WikiLeaks that the Obama Administration also colluded with the Clinton Campaign and the State Department in order to guarantee a win for Hillary, by manipulating the Primary election and by hindering the investigation of Hillary Clinton's illicit activities while SOS.  There are indications of a multitude of illegal and unethical manipulations that Obama authorized in blatant attempts to subvert a fair election and to subvert our Democracy. Now we find out that his Administration is subverting the functioning of the new Administration - with the ongoing assistance of all those DNC/Obama holdovers still lurking in the shadows in Washington - in an obvious attempt to overthrow the elected leadership that the American people voted for. This activity represents total sabotage of our government. Obama and his cronies must be stopped. The media have been actively involved with creating \"spin\" and deflecting attention away from the actions of the Obama Administration, and instead have been attempting to throw mud on the new Administration. This must end. ", "permID": "21656575", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "california", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "anne vincent", "status": "approved", "replyCount": 1, "createDate": "1488443785", "timespeople": 1, "trusted": 0, "recommendations": 3, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459312", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21658073, "approveDate": "1488459312", "userID": 48000580, "replies": [{"recommendedFlag": null, "updateDate": "1488476534", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21658319, "approveDate": "1488476534", "userID": 73444633, "replies": [], "depth": 2, "parentID": 21658073, "commentSequence": 21658319, "editorsSelection": false, "commentBody": "\"Clearly\"?  Not at all.  There's no evidence he met with the Russians to discuss the campaign.  None.  At best there are connections identified in his capacity as senior member of Armed Services Committee.  Senators routinely meet with ambassadors.  <br/><br/>There is not a shred of evidence at this point.  Just innuendos spread by the Obama Administration.  That would be the basis of the story if The Times were a real investigative paper.", "permID": "21658073:21658319", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "New York", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "AACNY", "status": "approved", "replyCount": 0, "createDate": "1488460280", "timespeople": 1, "trusted": 0, "recommendations": 2, "parentUserDisplayName": "John", "commentType": "userReply"}], "depth": 1, "parentID": null, "commentSequence": 21658073, "editorsSelection": false, "commentBody": "Sessions clearly lied during his congressional hearings. Staggering.", "permID": "21658073", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/4800/0580/cropped-48000580.jpg?0.8383151208239556", "userLocation": "Hartford", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "John", "status": "approved", "replyCount": 1, "createDate": "1488459274", "timespeople": 1, "trusted": 1, "recommendations": 3, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 1, "reportAbuseFlag": null, "commentID": 21657272, "approveDate": "1488459138", "userID": 18069549, "replies": [{"recommendedFlag": null, "updateDate": "1488462871", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21658187, "approveDate": "1488462871", "userID": 39620600, "replies": [], "depth": 2, "parentID": 21657272, "commentSequence": 21658187, "editorsSelection": false, "commentBody": "Then don't run for high public office where you're \"small talk\" with foreign government officials at governmental functions or while on the clock or in your capacity or on government property or using your title to heve access or using government transportation or on the taxpayers dime is not your personal business.", "permID": "21657272:21658187", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Englewood, FL", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Nancy Parker", "status": "approved", "replyCount": 0, "createDate": "1488459731", "timespeople": 1, "trusted": 0, "recommendations": 1, "parentUserDisplayName": "Mytwocents", "commentType": "userReply"}, {"recommendedFlag": null, "updateDate": "1488471175", "commentTitle": "<br/>", "sharing": 1, "reportAbuseFlag": null, "commentID": 21658344, "approveDate": "1488471175", "userID": 60291006, "replies": [], "depth": 2, "parentID": 21657272, "commentSequence": 21658344, "editorsSelection": false, "commentBody": "You are simply wrong. The government knew about the meetings only because Trump associates met with Russian operatives already under observation by intelligence agents. Think about it. It's not the contacts -if you or I met with the Russian ambassador as part of legitimate business, we'd likely not state that the meeting never took place, or call the investigator a liar if we were questioned. We'd explain the purpose of the meeting. Because our motives for meeting were legitimate.", "permID": "21657272:21658344", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6029/1006/cropped-60291006.jpg?0.2501141866669059", "userLocation": "Milwaukee", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Moreen Carvan", "status": "approved", "replyCount": 0, "createDate": "1488460369", "timespeople": 1, "trusted": 0, "recommendations": 0, "parentUserDisplayName": "Mytwocents", "commentType": "userReply"}], "depth": 1, "parentID": null, "commentSequence": 21657272, "editorsSelection": false, "commentBody": "The United States Government is forbidden to spy on his private citizens phone calls without a warrant from a judge. <br/><br/>From this article, we see that Obama's government has asked the secret service of Britain and Holland to spy on Obama's political opponents and then give them  the transcripts. <br/><br/>How legal is this? The big story here is that Obama turned USA into a police state circumventing the spirit of the laws, by finding a loophole procedure to spy on its citizens.    <br/><br/>Anyone who attends diplomatic events meet with various ambassadors who are trying to be nice with any Americans of any influence, and make small talk. To criminalize the small talk of Sessions with foreign officials met at diplomatic events is quite McCarthyst.<br/><br/>I don't like to live in a country where I can make small talk with whoever I want, without being called a traitor or have all my moves recorded by foreign spies for my own government. ", "permID": "21657272", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "New York", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Mytwocents", "status": "approved", "replyCount": 2, "createDate": "1488454443", "timespeople": 1, "trusted": 0, "recommendations": 2, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21656425, "approveDate": "1488459138", "userID": 65314499, "replies": [], "depth": 1, "parentID": null, "commentSequence": 21656425, "editorsSelection": false, "commentBody": "It is logical that Sessions would have admitted to the Senate Committee that he met twice with the Russian Ambassador/spy as a routine matter, if that were the case.  He must have felt that explanation would not have been believed.  So, he lied.  Evidence is piling up that points to a conspiracy between the Trump campaign and Russian government representatives to sabotage our national election.  The seriousness of such a possibility cannot be overstated. It demands a special prosecutor, and immunity granted as needed to see where and to whom this may lead...", "permID": "21656425", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "NorCal", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Snarkk", "status": "approved", "replyCount": 0, "createDate": "1488440060", "timespeople": 1, "trusted": 0, "recommendations": 1, "parentUserDisplayName": null, "commentType": "comment"}, {"recommendedFlag": null, "updateDate": "1488459138", "commentTitle": "<br/>", "sharing": 0, "reportAbuseFlag": null, "commentID": 21657991, "approveDate": "1488459138", "userID": 65262207, "replies": [{"recommendedFlag": null, "updateDate": "1488467896", "commentTitle": "<br/>", "sharing": 1, "reportAbuseFlag": null, "commentID": 21658224, "approveDate": "1488467896", "userID": 60291006, "replies": [], "depth": 2, "parentID": 21657991, "commentSequence": 21658224, "editorsSelection": false, "commentBody": " It's not the conversations -it's Session's testimony to Congress. If Congress can move to impeach a President by claiming he lied under oath about sexual contact with an intern, why wouldn't Congress take action against a Senator who failed to fully and accurately disclose, under oath, legitimate contacts with the Russian ambassador during the past year? Sessions is not naive -he understands that he failed to disclose the whole truth to Congress about his contact with Russians (which was the question asked).  I doubt he'd have sympathy for his own excuses were he the Senator and not the Secretary.", "permID": "21657991:21658224", "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/6029/1006/cropped-60291006.jpg?0.2501141866669059", "userLocation": "Milwaukee", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "Moreen Carvan", "status": "approved", "replyCount": 0, "createDate": "1488459935", "timespeople": 1, "trusted": 0, "recommendations": 0, "parentUserDisplayName": "OWilson", "commentType": "userReply"}], "depth": 1, "parentID": null, "commentSequence": 21657991, "editorsSelection": false, "commentBody": "Clinton operatives were in Europe and the Middle East overtly trying to influence their elections.<br/><br/>Obama was in the U.K. railing against Brexit and threatening them with trade sanctions.<br/><br/>America is bombing countries as we speak in order to to influence their politics.<br/><br/>Injformal talks go on between the U.S. politicians and the enemy all the time, Carter, McCain, Kerry and others are making \"surprise\" and unsanctioned trips to the U.K, Europe, Israel, theMiddle East and the Far East.<br/><br/>It is assumed they are acting in the interests or world peace. There is no call for Congressional \"Investigations\", even if the trips are against the current U.S. Policy.<br/><br/>That is, of course, until Trump!<br/><br/>Let's have some perspective, please!<br/><br/>Fake news can be business as usual elevated to inferences and accusations of Treason, by a hack partisan press!<br/><br/>I believe the public are starting to be aware of this rank partisanship.", "permID": "21657991", "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "userLocation": "Toronto", "userTitle": "NULL", "userURL": "NULL", "userDisplayName": "OWilson", "status": "approved", "replyCount": 1, "createDate": "1488458956", "timespeople": 1, "trusted": 0, "recommendations": 6, "parentUserDisplayName": null, "commentType": "comment"}], "page": 1451, "api_timestamp": "1488816917", "sort": "newest", "totalReplyCommentsFound": 2086, "totalReporterReplyCommentsFound": 0, "totalRecommendationsReturned": 17, "totalReplyCommentsReturned": 8, "totalParentCommentsFound": 2026, "totalEditorsSelectionFound": 56, "totalReporterReplyCommentsReturned": 0, "filter": "newest", "totalEditorsSelectionReturned": 0, "totalCommentsReturned": 25, "totalCommentsFound": 4112, "totalRecommendationsFound": 2153}, "debug": {"version": 3.1}}