{"results": {"totalCommentsFound": 8064, "totalCommentsReturned": 25, "comments": [{"commentID": 21683902, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": 21683241, "rgt": 306, "replyCount": 0, "userLocation": "Houston", "commentSequence": 21683902, "commentBody": "As noted in the article, The Times explicitly refrained -- at the White House's request -- from revealing any specific tactics intended to counter North Korea's nuclear program, and I would assume it adhered to the administration's requests. (I certainly trust The Times more than anyone in the Trump administration.) It also noted that much of the article's contents stem from those comments made by various Pentagon officials in non-classified settings such as open congressional hearings and industry conferences. Finally, North Korea is apparently already aware of our cyberwar tactics, given the assassinations of top DPRK security personnel as demanded by Kim Jong-un.", "userDisplayName": "Jeff", "assetID": 3466332, "recommendationCount": 16, "status": "approved", "replies": [], "userID": 71023891, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 305, "createDate": "1488637202", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21683947, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": null, "rgt": 439, "replyCount": 0, "userLocation": "Canada", "commentSequence": 21683947, "commentBody": "OK, so North Korea is a bad actor. So is Iran. And I'm sure, plenty more out there, if one looks hard enough.<br/><br/>But that doesn't give any country, including the United States the right to wiretap, hack, cyber-attack and execute a drone warfare against  any country it deems appropriate.<br/><br/>We allegedly have a rules-based world order. That doesn't give special privileges, or make exceptions.<br/><br/>Unless of course, the world is an Animal Farm.", "userDisplayName": "waldo", "assetID": 3466332, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 69620519, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 438, "createDate": "1488637351", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21683959, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": null, "rgt": 453, "replyCount": 6, "userLocation": "Brewster,NY", "commentSequence": 21683959, "commentBody": "North Korea, like Iran are building nuclear weapons as a deterrence to the never ending instigations of the USA, plain and simple. It's always possible that a \"leader\" of a country the size of NK would \"attack\" the US, but chances are NK would probably prefer to simply live the way They choose to, and leave the US and its allies alone. Suicide is unlikely to be their preference.<br/><br/>Our government is well aware that neither NK nor Iran are genuine threats to other nations. they are small, frightened countries who are being scapegoated by the USA's very own imperial ambitions. <br/><br/>As usual, the USA creates international \"threats\"; small relatively defenseless countries who are no match to our military power , so as to keep our own population Frightened and distracted by the ongoing kleptocracy. Do not forget Vietnam. Another innocent people terrorized by the USA 40 short years ago. And for what? Corporate profit.<br/><br/>As you view the military pictures associated with this story, bear in mind, for every weapon you see of NK, the USA probably has fifty. Also bear in mind our defense budget is larger than the next ten countries combined. Our 30,000 + nuclear weapons are also nothing to sneer at.<br/><br/>Now, who do you think should be more afraid, NK or the USA?<br/><br/>The article itself is another example of the media pushing a piece of \"drama\" with a pathetically slanted political view of a co called \"threat\". Sad.", "userDisplayName": "KB", "assetID": 3466332, "recommendationCount": 6, "status": "approved", "replies": {"comments": [{"commentID": 21687525, "commentSequence": 21687525, "editorsSelection": false, "updateDate": "1488672378", "depth": 1, "approveDate": "1488672378", "userURL": "NULL", "parentID": 21683959, "createDate": "1488664374", "parentUserDisplayName": "KB", "recommendations": 1, "commentBody": "Bill B, get real . Both of those countries are petrified of the USA.  We are the country that meddles into every other country's affairs. To believe NK or Iran would attack or otherwise intrude into territories of our allies is ludicrous at best. This is another fabrication, just like Vietnam and Iraq. They were very menacing....not. The USA is the world's greatest threat to peace, especially with a war monger in the WH. That's as close to fact as you'll get.", "trusted": 0, "userDisplayName": "KB", "status": "approved", "recommendedFlag": 0, "userID": 70882517, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "Brewster,NY"}, {"commentID": 21689200, "commentSequence": 21689200, "editorsSelection": false, "updateDate": "1488675290", "depth": 1, "approveDate": "1488675290", "userURL": "NULL", "parentID": 21683959, "createDate": "1488673128", "parentUserDisplayName": "KB", "recommendations": 2, "commentBody": "Richard, exactly what might the threat to China be? Kim Jong-un becomes suicidal and decides to have his country destroyed?<br/>Just more American propaganda to keep the populace frightened and distracted while TRUMP et al. fill their coffers.<br/><br/>Next week the story will be about the other great \"threat\" Iran. A country whose international dalliances pale when compared to the USA's, which occur on every continent. Look within. The picture isn't pretty, but we need to put our own house in order.  ", "trusted": 0, "userDisplayName": "KB", "status": "approved", "recommendedFlag": 0, "userID": 70882517, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "Brewster,NY"}, {"commentID": 21691143, "commentSequence": 21691143, "editorsSelection": false, "updateDate": "1488683031", "depth": 1, "approveDate": "1488683031", "userURL": "NULL", "parentID": 21683959, "createDate": "1488682871", "parentUserDisplayName": "KB", "recommendations": 0, "commentBody": "KB,<br/>Get real, it's North Korea that invaded South Korea, not the other way around.  It is hardly ridiculous to believe that North Korea wouldn't attack when they've done it already and have armed forces of over a million.  Likewise, Iran is already supporting armed forces in other territories.  Those are actual facts which are closer to fact than you've gotten.", "trusted": 0, "userDisplayName": "Bill B", "status": "approved", "recommendedFlag": 0, "userID": 4523842, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "NYC"}]}, "userID": 70882517, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 440, "createDate": "1488637417", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21683964, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": null, "rgt": 455, "replyCount": 0, "userLocation": "Cumberland, ME", "commentSequence": 21683964, "commentBody": "Just another outpouring from the cornucopia of evidence that, in Einstein's fateful and prophetic words in a telegram sent back in 1946: \"The unleashed power of the atom has changed everything save our modes of thinking, and thus we drift toward unparalleled catastrophe.\"  Faced with the destructive power of these weapons, theirs and ours, it is natural enough to turn into control-freaks, including trying cyberwarfare. But any doofus can see the dynamic of moves and countermoves  is escalating out of the control of anyone, and the eventual outcome could be a world of pain. On the nuclear level, we have already long passed the point where more convoluted methods of deterrence yield less security than admitting that the game is up, nuclear war (which now could include nuclear winter) has rendered itself obsolete, and the only way to win is not to play. We would actually be safer from North Korea if we made efforts to reduce their paranoia about us and in fact continued to reduce our own arsenals. Hard to imagine Mr. Trump demonstrating this kind of courageous common sense and calling for, say, an international conference of the nine nuclear powers to stay in permanent session until agreements are reached which permanently remove the scourge of these weapons from the planet. Challening? Of course. But no more so than the expensive cockamamie nonsense of our present death-wish-disguised-as-policy.", "userDisplayName": "Patti", "assetID": 3466332, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 55679332, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 454, "createDate": "1488637431", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21683968, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": null, "rgt": 459, "replyCount": 1, "userLocation": "Winter", "commentSequence": 21683968, "commentBody": "It is interesting that people seem to think Jim Jong Il is logical or has a cool head. He has murdered most of his family and recently got rid of five detractors by firing anti-missile guns at them. Living on the West coast and not that far from Alaska, threat of missile attack is very real to me. It is not implausible that North Korea already has the capability to do so. Totalitarian dictators are not rational, but they do respond to \"insults\" from other bullies like Trump, which is very worrisome.", "userDisplayName": "Roberta", "assetID": 3466332, "recommendationCount": 6, "status": "approved", "replies": {"comments": [{"commentID": 21686473, "commentSequence": 21686473, "editorsSelection": false, "updateDate": "1488652423", "depth": 1, "approveDate": "1488652423", "userURL": "NULL", "parentID": 21683968, "createDate": "1488649226", "parentUserDisplayName": "Roberta", "recommendations": 1, "commentBody": "We do need to get rid of our wanna be \"dear leader\". But, bowing to N.Korea &amp; letting him keep advancing in nuclear capability is not the answer. Dictators do respond to the threat of THEM being obliterated. Their slaves not so much. Being cowards in the face of the enemy is never a good idea. Particularly when the enemy is insane. Doing that is the same as egging them on. That is also why just 'giving in\" &amp; ignoring *45 is a bad idea. He must be stopped. He is our problem. Getting rid of him will go a good way to easing tensions between us and the world (including N.Korea).", "trusted": 0, "userDisplayName": "Wolfie", "status": "approved", "recommendedFlag": 0, "userID": 74386130, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "MA. RESISTANCE IS NOT FUTILE"}]}, "userID": 73284143, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 456, "createDate": "1488637446", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684010, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": null, "rgt": 461, "replyCount": 0, "userLocation": "New Jersey", "commentSequence": 21684010, "commentBody": "Once upon a time, this would have been a completely paranoid thought: <br/><br/>Trump becomes president. He and Bannon hatch a way to overthrow democracy and turn America into a dictatorship. They undermine the media. They pump up the military. They undermine the judiciary because it is the last branch of government not completely in thrall to their desires. They name enemies for people to hate and blame: Muslims, Mexicans, etc. Nothing useful gets done for the people because the administration is too busy jettisoning anything that can stand in their way. Their approval rating goes down. Congress finally gets restless.<br/><br/>Then...boom! Start a war with someone. China...or more likely, North Korea. Here's the kicker. They're both nuts. And Trump seems to like the Madman Theory. He escalates something that could have been defused easily. Kim loses it and unleashes a nuclear warhead that lands somewhere on the West Coast killing millions. Now, we've unleashed WWIII. In wartime, presidents tend to have astronomical approval ratings. It would be fatally easy to spin the whole incident to make the USA into innocent victims and now most of the country rallies behind him. A portion of the country resists. Martial law is declared to shut protesters down. And now Trump has complete power over the country and can suspend or change any number of laws in the name of national security. <br/><br/>MAGA, guys.", "userDisplayName": "NMY", "assetID": 3466332, "recommendationCount": 12, "status": "approved", "replies": [], "userID": 21338958, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 460, "createDate": "1488637587", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684066, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": null, "rgt": 465, "replyCount": 1, "userLocation": "Pacific Northwest", "commentSequence": 21684066, "commentBody": "This article should have been headlined, “Obama administration permitted North Koreans to advance their nuclear missile program exponentially.” Merely reporting Obama’ s existential angst over the development is woefully inadequate and protective of the former president’s legacy. Over eight years President Obama did nothing effective to counter the North's advancements in weapons technology; that failure should be part of any report on this crisis.<br/> I am outraged at the cover consistently granted to the former administration, neglecting to emphasize the rank incompetence that has left our nation exceedingly vulnerable to nuclear attack, and/or the total destruction of our electrical grid by the North Koreans. <br/><br/>Second, the US and the Israelis did more than cyber-attack Iran. It seems one or the other, or both, assassinated at least one of Iran’s top nuclear scientists (and in a second attack, a scientist's innocent wife); and seriously maimed another (in all cases using car-bombs attached by motorcyclists in traffic).<br/><br/>Furthermore, it is downright perverse that China continues to escape sanctions and clear condemnation as North Korea’s enabler.<br/><br/>Finally, is there anyone sufficiently responsible in the media to point out that the fake news about Russia being the number one threat to America is significantly detracting from the American people (and their representatives) becoming focused on the imminent military threat to our nation from North Korea?", "userDisplayName": "Michael Hoffman", "assetID": 3466332, "recommendationCount": 11, "status": "approved", "replies": {"comments": [{"commentID": 21684791, "commentSequence": 21684791, "editorsSelection": false, "updateDate": "1488641232", "depth": 1, "approveDate": "1488641232", "userURL": "NULL", "parentID": 21684066, "createDate": "1488640399", "parentUserDisplayName": "Michael Hoffman", "recommendations": 1, "commentBody": "You are right but the problem started with Bill Clinton when we gave them food aid but had no inspections on the agreement to stop enrichment. Can't blame just one party either, both have allowed this boil to fester and it will lead to disaster if not stopped. The Chinese can solve this problem but the USA refuses to play hard ball with them.", "trusted": 0, "userDisplayName": "Abbott Hall", "status": "approved", "recommendedFlag": 0, "userID": 63841340, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "Westfield, NJ"}]}, "userID": 62218655, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 462, "createDate": "1488637820", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684089, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": null, "rgt": 473, "replyCount": 3, "userLocation": "New York", "commentSequence": 21684089, "commentBody": "Countdown to doomsday; one of the biggest threats to human existence is a nuclear war. With so many nuclear weapons all over the world, the inevitable and inescapable realism that a nuclear holocaust can occur is upon us. Whether it is intentional or by a catastrophic accident, the first launch of any of these weapons by any country will set forth a chain reaction of events from which there is no turning back. There will be no winners should these weapons be used. <br/><br/>We have come a long way as a race with amazing advancements and we are still as barbaric as when we first evolved. Hopefully, as a human race we can come together and turn this around, obliterating these weapons once and for all.", "userDisplayName": "AAF", "assetID": 3466332, "recommendationCount": 12, "status": "approved", "replies": {"comments": [{"commentID": 21684519, "commentSequence": 21684519, "editorsSelection": false, "updateDate": "1488654383", "depth": 1, "approveDate": "1488654383", "userURL": "NULL", "parentID": 21684089, "createDate": "1488639489", "parentUserDisplayName": "AAF", "recommendations": 1, "commentBody": "Look at the dim bulb we have in the White House and despair!  All he cares about, like his North Korean counterpart, is maintaining a personality cult at public expense, come what may...", "trusted": 0, "userDisplayName": "Tournachonadar", "status": "approved", "recommendedFlag": 0, "userID": 10293673, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "Illiana"}, {"commentID": 21685104, "commentSequence": 21685104, "editorsSelection": false, "updateDate": "1488643529", "depth": 1, "approveDate": "1488643529", "userURL": "NULL", "parentID": 21684089, "createDate": "1488641581", "parentUserDisplayName": "AAF", "recommendations": 1, "commentBody": "Your typical nuclear holocaust involves one country launching its missiles at another from their own territory.   However, if North Korea wants to be sneaky, they only need to launch 2-3 missiles from container ships off our coast, explode them at an altitude of several hundred miles, and let the EMP from those bursts destroy our electric grid, autos, trains, planes, computers, phones, radio, etc. by shorting out their electronics.<br/><br/>While the anonymity of the aggressor is not guaranteed and we might nuke North Korea on spec, the result would still be that with communications and most transit disabled, we would most likely have confusion, mass starvation and disease  to deal with.<br/><br/>It doesn't take a nuclear holocaust to shut us down.  Because of our acceptance of electronics that is susceptible to EMP, most of our civilization would grind to a halt in such an attack.<br/><br/>This is different from a full scale nuclear attack in that it requires far fewer warheads which can be launched anonymously at sea from third party container ships which is well within North Korea's capabilities today.  While our military would survive this attack, it is not clear that we would still have the ability to do the forensics after to determine the perpetrator.  Plus we would have mass chaos to deal with after.", "trusted": 0, "userDisplayName": "BillH", "status": "approved", "recommendedFlag": 0, "userID": 75766078, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "Seattle"}, {"commentID": 21686264, "commentSequence": 21686264, "editorsSelection": false, "updateDate": "1488652423", "depth": 1, "approveDate": "1488652423", "userURL": "NULL", "parentID": 21684089, "createDate": "1488647505", "parentUserDisplayName": "AAF", "recommendations": 0, "commentBody": "You admit, without saying it, that there will always be war. Are conventional weapons so much safer? Send a B-1 Bomber over the Kremlin full of HE &amp; Thermo conventional weapons &amp; there will still be a fire storm. If you kill all the people in an area, does it really matter if it is done with conventional explosives or nukes? Not to them I think. Your scenario is only going to come to pass if a small country (N.Korea) launches one or 5 small nukes at us, that China, Russia, Vietnam will all launch at us right then too. When I think China &amp; Russia will be more pragmatic &amp; if they launch at all, it will be at N.Korea with more deadliness than we will. They don't want world destruction. They don't want their own destruction. Our allies will launch at them if they launch at us. N.Korea if they launch will be risking total destruction by their allies. Dear leader doesn't care about his people, but, he wants to live. With his so called allies standing ready to add to his destruction he will lose that option. They know where his secret hiding places are. Even if we miss one or two. Other countries with nukes (like India &amp; Pakistan) will not fire their hard won nukes on anyone but each other. They won't do that if all the missiles are heading in other directions.", "trusted": 0, "userDisplayName": "Wolfie", "status": "approved", "recommendedFlag": 0, "userID": 74386130, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "MA. RESISTANCE IS NOT FUTILE"}]}, "userID": 66775831, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 466, "createDate": "1488637931", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684098, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": 21683395, "rgt": 230, "replyCount": 0, "userLocation": "<br/>", "commentSequence": 21684098, "commentBody": "Kim is a world threat. He has been, with previous leader for awhile. Under the Chinese umbrella makes it harder. Also the lessening of relations with the Chinese does not help. How China would react to what we do needs to be considered. Behind all this is still the knowledge this guy has is any misuse of his nukes as to the US would turn his country into a parking lot. This guy likes his high standard of living and enjoys his standard of life. He is not driven by any amount of supposed virgins waiting for him in heaven under any twisted version of a religion like the jihadists are.  Yes US a divided country but not even close to the past. The late sixties over Nam, civil rights etc was way worse. Chicago 68 convention and urban riots way worse. Most Americans are fairly content with life though may have political issues but are not taking up arms as to an overthrow. Economically it isn't perfect as to wages being stagnant but retail isn't bad, housing is way up, auto sales are good and we line up for the next version of the I-phone. Those women in the streets went home to their lives, though vocal, didn't rush to gun stores for arms. Normalizing this President? The guy wishing to hold hands Putin who supports Iran and Assad major supporters of terrorism? Putin who invaded Crimea and helps Eastern Ukraine take commercial jets down? What would Reagan say about Trump cuddling up to Putin. Reagan who said \"Take down this wall.\" Would he say \"Putin support Assad and Iran?\" ", "userDisplayName": "Jim", "assetID": 3466332, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 58328348, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 229, "createDate": "1488637959", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684114, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": 21683477, "rgt": 200, "replyCount": 0, "userLocation": "Washington, DC", "commentSequence": 21684114, "commentBody": "The ultimatum Kennedy gave the USSR had to do with the positioning of missiles in Cuba, 90 miles off our coast, cutting our response time. Hardly comparable. Our placement of tactical nukes in S. Korea would be comparable to what the Soviets did to us. Better to have more sub based deterrents, I would have thought.", "userDisplayName": "MEH", "assetID": 3466332, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 6774771, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 199, "createDate": "1488638010", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684138, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": null, "rgt": 479, "replyCount": 2, "userLocation": "Candler NC", "commentSequence": 21684138, "commentBody": "While I am most definitely on the side of a free press, and fully endorse the public exposure of threats to our government and our way of life, I feel that this article runs too close to parallel of Snowden's indiscriminate release of classified documents.  There are certainly going to be repercussions from N. Korea as their leader has many of DJT's characteristics in his need for total loyalty, adoration and affirmation.  It is almost like a challenge. I don't think that exposure of our  tactics against threats need to be made public, especially at a time where the threat has not yet been neutralized. This amounts to shaking a red flag in the face of a rabid bull. Our real safety is in jeopardy as we continue to have incidents balance on the very edge of danger as we have embarked on a path that is at the whim of an unstable and unpredictable leader who just today, in retaliation for deeper investigation to his administration's members contacts with Russia, tweeted that Obama had his phones tapped. If you compare the incidents happening to us today with the coverage we have had about unstable third world countries, we are in a very precarious position globally. Time for the politics to be sidelined and REAL work to resume.", "userDisplayName": "Mountain Dragonfly", "assetID": 3466332, "recommendationCount": 4, "status": "approved", "replies": {"comments": [{"commentID": 21686141, "commentSequence": 21686141, "editorsSelection": false, "updateDate": "1488648792", "depth": 1, "approveDate": "1488648792", "userURL": "NULL", "parentID": 21684138, "createDate": "1488646800", "parentUserDisplayName": "Mountain Dragonfly", "recommendations": 0, "commentBody": "The real work is for those of us who really care, to get off our but ts, march on DC, &amp; remove the illegal, insane, so called elected at the top. Doing it armed &amp; with premeditation (as in training). Remove with the idea they will never be able to harm us, or even try again. That includes *45, his evil minions (staff, cabinet, at least the leaders [both sides] of congress), &amp; those \"fans\" who try to stop us. Anything less will do nothing. They must be gone, contained or executed.", "trusted": 0, "userDisplayName": "Wolfie", "status": "approved", "recommendedFlag": 0, "userID": 74386130, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "MA. RESISTANCE IS NOT FUTILE"}, {"commentID": 21686593, "commentSequence": 21686593, "editorsSelection": false, "updateDate": "1488651705", "depth": 1, "approveDate": "1488651705", "userURL": "NULL", "parentID": 21684138, "createDate": "1488650767", "parentUserDisplayName": "Mountain Dragonfly", "recommendations": 0, "commentBody": "Wolfie...if you remove the suggestion of arms and execution, I would be inclined to agree with you.  However, your introduction of violence into the mix takes us exactly to the same place that most reasonable Americans would attribute to the very menace that we are trying to neutralize. Protest, resist, investigate, and use our courts and other legal pathways to achieve our goals without destroying our values and democracy in the process.", "trusted": 0, "userDisplayName": "Mountain Dragonfly", "status": "approved", "recommendedFlag": 0, "userID": 53925296, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "Candler NC"}]}, "userID": 53925296, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 474, "createDate": "1488638084", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684159, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": null, "rgt": 485, "replyCount": 2, "userLocation": "Houston", "commentSequence": 21684159, "commentBody": "Despite my considerable misgivings about our new president, I have to give him credit for responding to North Korea's recent missile testing with (admittedly uncharacteristic) restraint. He also appears to actually be listening to his advisers with respect to military issues, and in the context of the DPRK potentially developing ICBMs, Trump having a team of former U.S. generals and admirals advising him is a considerable plus.<br/><br/>I'm also thankful to The Times for elucidating one is arguably *the* most serious threat to global security -- and I'd note that anyone equating North Korea to Iran on the subject is dangerously misguided. Iran is aggressive, yes, but by all accounts it's a rational actor. North Korea, on the other hand, is run by a bona fide megalomaniac with a sizable cult of personality who simply executes anyone -- including his own family members, as we saw in the recent Kuala Lumpur attack -- who even *vaguely* challenges his authority.<br/><br/>Until today I assumed we already had the necessary countermeasures in place to intercept an inbound ICBM. We apparently do not, and this is now the first time in my 45-year lifetime that I harbor a genuine fear of a nuclear strike, either real or attempted. The Soviet Union was always deterred by the doctrine of mutually-assured destruction; Mr. Kim has given zero indication that he feels the same. Regardless of one's political views, that fact should chill every American to the bone.", "userDisplayName": "Jeff", "assetID": 3466332, "recommendationCount": 36, "status": "approved", "replies": {"comments": [{"commentID": 21685014, "commentSequence": 21685014, "editorsSelection": false, "updateDate": "1488643529", "depth": 1, "approveDate": "1488643529", "userURL": "NULL", "parentID": 21684159, "createDate": "1488641279", "parentUserDisplayName": "Jeff", "recommendations": 2, "commentBody": "I am not sure how you arrived at the misconception that missile interceptors can protect the homeland.  If at all, I am positively impressed reading that the failure rate is only 56% under ideal conditions.  For all practical purposes we should assume that it doesn't work at all.", "trusted": 0, "userDisplayName": "Kara Ben Nemsi", "status": "approved", "recommendedFlag": 0, "userID": 884629, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "On the Orient Express"}, {"commentID": 21686086, "commentSequence": 21686086, "editorsSelection": false, "updateDate": "1488651705", "depth": 1, "approveDate": "1488651705", "userURL": "NULL", "parentID": 21684159, "createDate": "1488646504", "parentUserDisplayName": "Jeff", "recommendations": 1, "commentBody": "One insane \"leader\" threatens another with a slapped wrist if he launches a nuclear missile at us. He does not fear mutually assured destruction because he has already destroyed his country. Now he wants to do the same to us. But, one missile, even 5 will not destroy us. No matter where they hit. Americans will die, cities lost. It would be awful. But, enough would be left to keep going. Unlike us carpet bombing N.Korea with small tactical nukes (fairly soon to expire anyway). One nuke launches. N.Korea destroyed. Now, do Americans still have the balls to do that? I am, sadly, no longer sure. We won't even fight for our own country. Let alone to protect the world.<br/>Fill B-1 Bombers with both all our tactical nukes, &amp; old fashioned HE &amp; Thermo bombs, Keep airborne near enough to N.Korea, that they will know that if they launch even one more test missile, we will obliterate them. Of course telling China that this is in their defense also, as the closest world power to N.Korea. Suggesting they do the same (bombers loaded &amp; ready). So N.Korea would be gone before one small missile from them has had time to travel here. We could still use our 56% successful deterrent. So, better than even chance it wouldn't ever hit us anyway. (While working to improve the system. That military money should be spent. Making what we have better, not buying more of the not quite so good.)", "trusted": 0, "userDisplayName": "Wolfie", "status": "approved", "recommendedFlag": 0, "userID": 74386130, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "MA. RESISTANCE IS NOT FUTILE"}]}, "userID": 71023891, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 480, "createDate": "1488638181", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684169, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": null, "rgt": 489, "replyCount": 1, "userLocation": "Washington DC", "commentSequence": 21684169, "commentBody": "This is why Oppenheimer (and others) may have right all along...and Strauss and others (McCarthy, etc.,) and the virulent right-wing -- with its nuclear power for the US, USSR, Britain and France only -- seems today to be so very wrong...<br/>Peaceful nuclear power should have, under a global agreement, been released in the 1950s in a regulated fashion and fissionable materials turned into a highly regulated material that is tracked where ever and whenever it is made or transported, used up or disposed of (under a system that punishes any violation).  The result could and should have been a regime under which misuse of the atom would have been nearly impossible and violation reason for severe ramifications.<br/>Instead, we have a hidden and world-destroying technology that nations want and must secretly develop with their activities feared the rest of the world.", "userDisplayName": "Rdam", "assetID": 3466332, "recommendationCount": 4, "status": "approved", "replies": {"comments": [{"commentID": 21685926, "commentSequence": 21685926, "editorsSelection": false, "updateDate": "1488648792", "depth": 1, "approveDate": "1488648792", "userURL": "NULL", "parentID": 21684169, "createDate": "1488645684", "parentUserDisplayName": "Rdam", "recommendations": 0, "commentBody": "Actually, maybe we should have taken Eisenhower's suggestion. Use both conventional &amp; nuclear weapons to destroy the SovUnion right after WW2. Both to keep the world safe, &amp; to free the slave states the SovUnion kept adding. Then also we should have helped China, when it asked, for help after WW2. We helped the aggressors (Japan), other of the ruined Asian states, like South Korea (Russia grabbed N.Korea &amp; later China). By saying no to countries like China &amp; N.Korea &amp; N.Vietnam, we set this scenario up. But let Russia keep any country they traveled over to take down Germany. <br/><br/>Since you give no ideas for these severe ramifications, I figure it would be more of the same wishy washy, must not make them upset, types we have used over &amp; over since WW2? Our forays into \"police actions\" actually just prove my theory. Even with the deaths of our people, we have not gone in to any enemy country with the will to win, since WW2. Letting hundreds of thousands of our boys die is fine. But, must not upset the country attacking our allies.", "trusted": 0, "userDisplayName": "Wolfie", "status": "approved", "recommendedFlag": 0, "userID": 74386130, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "MA. RESISTANCE IS NOT FUTILE"}]}, "userID": 64595365, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 486, "createDate": "1488638204", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684182, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": null, "rgt": 491, "replyCount": 0, "userLocation": "Philadelphia, PA", "commentSequence": 21684182, "commentBody": "It is naïve to think that the other powers are not developing cyber tactics against our launch capabilities, including nuclear facilities. Yes, we should develop ours, especially with a lose cannon like Un. This could be one of our best defenses. We need every possible tool in our arsenal.  <br/><br/>Otherwise, we are in a situation that a preemptive strike does not play well on the international field; consequently, we may have to take it on the chin first before we unleash hell.  ", "userDisplayName": "Michael Eichert", "assetID": 3466332, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 59725116, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 490, "createDate": "1488638258", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684185, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": null, "rgt": 499, "replyCount": 3, "userLocation": "Belmont MA", "commentSequence": 21684185, "commentBody": "Although North Korea is developing nuclear weapons and advanced delivery systems, its people are enduring privation and hunger. Its leader kills his suspected opponents at will.<br/><br/>It would be rational for the United States to consider bombing North Korea's bomb-making facilities, stockpiles, and missile launching pads.", "userDisplayName": "Diogenes", "assetID": 3466332, "recommendationCount": 5, "status": "approved", "replies": {"comments": [{"commentID": 21684674, "commentSequence": 21684674, "editorsSelection": false, "updateDate": "1488654384", "depth": 1, "approveDate": "1488654384", "userURL": "NULL", "parentID": 21684185, "createDate": "1488640004", "parentUserDisplayName": "Diogenes", "recommendations": 1, "commentBody": "It strikes me, Diogenes, that your comment reflects exactly what many Westerners were thinking about the USSR in 1950.  History repeats itself.<br/><br/>By the way, didn't I see you on the beach at Thessaloniki some time ago?", "trusted": 0, "userDisplayName": "James K. Ribe, MD", "status": "approved", "recommendedFlag": 0, "userID": 6800326, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "Los Angeles"}, {"commentID": 21685475, "commentSequence": 21685475, "editorsSelection": false, "updateDate": "1488643268", "depth": 1, "approveDate": "1488643268", "userURL": "NULL", "parentID": 21684185, "createDate": "1488643242", "parentUserDisplayName": "Diogenes", "recommendations": 4, "commentBody": "That would be rational only if there were some way to ensure it would end there. How would it end? The other side gets a say.", "trusted": 1, "userDisplayName": "Mark Thomason", "status": "approved", "recommendedFlag": 0, "userID": 37674938, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "Clawson, Mich"}, {"commentID": 21685808, "commentSequence": 21685808, "editorsSelection": false, "updateDate": "1488652422", "depth": 1, "approveDate": "1488652422", "userURL": "NULL", "parentID": 21684185, "createDate": "1488645038", "parentUserDisplayName": "Diogenes", "recommendations": 0, "commentBody": "The launching facilities are moveable. With the missiles.  We would have to warn China first (secretly of course, but, would they tell NK or not?). If they have any immobile launching facilities I bet they are within miles of China.", "trusted": 0, "userDisplayName": "Wolfie", "status": "approved", "recommendedFlag": 0, "userID": 74386130, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "MA. RESISTANCE IS NOT FUTILE"}]}, "userID": 38816970, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 492, "createDate": "1488638260", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684202, "editorsSelection": 0, "updateDate": "1488638518", "approveDate": "1488638518", "parentID": null, "rgt": 501, "replyCount": 0, "userLocation": "New York", "commentSequence": 21684202, "commentBody": "This article was eye opening, great reporting. The only sane choice is for China to take a larger role in this very frightening nuclear arms race, the Chinese have some of the tools that could deter this insane situation from literally blowing up. We need to work with the Chinese, not threaten them with trade wars, not send tweets, really dig in and get to work to stabilize this growing threat to world peace.", "userDisplayName": "Christine Wopat", "assetID": 3466332, "recommendationCount": 61, "status": "approved", "replies": [], "userID": 62910963, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 500, "createDate": "1488638308", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21683125, "editorsSelection": 1, "updateDate": "1488638523", "approveDate": "1488638523", "parentID": null, "rgt": 2103, "replyCount": 0, "userLocation": "Tulsa", "commentSequence": 21683125, "commentBody": "A good deal of the problem is that no one knows the extent of Trump's financial investments and where his potential conflicts of interest lie.  His refusal to release his taxes and to effectively place his estate in a blind trust breed suspicion.  He then surrounds himself with sycophants and billionaires.  He defends Russia and Putin while insulting our longtime allies, attempts to discredit anyone who questions him and seeds doubt into the integrity of our checks and balances.  ", "userDisplayName": "hla3452", "assetID": 3466329, "recommendationCount": 183, "status": "approved", "replies": [], "userID": 68692972, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2102, "createDate": "1488634087", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21683130, "editorsSelection": 0, "updateDate": "1488638527", "approveDate": "1488638527", "parentID": 21681584, "rgt": 1536, "replyCount": 0, "userLocation": "NYC", "commentSequence": 21683130, "commentBody": "Of course they talk to each other.<br/>But then why lie that you did not?", "userDisplayName": "Helen", "assetID": 3466329, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 61664980, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1535, "createDate": "1488634129", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684252, "editorsSelection": 0, "updateDate": "1488638529", "approveDate": "1488638529", "parentID": 21683616, "rgt": 332, "replyCount": 0, "userLocation": "Bloomington IN", "commentSequence": 21684252, "commentBody": "I get that this article is long and detailed, but maybe you should actually read it to learn what actions were taken. Then look up \"unfettered\" in the dictionary.<br/><br/>The existence of one immediate threat doesn't mean that you should ignore others that require a long-term strategy.", "userDisplayName": "C Wolfe", "assetID": 3466332, "recommendationCount": 19, "status": "approved", "replies": [], "userID": 30644652, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 331, "createDate": "1488638516", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684246, "editorsSelection": 0, "updateDate": "1488638530", "approveDate": "1488638530", "parentID": null, "rgt": 1379, "replyCount": 0, "userLocation": "Los Angeles", "commentSequence": 21684246, "commentBody": "How can the top law enforcer LIE to all of us? Sessions should resign. <br/><br/>But, so many in the Trumpists met with Russians in the run up to last year's election it blows the mind. Why did they meet with Russians?<br/><br/>Before last year's Convention, NPR reported:<br/>\"When Republican Party leaders drafted the platform prior to their convention in Cleveland last month, they had relatively little input from the campaign of then-presumptive nominee Donald Trump on most issues — except when it came to a future Republican administration's stance on Ukraine.\"<br/><br/>The Trump campaign convinced the platform committee to change language calling on the U.S. to provide Ukraine \"lethal defensive weapons\" to the more benign phrase \"appropriate assistance.\"<br/><br/>Then this from This Week:<br/>Stephanopoulos: \"Then why did you soften the GOP platform on Ukraine?\"<br/><br/>Trump: \"I wasn't involved in that. Honestly, I was not involved.\"<br/><br/>Stephanopoulos: \"Your people were.\"<br/><br/>Trump: \"Yeah. I was not involved in that. I'd like to -- I'd have to take a look at it. But I was not involved in that.\"<br/><br/>Stephanopoulos: \"Do you know what they did?\"<br/><br/>Trump: \"They softened it, I heard, but I was not involved.\"<br/><br/>Trump added: .<br/><br/>\"The people of Crimea, from what I’ve heard, would rather be with Russia than where they were.\"<br/><br/>Something is rotten in Washington..<br/><br/>This is a true test of our Republic, Fox News/Murdoch, John McCain, Rand Paul, Lindsey Graham, and the rest of the feckless Republicans. <br/><br/>Who do you put first, country or party?", "userDisplayName": "V", "assetID": 3466327, "recommendationCount": 22, "status": "approved", "replies": [], "userID": 23078829, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1378, "createDate": "1488638488", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680318, "editorsSelection": 0, "updateDate": "1488638535", "approveDate": "1488638535", "parentID": 21679313, "rgt": 66, "replyCount": 0, "userLocation": "St. Lawrence, NY", "commentSequence": 21680318, "commentBody": "@Eric from NJ wrote: \"Obamacare should have been repealed on January 21 with an end date of December 31. That would have given Congress enough time to come up with a new plan.\"<br/><br/>Um, the Republi-cants in Congress have had 8 years to \"come up with a new plan\" (which they assured us they've been working on); but in those 8 years, they never came up with a plan.  Now you expect them to pull off that feat in a year?  <br/><br/>Dream on (or as you Foxbots like to say: \"Keep drinking the Kool-Aid\")....", "userDisplayName": "Paul-A", "assetID": 3466322, "recommendationCount": 33, "status": "approved", "replies": [], "userID": 65902708, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 65, "createDate": "1488601126", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680455, "editorsSelection": 0, "updateDate": "1488638535", "approveDate": "1488638535", "parentID": null, "rgt": 1299, "replyCount": 0, "userLocation": "No", "commentSequence": 21680455, "commentBody": "Your \"states rights\" position is not only wrong it's hypocritical.  You only support states rights when it suits your ideology.  For example, you will support Trumps plan to remove California 's power to regulate emissions.  And you won't let states differ from your desire to make immigrants into villains.  You don't fool us sir.", "userDisplayName": "Douglas", "assetID": 3466322, "recommendationCount": 16, "status": "approved", "replies": [], "userID": 53730037, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1298, "createDate": "1488602215", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680518, "editorsSelection": 0, "updateDate": "1488638535", "approveDate": "1488638535", "parentID": null, "rgt": 1301, "replyCount": 0, "userLocation": "Turkey", "commentSequence": 21680518, "commentBody": "I abhor Scott Walker.  This is not a vision for America or Americans.  We are AMERICANS.  I love our collective ethos, our spirit, and the most inspiring parts of our history -- and, in spite of this current backslide, we are still trying to make things right for ALL Americans. Scott Walker is no patriot.  According to this op-ed, he wants to divide the country.  The federal government has worked for the people to make America what it is -- indeed it has been one of the greatest countries in the world -- and now Republicans like Walker are working ceaselessly to **tear it all down**.  Abolish federal education, abolish the EPA, support big business *extraction* of all kinds, implement militarized policing, attack the media, defund the arts, the destructive list goes on and on!  We are not simply residents of states functioning independently of one another -- we are AMERICANS.<br/><br/>I work abroad right now, and I live in a place where I can't drink the tap water, there are no public libraries, and no one dares protest government corruption any longer -- they are too afraid.  I have friends who scoff at the American government, and they simply have no concept of what they already have, and what they stand to lose.  Shame on Scott Walker for doing the same.  This man is terrible.  This man has the wrong words, the wrong vision.  This man is not to be followed or believed.  This man is not to be trusted.", "userDisplayName": "J.", "assetID": 3466322, "recommendationCount": 13, "status": "approved", "replies": [], "userID": 67839850, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1300, "createDate": "1488602713", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680836, "editorsSelection": 0, "updateDate": "1488638535", "approveDate": "1488638535", "parentID": null, "rgt": 1303, "replyCount": 0, "userLocation": "New York", "commentSequence": 21680836, "commentBody": "State your argument and make your case, but It is an outrageous presumption for Governer Walker to justifiy his agenda by stating, \"This is how our founders envisioned our country...\" I suggest he read about the drafting and ratification of the Constitution -- particularly \"our founders\" Madison, Hamilton and George Washington.", "userDisplayName": "Robert", "assetID": 3466322, "recommendationCount": 7, "status": "approved", "replies": [], "userID": 12335584, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1302, "createDate": "1488606113", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681058, "editorsSelection": 0, "updateDate": "1488638535", "approveDate": "1488638535", "parentID": 21680958, "rgt": 272, "replyCount": 0, "userLocation": "Somewhere in Maryland", "commentSequence": 21681058, "commentBody": "What does the above post mean? It seems like a drunken rant. Why does this guy get the green check mark of \"verified\"?", "userDisplayName": "Doug Terry", "assetID": 3466322, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 65455323, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 271, "createDate": "1488609421", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}], "api_timestamp": "1488826222"}, "debug": {"version": 3.1}, "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "status": "OK"}