{"results": {"totalCommentsFound": 8064, "totalCommentsReturned": 25, "comments": [{"commentID": 21682709, "editorsSelection": 0, "updateDate": "1488638793", "approveDate": "1488638793", "parentID": null, "rgt": 1375, "replyCount": 0, "userLocation": "cky", "commentSequence": 21682709, "commentBody": "   Trump's election is the unintended consequence of Republican cynicism.  You speak of the Constitution?  McConnell immediately repudiated his oath to the Constitution and declared that his \"number one priority\" was to make Obama a one-term President. He cared nothing for the Constitutions, or for his constitutents, or for the Nation.<br/>     No so-called populist revolt would have come to pass if cynical Republicans had cared to lissten to their constituents instead of ruthlessly manipulating them.  They certainly did not want Trump, and I'm sure they are as horrified as I am at the spectacle of America's shame.<br/>     Trump is the reductio ad absurdum of cynical political manipulation.  America will be tarnished by this disgrace for decades to come. ", "userDisplayName": "nickwatters", "assetID": 3466295, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 51180061, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1374, "createDate": "1488632194", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21683239, "editorsSelection": 0, "updateDate": "1488638794", "approveDate": "1488638794", "parentID": 21680628, "rgt": 1310, "replyCount": 0, "userLocation": "Texas", "commentSequence": 21683239, "commentBody": "Love your post and especially love the 'fungible facts'.", "userDisplayName": "comanchesue", "assetID": 3466329, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 78980348, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1309, "createDate": "1488634600", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21683242, "editorsSelection": 0, "updateDate": "1488638816", "approveDate": "1488638816", "parentID": 21681664, "rgt": 1568, "replyCount": 0, "userLocation": "New York", "commentSequence": 21683242, "commentBody": "On the contrary, we recognize an orchestrated political effort when we see one.  <br/><br/>Democrats never called for their Attorney General to step down when she was caught on the tarmac with Bill Clinton.  Their outrage now is meaningless.  Democrats also met with the Russian ambassador, forgot and \"lied\" about it.  Their allegations based on the very existence of meetings is meaningless.<br/><br/>There is still no evidence to dispute what participants in those meetings claimed was discussed.  In fact, the one consistent theme in all these charges is the lack of evidence behind the democrats' charges.<br/><br/>What Trump supporters see is an Obama smear campaign.  Hopefully, rightwing media will investigate his role in this.  It's shameful.  I hope President Trump purges his Administration, especially at Justice, of all Obama operatives.  They're like cult members, devoted to him and will obviously do anything.", "userDisplayName": "AACNY", "assetID": 3466329, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 73444633, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1567, "createDate": "1488634609", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21683244, "editorsSelection": 0, "updateDate": "1488638827", "approveDate": "1488638827", "parentID": null, "rgt": 2119, "replyCount": 0, "userLocation": "New Mexico", "commentSequence": 21683244, "commentBody": "In March of 2015, Sessions was pushing strength and opposition to Russia and Putin.   By March of 2016, that had all changed.  Why the change?   He joined Trump's campaign.   First you hate em, then you love em Sessions switched horses.   Why?  Money? Power? Vindication?  How many are going to fall on their swords for Trump?   It ain't over yet.  ", "userDisplayName": "Edgar", "assetID": 3466329, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 65840548, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2118, "createDate": "1488634624", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684328, "editorsSelection": 0, "updateDate": "1488638828", "approveDate": "1488638828", "parentID": 21681812, "rgt": 44, "replyCount": 0, "userLocation": "Weston CT", "commentSequence": 21684328, "commentBody": "Well, as someone who has had the pleasure of learning (and singing!) the Provençal national hymn, I will essay the following:<br/><br/>The troubadour implores the protaganist of Dante's epic poem:<br/>I beg of you, in the name of that power<br/>that guides you now to the top of the ladder,<br/>remember at whiles my suffering (here below).<br/><br/>That's the best my medieval Provençal can attempt. (Hee hee.)<br/><br/>My literal reading would be:<br/>I you pray, for that valor<br/>which you guides to-the summit of the-stairstep,<br/>remember you at times of my sorrow", "userDisplayName": "David Connell", "assetID": 3466330, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 69450816, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 43, "createDate": "1488638795", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/crosswords/after-more-information-is-revealed-cotton-bowl-orange-cotillard.html", "userURL": "NULL"}, {"commentID": 21679704, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": 21671281, "rgt": 254, "replyCount": 0, "userLocation": "<br/>", "commentSequence": 21679704, "commentBody": "Agreed;  I believe it is for others to deem a country 'exceptional' certainly in the self-aggrandising way it seems to be meant.. an acknowledgement, say, for that country's efforts on behalf of and attitudes to the rest of the world;   for a person, or a country to self-describe as 'exceptional' shows ignorance.  I've seen bragging and boasting in the playground; this self-importance on behalf of this country (in thrall to a bigot, being led by the nose down a disgusting path to self-righteousness) - well, as an American, I am deeply ashamed.  We might like to be thought of as 'exceptional' but in our case it is not for the right reasons.  We are exceptional in how we treat our poor (wages) our sick (no universal health care), our education, (lack of affordable college), family leave, dismissal of science, disregard for regulations for the environment, and failure to protect our citizens against 300 million + handguns and worse. And so on;   This is making us 'exceptional'.  What other meaning to that word could there be?<br/>Elizabeth Barry", "userDisplayName": "Elizabeth Barry", "assetID": 3466295, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 62251749, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 253, "createDate": "1488596755", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21679954, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1377, "replyCount": 0, "userLocation": "USA", "commentSequence": 21679954, "commentBody": "With a background similar to Roger Cohen's, I too took my oath of allegiance and became a proud citizen of the United States of America - in my case, some 65 years ago. Little did I think until very recently that I pledged allegiance to a government that now might no longer represent the values citizens of this country have cherished ever since its founding. Among  these was to stand as a beacon and example of a true democracy for the entire world. If we break that vision today, we will indeed have caused deep disappointment in all freedom-loving nations. I am ashamed of the injuries that are being done these days in Washington to so many of our precious precepts.<br/>AM", "userDisplayName": "AM", "assetID": 3466295, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 64485206, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1376, "createDate": "1488598601", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21680022, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1379, "replyCount": 0, "userLocation": "New Jersey", "commentSequence": 21680022, "commentBody": "This is simple moral confrontation, just as most political confrontations are. The Trump/Putin philosophy is that lying, cheating, stealing, conspiring, doing everything underhanded and even evil, is the right way to run one's life and, therefore, also one's country. Truth, justice, equality, honor. principle, and a love of mankind are the philosophy of the weak, intellectual, spoiled, and easily conned people.  It's not simply good verses evil, it is the very basis of the definition of good and evil. Orwell gave us a view where the former philosophy gave us \"War is Peace\", etc. Where the state is superior to the individuals. Good is people who put the value of people ahead of the value of money and government.   ", "userDisplayName": "Roger Duronio", "assetID": 3466295, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 68135753, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1378, "createDate": "1488599038", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21680286, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": 21679472, "rgt": 1330, "replyCount": 0, "userLocation": "melville, ny", "commentSequence": 21680286, "commentBody": "you left out his other accomplishments. lay the groundwork for the destruction of our environment, roll back financial controls so the wall street billionares can cause another financial collapse, while they walk away with billions,  prepare to lower taxes on the very wealthy while allowing financial advisors to rip off their clients, make a mockery of the presidency with his endless lie filled tweets, prepare the way for Ryan and his minions to destroy social security, medicare, and Medicaid. Empower rascists, misogynists, and white supremacists to go public with their hate.  if anybody should be eating caca it's people like you that accept this buffoon and what he does", "userDisplayName": "bob", "assetID": 3466295, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 53144486, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1329, "createDate": "1488600901", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21680507, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1381, "replyCount": 0, "userLocation": "Lima, Peru.", "commentSequence": 21680507, "commentBody": "Nobody should be surprised that Trump the president is none other than Trump the candidate, with all his obvious moral, intellectual and ideological shortcomings; it was extremely foolish to think or assume that candidates are free to lie, threaten anybody that is not their mirror image, and indulge in weird and simplistic fantasies about the world, themselves, and their place in history, and expect that once the election is over the president-elect will morph into normality and be qualified to govern the most powerful nation in the world without having any relevant experience or talent. Trump's unstable, irrational, and impulsive behavior, and his immense contempt for all thoughts and thinking that haven't originated in his own head, is the product of ignorance and fear, and much like any conquering Barbarian, Goth, Visigoth, or Mongol of ancient history, who decimated entire European and Asian nations, or any of the European kings that plundered and conquered America and Africa, or any of the 20th century tyrants that ravaged Europe and warred against the USA, what he will do, or try to do, is the only thing that will make him feel safe, in other words, \"superior\": Slash and Burn believing that America will rise from its ashes much like the fabled  phoenix of Egypt, a behavior much like that of the infamous Rome-burning Nero. Long live the USA.", "userDisplayName": "Enrique Woll Battistini", "assetID": 3466295, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 74248532, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1380, "createDate": "1488602649", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21680776, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1383, "replyCount": 0, "userLocation": "Evanston", "commentSequence": 21680776, "commentBody": "How long will it take before the administration falls in on itself? Trump wants no one working for him who has 'said or written an unkind word' about him. Hence, many vital positions have not been filled. Tillerson wanted Elliot Abrams as his deputy- the decision by trump (not Bannon this time)- NO. How long before Tillerson quits out of frustration. The same for many others. Others are unqualified for their positions and, it seems, most have lied or omitted facts in their Senate committee hearings. Unraveling some of their finances could take 4 years.<br/><br/>We know he is unqualified as president- more so because he is unwilling to learn. His lack of knowledge is monumental and his advisers have their own agendas not necessarily complementary to the US Constitution. His thin skin has led him to declare war on Nordstrom, declare the media 'the enemy' and hold rallies to boost his morale. <br/><br/>Like the kid who claims 'the dog ate my homework,' trump is quick to blame those around him for blaring mistakes or faux pas'. His holds those who cross him in contempt. This may be fine for someone who runs a family business but as president of the US, it is pretty contemptible.", "userDisplayName": "Dorothy", "assetID": 3466295, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 47693082, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1382, "createDate": "1488605300", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21681012, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": 21673672, "rgt": 746, "replyCount": 0, "userLocation": "Sacramento, Ca", "commentSequence": 21681012, "commentBody": "Well said. Many of these folks are blinded by hate &amp; hysteria. Some even need their medicines adjusted (perhaps something for anger management!). The so-called mainstream media assumed they owned the narrative and the presumed result of our recent election.", "userDisplayName": "JKT, MD", "assetID": 3466295, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 62848911, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 745, "createDate": "1488608601", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21681385, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": 21671281, "rgt": 256, "replyCount": 0, "userLocation": "Albuquerque, NM", "commentSequence": 21681385, "commentBody": "I don't read it as American exceptionalism to be warned against countries which dominate \"their neighbors through force and fear, while creating closed economic empires.\"<br/><br/>All nations should oppose such developments, and advocating opposition is not exceptionalism but humanity.", "userDisplayName": "Bert Woodall", "assetID": 3466295, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 74574803, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 255, "createDate": "1488617929", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21681534, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1385, "replyCount": 0, "userLocation": "Virginia", "commentSequence": 21681534, "commentBody": "Don't forget the inimitable contempt for his own voters, indeed for anyone taking the time to listen to him. The unending lies, the airy-fairy promises of limitless grandeur, the grossly unformed policies, the utter dismissal of any need for planning or detail or even basic understanding of issues, the assumption of immediate, wild success in eradicating complex, entrenched problems merely on his say-so, the entire \"Only I can fix it\" attitude which casually dispenses with any appreciation for the efforts of anyone else, in any capacity, across the land. <br/><br/>Five minutes of this should have been enough for almost anyone to understand exactly what he was doing. Even allowing that a significant percentage of his voters gravitated to him because of their personal affinity for his racism and misogyny, that still leaves tens of millions of somewhat more good-hearted people who fell for this nonsense, and never once grasped how abominably he was insulting them, from start to finish. ", "userDisplayName": "JeanBee", "assetID": 3466295, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 56559585, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1384, "createDate": "1488621478", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21681897, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1387, "replyCount": 0, "userLocation": "Austin", "commentSequence": 21681897, "commentBody": "We have to stop watching this abomination take place in paralyzed horror.   Donald Trump is an existential threat to America, to world-wide stability, and to the future of our planet and our species.  Like the frog in the slowly heating water, some are becoming to accustomed to his instability, ignorance, incompetence, and moral vacuity.  Normalizing him is suicidal.  ", "userDisplayName": "slimjim", "assetID": 3466295, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 52033678, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1386, "createDate": "1488626625", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21681931, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": 21681491, "rgt": 1364, "replyCount": 0, "userLocation": "Greater Boston Area", "commentSequence": 21681931, "commentBody": "This simply means one thing: The US's governing system is proven to be obsolete and utterly dangerous. Many old rules and regulations, conceived centuries ago, are proving to be an  inadequate framework  to manage - evolvingly-  this new modern society of ours. Fix it and replace it or rot. ", "userDisplayName": "Carlos Santaella", "assetID": 3466295, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 28230713, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1363, "createDate": "1488627052", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21682263, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1389, "replyCount": 0, "userLocation": "Burlington, VT", "commentSequence": 21682263, "commentBody": "Of all the contemptuous things this president has done, failing to remove himself from his business interests, and stonewalling the american people on that, is the greatest.   Admittedly, when the president's name is foremost on the firm, disassociation is at best difficult.   But having his sons run it for him, is wholly inadequate.   <br/><br/>The question is....why is the FBI not investigating the firm, and exploring investment entanglements with foreign powers?   If there's nothing there to be concerned about, their investigation will set the national mind at ease.<br/><br/>On the other hand... we might be inclined to trot out the tar and feathers, and ride this con out of public housing on a rail!    <br/><br/>Corollary question... when is the GOP going to come to its senses?   At best their strategy right now is death by a thousand cuts to the president's grandiose spending plans.   His numbers don't add up...and hoping for 4% economic growth in a time when the entire economic world is slowing down, is another one of those bed time stories.<br/><br/>As Ronald Reagan famously said, \"there you go again\".   ", "userDisplayName": "jljarvis", "assetID": 3466295, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 31687987, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1388, "createDate": "1488629572", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21682506, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1391, "replyCount": 0, "userLocation": "Florida", "commentSequence": 21682506, "commentBody": "J. E. Lendon's book, \"Song of Wrath,\" elegantly and effectively explains how nationalists with a narrow focus on the relative status of individual states and their spheres of influence became trapped in the Peloponnesian War, devastating Greek civilization and leading to its conquest by \"barbarian\" Macedonia. Nationalists like Steve Bannon and Vladimir Putin, who seemingly want to emulate the \"Great Game\" of the 18th-19th centuries, need to study even earlier history to see where their short-sighted nationalism could take us.", "userDisplayName": "Wayne", "assetID": 3466295, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 20268115, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1390, "createDate": "1488631075", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21682571, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1393, "replyCount": 0, "userLocation": "NYC", "commentSequence": 21682571, "commentBody": "This is commentary to be preserved and reread frequently to avoid the danger of being lulled into acceptance and compliance to the policies and practices of a man and his administration who daily seemingly function without true regard for the Constitution, laws and values of the United States.", "userDisplayName": "vincentgaglione", "assetID": 3466295, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 52314243, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1392, "createDate": "1488631349", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21682900, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1395, "replyCount": 0, "userLocation": "Seattle", "commentSequence": 21682900, "commentBody": "Contempt is a two-way street. The more Trump tramples on the Constitution, the Bill of Rights, and civil and diplomatic norms -- not just the administrative state, but reality itself -- the more contempt most Americans will feel for him and the Republican members of Congress, who remain nearly unanimous in their complicity. Even in the face of the increasingly serious suspicions about his relationship with Russia, a country that has absolute contempt for ours.", "userDisplayName": "John Crutcher", "assetID": 3466295, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 65006541, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1394, "createDate": "1488633002", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21683124, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1397, "replyCount": 0, "userLocation": "MA", "commentSequence": 21683124, "commentBody": "Keep it up, Roger.  \"Contempt\" is indeed the key word defining Trump.  He expresses it in almost every physical gesture, in most of his words, and many of his actions.  I wish there were more humor there.  I can't remember any instance of a genuine laugh, certainly no self-deprecation or humility.  He's certainly \"no Ronald Reagan,\" to re-coin Lloyd Bentsen's memorable phrase.  I wish he could relax.  I wish he had some friends.  I wish he had more real self-confidence.  I wish he were more intellectually oriented.  I wish he spoke at least one foreign language.  I wish he had some curiosity.  Is there only contempt?  It does look that way.  And somehow we Americans have actually elected him as our president!  ", "userDisplayName": "C.L.S.", "assetID": 3466295, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 32675915, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1396, "createDate": "1488634083", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21683205, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1399, "replyCount": 0, "userLocation": "massachusetts", "commentSequence": 21683205, "commentBody": "There is a lot of truth in this article, but it stops short in its analysis <br/><br/>While historically it has been the US and other European countries reaching out and extending Western values, which for all their shortcomings have brought with them all the benefits of science and technology and principles of human rights that process is now being reversed.<br/><br/>Science and technology has given powerful tools to countries whose traditions and cultures have not caught up to the power vested with those tools.<br/><br/>The fact that we have over 10 million illegal immigrants living here, that our population is bulging and the worlds population exploding means that those external forces are now exerting a greater control over us then we are over them.     <br/><br/>If we were bad in the way we used our technological skills, we were benign in comparison to the harm being inflicted by the  combination of technology and runaway  ignorance.  Whether it be in Africa the machine gun killing of elephants for ivory, the S, China sea being turned into a mortuary for fisheries, the Amazon jungle into a pineapple plantation, N Korea into a battleship, Mexico into a breeding machine and all resulting in climate change <br/><br/>Humanity as a whole has become a dark, Satanic force  causing every living thing in every corner of the earth to cower with fear. <br/><br/>Perhaps tactically the first thing to do is draw the wagons into a circle as we prepare to deal with the oncoming tsunami.", "userDisplayName": "ben", "assetID": 3466295, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 48050462, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1398, "createDate": "1488634471", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21683286, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1401, "replyCount": 0, "userLocation": "California", "commentSequence": 21683286, "commentBody": "The word Contempt seems to be the most accurate description of this President's working philosophy or more precisely- those around him.<br/>A mere 40 or so days, and the destruction, elimination, cutting; gutting of numerous agencies whose purpose is to preserve, enhance, expand areas of protections to the environment (be it pollution controls, waterways, health), food safety, civil protections; areas that make Living more tolerable, safe and enjoyable; all decimated. The question always looming- Why?  The punitive nature of this administration is something akin to viewing America and its people as Donald Trump's personal enemy. Again- why?<br/>We have already discovered, this man has virtually zero capacity and awareness of details. I would doubt he even knows the expanse of the agencies he has targeted (correct description ); relying solely on others to frame and choose his dirty-deeds; again- why? Sadly, those who voted for this Destroyer, have no foresight into what all of this means; most will be dead long before the full effects of what is occurring has come to full fruition; this behavior transcends political philosophy.<br/>What is the Psyche of an individual  CONTENT  on destruction?<br/> This is an emotionally and spiritually Bankrupt individual- surrounded by those even more so.", "userDisplayName": "Donna", "assetID": 3466295, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 68499124, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1400, "createDate": "1488634795", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21683499, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1403, "replyCount": 0, "userLocation": "PA", "commentSequence": 21683499, "commentBody": "In a democracy, people get the government they deserve.The demise of empires is typically marked by apathy, debauchery, denial, nostalgia for the \"way things were\" and blame for any state perceived as undesirable.Trump was elected by millions of Americans with contempt for education, expertise, knowledge, thoughtfulness, diversity and tolerance.Such contempt leads to contempt for all ideas about social justice, climate change or nuanced diplomacy.An in turn, contempt for Judiciary and First Amendment but almost religious support for the Second.Sadly,Trump, rather than being the source of contempt, is a perfect fit for these times, the result, the amplifier of millions of American voices.", "userDisplayName": "observer", "assetID": 3466295, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 51783517, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1402, "createDate": "1488635654", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21683756, "editorsSelection": 0, "updateDate": "1488638836", "approveDate": "1488638836", "parentID": null, "rgt": 1405, "replyCount": 0, "userLocation": "Nebraska", "commentSequence": 21683756, "commentBody": "Contempt for the truth because the truth will bring Trump down. The tax returns would reveal the truth if the complicit, morally and ethically challenged Republicans vote to expose them. When the taxes are revealed, hopefully soon, the will provide the evidence needed and show how Russia blackmailed Trump. Trump business holdings in perpetual need of cash obtained loans from Russia. A Russia crippled by sanctions. Hence the meddling in our election. Trump is in a position to allow Russia free reign over Ukraine, weaken NATO in return for favorable loan terms. Then the contempt will be directed at the entire world.<br/>Where is the article on Republicans coverup of Sessions real reason for recusing himself?", "userDisplayName": "Jean", "assetID": 3466295, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 62324118, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1404, "createDate": "1488636605", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}], "api_timestamp": "1488826223"}, "debug": {"version": 3.1}, "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "status": "OK"}