{"results": {"totalCommentsFound": 8064, "totalCommentsReturned": 25, "comments": [{"commentID": 21684329, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": null, "rgt": 663, "replyCount": 0, "userLocation": "New Jersey", "commentSequence": 21684329, "commentBody": "If it weren't for James Comey and Putin we would at least have a competent woman in the White House dealing with this problem.  Instead we have Donald Trump and a Cabinet filled with people who are so desperate for their position that they are willing to associate with him.<br/>We are in trouble, and that may seem editorial to some people but it's news to the people witless enough to vote Trump into office. ", "userDisplayName": "Mars &amp; Minerva", "assetID": 3466332, "recommendationCount": 8, "status": "approved", "replies": [], "userID": 75927350, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 662, "createDate": "1488638797", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684358, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": null, "rgt": 665, "replyCount": 0, "userLocation": "san francisco", "commentSequence": 21684358, "commentBody": "Call me cynical, but I've realized that this is the sort of scenario that will trigger Trump's childish response, in which case an actual warhead will be fired at North Korea, and it will look like the beginning of the end. Only with the welfare of their own offspring in their thoughts and a good dose of sanity, will someone in Trump's administration (maybe Ivanka and Jared?) step up and demand that he be stopped--at any cost. Not without sending that first attack, and leading to God knows what repercussions. We can only pray it doesn't happen this way, but it's a scenario I've imagined will be the only way to stop him (Trump). ", "userDisplayName": "tartar", "assetID": 3466332, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 21568715, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 664, "createDate": "1488638906", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684380, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": null, "rgt": 667, "replyCount": 0, "userLocation": "Philadelphia", "commentSequence": 21684380, "commentBody": "Add to this unnerving story the fact that the U.S. nuclear program is now overseen by Rick Perry, a politician and former reality TV show contestant who didn't even realize that the nuclear arsenal would be under his purview as Secretary of Energy.  Who needs nuclear physicists anyways?", "userDisplayName": "Betsy", "assetID": 3466332, "recommendationCount": 19, "status": "approved", "replies": [], "userID": 40317993, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 666, "createDate": "1488638986", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684411, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": null, "rgt": 669, "replyCount": 0, "userLocation": "Portland, OR", "commentSequence": 21684411, "commentBody": "Obama intensified a series of cyber attacks to disrupt North Korea's nuclear program. They had mixed success and delayed it at best.<br/><br/>Not debating for now whether those attacks were wise- they probably weren't- this nation's President draws a red line....drum roll....on Twitter!!!!<br/><br/>Then the reports from the Administration  come out- everything is on the table. With the recent assassination of Kim Jong-un's half brother, it should even be glaringly clear that North Korea is dangerously unstable. These threats will create even more instability. Much more.<br/><br/>Now when the US looks at its unilateral options- they are all bad, and short of economic sanctions- have a high propensity to lead to war. <br/><br/>Nothing could be worse than a face off with North Korea. Diplomacy 101 teaches a sane leader to avoid face offs- and only use them if you must and have a preponderance of force on your side. And, in a nuclear world- all warfare is asymmetric. Sure we can destroy life 1000x times over. But North Korea can kill millions with its rockets and exact huge casualties through sabotage and infiltration. In case the last sentence was too dry- burning flesh in streets and homes- North Korean, South Korean and American.<br/><br/>Maybe a sane leadership-such as the one in China- could deflate tensions. But the President and his Administration has deeply offended them. That leaves no one else with enough influence in North Korea there to make a difference. Beware who you make enemies of.", "userDisplayName": "Lowell Greenberg", "assetID": 3466332, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 70865689, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 668, "createDate": "1488639082", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684423, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": 21683616, "rgt": 338, "replyCount": 0, "userLocation": "Louisiana", "commentSequence": 21684423, "commentBody": "Please. I am sure (and anyone who follows global politics would surmise) President Obama did everything within his power (and then some) to do all he could to defuse as much capability possible this lunatic man-child presiding over North Korea has. If anything was waylaid, it would have been politically motivated opposition in the House and Senate designed to disparage Obama's appearance.<br/><br/>Please; someone give me one reason why he would not? The fact he told the incoming Trump Administration this would likely be the most urgent problem he would confront.", "userDisplayName": "Easy Goer", "assetID": 3466332, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 13120442, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 337, "createDate": "1488639111", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684513, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": 21683482, "rgt": 184, "replyCount": 0, "userLocation": "<a href=\"mailto:Lsole@rogers.com\">Lsole@rogers.com</a>", "commentSequence": 21684513, "commentBody": "If the United States decides that we have the responsibility to liberate the North Koreans, then there is a long list of other countries that equally are starving and repressed by horrid dictators. On the issues of nukes and outlaw regimes that is a complex issue.<br/>NK is a crazy brother in a cage of the Chinese. Our military doesn't mean thing on the issue. The only deterrent is China. Knocking over NK would be easy, but only if China stood back and they say they won't.<br/>So, with our Exxon CEO as Secretary of State appointed at the behest of Russia it's not clear if he understands or even has the support of the State Department. The State Department, Department of Defence, CIA, can't be purged by this government because no one will work them with any credentials. Mattis likely needs to prove he has autonomy after the madness of Flynn.<br/>.", "userDisplayName": "Leslie sole", "assetID": 3466332, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 66850321, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 183, "createDate": "1488639474", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684518, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": null, "rgt": 671, "replyCount": 0, "userLocation": "New Jersey", "commentSequence": 21684518, "commentBody": "If the military had agreed to allow tanks and missile launchers to join the Trump inaugural parade, and thankfully they did not, then the North Koreans might have realized that they had finally met their explosive match and taken the bait. Right now we have to hope that cooler heads continue to prevail in Washington, and at this moment those are with the military and the intelligence communities. Pity that the buck stops at a President governed by the likes of Bannon and Miller. Sad.", "userDisplayName": "SLeslie", "assetID": 3466332, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 50393230, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 670, "createDate": "1488639487", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684541, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": null, "rgt": 673, "replyCount": 0, "userLocation": "New York", "commentSequence": 21684541, "commentBody": "While this article covers the unlikely success of a military strike against North Korea's nuclear arsenal, it leaves out one possible option, negotiation.<br/><br/>Despite what one thinks of the deal with Iran, it at least postponed if not deterred the addition of one more country to the family of nuclear armed nations. Negotiation does not preclude the other options that were discussed. But none of the deterrent efforts has thus far been successful and the article concludes that it's only a matter of time before Kim has an ICBM.<br/><br/>Despite the near xenophobic narrative that we're witnessing about Russia, here is an issue that both China and Russia are intently concerned with. Any potential nuclear conflict anywhere runs a very real risk of spreading. Can the US, China and Russia find common ground in some plan toward North Korea? With the Iran pact as a model there is at least a chance.<br/><br/>But where will the leadership for such an effort come from? Certainly not Congress. Who then will show up? Trump the deal maker or Trump the ill informed, unpredictable and unknown quantity in global affairs?", "userDisplayName": "drspock", "assetID": 3466332, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 68890766, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 672, "createDate": "1488639549", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684548, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": 21683395, "rgt": 232, "replyCount": 0, "userLocation": "Chicago", "commentSequence": 21684548, "commentBody": "@patalcant:<br/><br/>Wrong. Environmental degradation, AGW and the accelerating rate of species extinction -- all caused by us, our species -- passed crisis proportions long ago whether you choose to believe (and admit) it or not. Those put our national security problems via-a-vis puny, idiotic nuclear North Korea in the shade.<br/><br/>Of course, when (not if) Trump bungles this North Korea problem that failure will be keenly felt around the world and across the biosphere, too, magnifying its decline by accelerating its deterioration, diminishing any chance of repairing the damage or recovering what is rapidly being lost. Expect nothing from him except supreme folly indifferently cloaked by inanities and lies.<br/><br/>However, North Korea is a pertinent -- if not outstanding -- example of what's gone wrong -- with us especially. Our inability to see the forest for the trees, separate fact from fiction and identify what the real long-term threats to our survival are and where they lie is embodied by our obsession with North Korea. These failures are a logical consequence of a kind of myopia homo sapiens collectively suffer arising from individuals and groups competing for resources (wealth and social status) unbridled self-interest and terrible self-centeredness.", "userDisplayName": "Steve Singer", "assetID": 3466332, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 8562342, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 231, "createDate": "1488639569", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684602, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": 21683615, "rgt": 382, "replyCount": 0, "userLocation": "Houston", "commentSequence": 21684602, "commentBody": "\"The Chinese have no interest, however, in removing an effective buffer between their territory and the heavy U.S. troop presence in South Korea.\"<br/><br/>I beg to differ: there's no rational scenario under which China would want North Korea to develop nuclear weapon capabilities. Doing so would only reduce the country's dependence on China, which thus far has repeatedly proven to be the strongest countermeasure against North Korean aggressions. It's only a slight exaggeration to say that North Korea would have a virtually nonexistent GDP absent Chinese help.<br/><br/>I also seriously doubt the American troop presence in South Korea plays any realistic role in this regard. The U.S. has under 30,000 members of the Armed Forces stationed near the DMZ between North and South Korea. In contrast, North Korea has nearly TEN MILLION active and reserve troops, and its border with China is only a few hundred miles long -- a tiny fraction of its full 14,000-mile length. Further still, China has a population of nearly 1.5 billion, and if necessary could handily defeat North Korea on its own.<br/><br/>All that said, I completely agree that China can, and MUST, play a central role in any disarmament of North Korea -- and I believe it will, should the worst-case scenario occur and North Korea develops a functional ICBM. Even a single nuclear explosion - regardless of locale, assuming it's a populated one - would have unthinkable repercussions for the rest of the world, arguably MOST of all China.", "userDisplayName": "Jeff", "assetID": 3466332, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 71023891, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 381, "createDate": "1488639807", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684615, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": 21683959, "rgt": 442, "replyCount": 0, "userLocation": "Mondovi, WI", "commentSequence": 21684615, "commentBody": "Exactly, most of the info in this article is not new or surprising, but here is it all on display just in time for very unpopular budget, tax and healthcare legislation in the U.S. More deconstruction. Just a few short weeks ago we were breathlessly told about the defection of a high NK official predicting the imminent demise of NK's leadership. Let Pentagon and intelligence do their work, and the citizenry and 4th estate have more important issues to deal with in our backyards. ", "userDisplayName": "Rita", "assetID": 3466332, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 62681647, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 441, "createDate": "1488639843", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684623, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": null, "rgt": 675, "replyCount": 0, "userLocation": "Detroit", "commentSequence": 21684623, "commentBody": "It looks like the United States missed a good bet in 1991 - hiring out-of-work, Russian rocket scientists and redeploying them to solve global warming and mass transportation issues (or design a new and improved Vegematic). But then again, I've recently heard that immigration (combined with the twin danger of Islamic terrorism) is a much larger threat than thermonuclear annihilation. Harvard? Yale? Where did all the farsighted people with brains go?", "userDisplayName": "Ed Jones", "assetID": 3466332, "recommendationCount": 9, "status": "approved", "replies": [], "userID": 74076285, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 674, "createDate": "1488639859", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684678, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": null, "rgt": 677, "replyCount": 0, "userLocation": "Johnson City, Tenn.", "commentSequence": 21684678, "commentBody": "Chilling reporting of what is an ever burgeoning and apparently intractable nuclear existential threat projected by North Korea under the Kim Dynasty.<br/><br/>North Korea is a veritable basket case and a bastion of mass paranoia with many millions suffering starvation, horrific oppression, life long arbitrary incarceration, and wanton and capricious government executions. There are no viable internal or external checks on the absolute leadership. China the most proximate and credible counterbalance has chosen not to tamper with the internal status quo.   <br/><br/>Add on decades of failed American efforts to hold a lineage of maniacal dictators in check in their doggedly persistent and largely successful pursuit of nuclear ballistic missile strike capabilities.<br/><br/>The chance of one errant bellicose mistake on the part of Kim Jong-un is certainly not an acceptable gamble by any calculation, whether for South Korea, Japan and apparently soon the US mainland.<br/><br/>This is a situation in which the conventional calculus of MAD as credible deterrence becomes highly uncertain.<br/><br/>If there is a key to finding a non-destructive solution it must certainly lie in a radically different tact from the Chinese.", "userDisplayName": "G. Sears", "assetID": 3466332, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 64527736, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 676, "createDate": "1488640015", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684704, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": 21683395, "rgt": 234, "replyCount": 0, "userLocation": "nyc", "commentSequence": 21684704, "commentBody": "On the contrary, considering the outstanding questions that are festering for half the population as to the legitimacy of this president's election; as well as the degree to which the unknowns of his personal finances make him vulnerable or drive his decision-making; and, finally, the legitimate concerns many have over his mental health and stability, it is NOT the time to let fear cow us into normalizing this president. <br/><br/>Rather, that fear should heighten our sense of urgency and strengthen our resolve. We must demand resolution of all questions regarding interference with the election and continue pushing and protesting for release of his tax forms.<br/><br/>Finally, please keep front of mind the prospect of trump and KJ-u going at it. The inevitability of escalation. The myriad ways this could spin out of control. Please keep that in mind as trump alienates our allies and destabilizes our relationship with China. <br/><br/>Not my president. ", "userDisplayName": "zelda", "assetID": 3466332, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 46563601, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 233, "createDate": "1488640090", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684752, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": null, "rgt": 679, "replyCount": 0, "userLocation": "Philadelphia, PA", "commentSequence": 21684752, "commentBody": "Deterrence seems less fraught with the potential for mishap than trickery and one-upmanship. The problem nowadays is that the greatest risks come from the collusion of marginal states and non-state actors. Letting North Korea have its nuclear weapons seems less risky than pushing them into a scenario where, foiled at every turn from getting a deterrent capability of their own, they decide to turn to untraceable small nuclear devices driven into the country in the trunk of a car. ", "userDisplayName": "Eric S", "assetID": 3466332, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 12574292, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 678, "createDate": "1488640254", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684764, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": null, "rgt": 681, "replyCount": 0, "userLocation": "Reston, Va.", "commentSequence": 21684764, "commentBody": "I vividly recall the cold war tensions in the sixties and seventies between the US and Russian and the so called \"saber rattling\" threats at the time. Much fear and anxieties pervaded in both countries.  As a young father with three children at the time, living in Buffalo, N.Y., I'd envision a plan to escape just across the border to Canada on a moments notice if need be, to escape the cataclysmic event sure to follow.  At the time I had no apprehension's of then president's Kennedy or Johnson being in office, not that I always agreed with them, but did not view them as a threat to this democratic republic.<br/>Unfortunately the threat of a nuclear holocaust has stayed with us, somewhat under the radar, but there the same.  For the first time in my adult life I fear the man that sits in the White House acting as our president as a more serious threat.", "userDisplayName": "Bob 81", "assetID": 3466332, "recommendationCount": 20, "status": "approved", "replies": [], "userID": 67873376, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 680, "createDate": "1488640300", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684765, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": null, "rgt": 683, "replyCount": 0, "userLocation": "PNW", "commentSequence": 21684765, "commentBody": "When Clinton told Bush that terrorists wanted to attack the US one could almost assume that the new administration at that time wanted to purposefully ignore the problem. Remember the awards that Bush gave the Taliban over poppy farming?<br/><br/>I'm pretty sure that Trump thinks it's the protesters that's the no. 1 problem for the US, and journalists of course. Bush's mind worked the same way; it's not what threatens the country that's a threat to him, it's what threatens his image, his power that he see as important.<br/><br/>I expect I'll see Trump do a few things like hand waving and saber rattling, but given N. Korea's proximity to China I doubt he's gonna do much, plus there's no oil like in Iran so he's not going to be able to burnish his image with N. Korea.<br/><br/>In addition to the difficulties of dealing with authoritarian dynasties, Trump doesn't understand computers and that's why Stuxnet and similar attacks come back on us like Trump's friends in Russia.<br/><br/>The one real change has come from China when they stopped buying N. Korea's coal. Trump can't handle a threat like N. Korea so lets hope that China continues to engage with them and the problem doesn't cause the obliteration of South Korea. ", "userDisplayName": "lightscientist66", "assetID": 3466332, "recommendationCount": 13, "status": "approved", "replies": [], "userID": 68421875, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 682, "createDate": "1488640307", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684779, "editorsSelection": 0, "updateDate": "1488640957", "approveDate": "1488640957", "parentID": 21683390, "rgt": 274, "replyCount": 0, "userLocation": "NYC", "commentSequence": 21684779, "commentBody": "The U.S. has been trying to sabotage or circumvent the North Korean nuclear program for years - this is certainly known to Kim Jong-um so there is no reason not to discuss it.<br/><br/>But conservatives favor secrecy for the good reason that they have so much to hide - like Trump's tax returns, for example, or all their secretive conversations with Russians. ", "userDisplayName": "Jonathan Baker", "assetID": 3466332, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 59697229, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 273, "createDate": "1488640359", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21683717, "editorsSelection": 0, "updateDate": "1488640980", "approveDate": "1488640980", "parentID": null, "rgt": 2215, "replyCount": 0, "userLocation": "Marathon, Fl", "commentSequence": 21683717, "commentBody": "No no no, we have no ties to Russia, says the founder of the brother movement who finally admitted after 6 years he was lying.", "userDisplayName": "Margaret68", "assetID": 3466329, "recommendationCount": 8, "status": "approved", "replies": [], "userID": 70988636, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2214, "createDate": "1488636428", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684929, "editorsSelection": 0, "updateDate": "1488640991", "approveDate": "1488640991", "parentID": null, "rgt": 13, "replyCount": 2, "userLocation": "New York, NY", "commentSequence": 21684929, "commentBody": "“For Starters” has come to be one of my favorite “middle” puzzles.<br/><br/>[MAJOR SPOILER ALERT]<br/><br/>BOTTOM was such a gimme that I initially wondered if it could be wrong.<br/>TORERO was my other gimme.<br/><br/>I first thought that the third horizontal word would be SUPPLE, but that was quickly disproved because I already had GROTTO going downward.<br/>I got ORTEGA only from the crossings.", "userDisplayName": "Jerrold", "assetID": 3466334, "recommendationCount": 1, "status": "approved", "replies": {"comments": [{"commentID": 21686192, "commentSequence": 21686192, "editorsSelection": false, "updateDate": "1488647168", "depth": 1, "approveDate": "1488647168", "userURL": "NULL", "parentID": 21684929, "createDate": "1488647122", "parentUserDisplayName": "Jerrold", "recommendations": 0, "commentBody": "P.S. I am disappointed to learn of the decision that was made regarding the discontinuation.", "trusted": 1, "userDisplayName": "Jerrold", "status": "approved", "recommendedFlag": 0, "userID": 13110936, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "New York, NY"}, {"commentID": 21689180, "commentSequence": 21689180, "editorsSelection": false, "updateDate": "1488673089", "depth": 1, "approveDate": "1488673089", "userURL": "NULL", "parentID": 21684929, "createDate": "1488673069", "parentUserDisplayName": "Jerrold", "recommendations": 3, "commentBody": ".<br/>I respectfully dissent.<br/><br/>Deb still has to write 8 blogs a week, solve puzzles live on facebook, cajole celebrities to construct puzzles, code the puzzles for all the different platforms, monitor the Comments for sourpusses, etc. <br/><br/>As long as she still gets the medium-sized bucks, the decision is fine. In all frankness, the readership was advised that this was an experiment; yet I never noticed a spontaneous uprising demanding that the 9 a.m. post become a fixture on the site.<br/><br/>I had the National Park Service photograph the attendance at the pro-LVblog Rally and at the anti-LVblog Rally. Melissa McCarthy has declared that attendance at the anti-blog Rally was far larger than at the other one. It's unclear if the President forced the Service to then destroy the photographic evidence.<br/><br/>The people have spoken! So have Deb's bosses, I presume.", "trusted": 0, "userDisplayName": "MTF Tobin", "status": "approved", "recommendedFlag": 0, "userID": 26424636, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "Manhattanville"}]}, "userID": 13110936, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 8, "createDate": "1488640956", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/crosswords/a-little-variety-spelling-bee.html", "userURL": "NULL"}, {"commentID": 21684935, "editorsSelection": 0, "updateDate": "1488640991", "approveDate": "1488640991", "parentID": 21683549, "rgt": 68, "replyCount": 0, "userLocation": "Harrogate", "commentSequence": 21684935, "commentBody": "Of its a new record for youngest constructor.  ", "userDisplayName": "suejean", "assetID": 3466330, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 46920789, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 67, "createDate": "1488640965", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/crosswords/after-more-information-is-revealed-cotton-bowl-orange-cotillard.html", "userURL": "NULL"}, {"commentID": 21684928, "editorsSelection": 0, "updateDate": "1488640992", "approveDate": "1488640992", "parentID": null, "rgt": 1631, "replyCount": 0, "userLocation": "new mexico", "commentSequence": 21684928, "commentBody": "As an Obama supporter, I wasn't behind him 100%. I was aware that he had faults - some way worse than others. I take all information with that trusty grain of salt as most of my progressive friends do and make independent decisions/conclusions based on information received from the printed and taped, legitimate news organizations. Additionally there is much discussion among my friends. So! How is it that Trump's supporters cannot come to any other conclusion about him than that he's the golden boy? I am absolutely dumbstruck that his lickspittle supporters don't question a thing? How is it he's given a pass on all things Russia? No one can be right 100% of the time. <br/><br/>I want to see those tax returns.<br/><br/>I want a full investigation on the entire Trump team in regard to their Russia associations. I want it now.", "userDisplayName": "herlock", "assetID": 3466327, "recommendationCount": 91, "status": "approved", "replies": [], "userID": 40770084, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1630, "createDate": "1488640952", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21684904, "editorsSelection": 1, "updateDate": "1488641006", "approveDate": "1488641006", "parentID": null, "rgt": 1633, "replyCount": 0, "userLocation": "California", "commentSequence": 21684904, "commentBody": "Today is Saturday, I give him until Tuesday when he will tender his resignation to Trump. This way:<br/>He can bypass a hearing, an investigation and possible criminal perjury charges. The Trump administration can move on to their next bombshell (Tillerson and Russia?? Pence and emails??).<br/>By Tuesday the media will have run all variations of the Session story to death and can move on. And most importantly, Trump can get back to the business of Washington i.e. creating more Muslim and Mexican hate, yapping about his wall, picking a fight with another statesmen (Carl XVI Gustaf of Sweden???) and get in those most important rounds of golf in Florida.", "userDisplayName": "Gaucho54", "assetID": 3466327, "recommendationCount": 308, "status": "approved", "replies": [], "userID": 59237391, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1632, "createDate": "1488640860", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21683731, "editorsSelection": 0, "updateDate": "1488641015", "approveDate": "1488641015", "parentID": 21682301, "rgt": 1848, "replyCount": 0, "userLocation": "Albany, NY", "commentSequence": 21683731, "commentBody": "The Russians didn't have any deals with the Democrats and knew to stay clear of Clinton, as she was no friend to Putin.   ", "userDisplayName": "Grace Needed", "assetID": 3466329, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 32790096, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1847, "createDate": "1488636483", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684810, "editorsSelection": 0, "updateDate": "1488641033", "approveDate": "1488641033", "parentID": null, "rgt": 1635, "replyCount": 0, "userLocation": "Manhattan", "commentSequence": 21684810, "commentBody": "Gail, how can the American people hold a lying attorney general accountable when the party he is of is protectecting him and hiding the truth from us.<br/>The same party that had 9 Benghazi hearing one which lasted 11 hours.<br/><br/>The current president brags he doesn't pay his taxes because he is smart.<br/>Does that make the rest of us dumb?<br/><br/>What recourse do 'we the people' have now when a government that only 62 million citizens voted for, and when we do go to vote we have to deal with gerrymandered districts where our vote won't count or it is suppressed???<br/><br/>Help.", "userDisplayName": "Manderine", "assetID": 3466327, "recommendationCount": 82, "status": "approved", "replies": [], "userID": 28588861, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1634, "createDate": "1488640480", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}], "api_timestamp": "1488826228"}, "debug": {"version": 3.1}, "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "status": "OK"}