{"results": {"totalCommentsFound": 8064, "totalCommentsReturned": 25, "comments": [{"commentID": 21684336, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": null, "rgt": 1447, "replyCount": 0, "userLocation": "NYC", "commentSequence": 21684336, "commentBody": "So the killing-off of the government and its venerable institutions, is IMO, enough to impeach. <br/><br/>Trump is forsaking his role, chooses his ego over \"service\",and cares about nothing but applause, and the sycophant love of what truly amounts to a small base of quasi-republicans. Most of which are more beholden to the opinions - rather \"directives\"of Fox/faux News and various other conservative pundits. <br/><br/>He's blatantly ignored tradition and good politics (tax returns) flirts with a murderer head of state, is clearly completely unawares, or just plain stupid, about what his minions are doing, and has no respect for anything or one, and relies on his gut to tell him who is/isn't \"terrific, just tremendous.\"<br/><br/>In other words, he's flying by the seat of his pants. In a position not even he truly believed he would win. <br/><br/>Impeachment proceedings should be started very soon. ", "userDisplayName": "BoRegard", "assetID": 3466295, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 73746179, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1446, "createDate": "1488638836", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21684544, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": 21679399, "rgt": 1324, "replyCount": 0, "userLocation": "Peoria, IL", "commentSequence": 21684544, "commentBody": "Because there were solid grounds for suspecting other contacts; other problems. <br/><br/>Broaden your sourcing; read more widely; get out of the Conservative, rightwing Fake News bubble. <br/><br/>Whether such wiretapping was appropriate or not doesn't change the reality that Trump is hiding things and that there were Russian-Trump official contacts that were lied about!<br/><br/>By the way, you have the same outrage over Comey and Clinton?!  Nothing was found, but he continued the investigation and then interfered with the election illegally by announcing an ongoing investigation and impugning her integrity!<br/><br/>Had he not done so, she'd be president now and we'd be spared the incredible dangerous scandal of a president beholden to a foreign power!", "userDisplayName": "Paula Robinson", "assetID": 3466295, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 7628090, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1323, "createDate": "1488639556", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21684566, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": null, "rgt": 1449, "replyCount": 0, "userLocation": "Wisconsin", "commentSequence": 21684566, "commentBody": "Contempt is a state of mind that requires intent. I honestly do not think our President has the capacity to conjure up intent. He is like a pinball that just bounces off one bumper and on to the next.  The only exception was his address to Congress which he clearly had no role in drafting and whose main precepts he will spend the next 6 months repudiating, wiping that smile off the face of Paul Ryan in the process.  ", "userDisplayName": "highway", "assetID": 3466295, "recommendationCount": 7, "status": "approved", "replies": [], "userID": 17944584, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1448, "createDate": "1488639665", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21684579, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": null, "rgt": 1451, "replyCount": 0, "userLocation": "Texas", "commentSequence": 21684579, "commentBody": "It's so very sad that this country has to suffer from and through all the hatred that is coming from Trump and his ilk.  The people that revere him and believe in him are going to be the most disappointed when he crashes and burns.  He is a hateful and spiteful man, and he is easily manipulated by other haters.  He cares not for this country one iota.  He is a growing cancer that needs to be removed.  For the sake of the country, he needs to go as quickly as possible.  Our survival depends on it.", "userDisplayName": "Richard", "assetID": 3466295, "recommendationCount": 11, "status": "approved", "replies": [], "userID": 43507596, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1450, "createDate": "1488639701", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21684603, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": null, "rgt": 1453, "replyCount": 0, "userLocation": "Portland Oregon", "commentSequence": 21684603, "commentBody": "This morning I've read about the cyber attacks on North Korea and Trump's inability to develop an administration of our large government. Mr Cohen's article hits the mark more than anything I've read in months. We are in grave danger if we fail to understand what our democracy stands for. Populism is a threat to the United States in a way I had not truly appreciated. On the other hand how can a handful of honorable and courageous people defend our Constitution against an ignorant mob.", "userDisplayName": "Kathy M", "assetID": 3466295, "recommendationCount": 7, "status": "approved", "replies": [], "userID": 43802483, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1452, "createDate": "1488639809", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21684622, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": 21679472, "rgt": 1342, "replyCount": 0, "userLocation": "NYC", "commentSequence": 21684622, "commentBody": "Yet, he's not actually delivered any of the things you mention. How bad is your reading/listening comprehension?<br/><br/>Most of his EO's were formalities, and other then the court rejected Muslim ban - that also failed. <br/><br/>Its hilarious to keep hearing that, \"He's keeping his promises,\" when not a single brick or sheet of galvanized steel has (for the wall) has even been ordered. He's not created (lol) let alone actually brought back any good paying jobs, that must be dead-end jobs for the demographic he promised them to. Deportations, without a coherent and legally constructed plan is going no where. <br/><br/>But he has managed to anger most of the world, confuse the rest, and sowmore discord here in the US then even the worst of his predecessors. <br/><br/>And shaking his hand post-speech is meaningless in the full light of day. It was likely the \"advice\" given Repubs by McConnell and Ryan. \"Show support, be on camera, or else...\"<br/><br/>As to eating ca ca...not so much. This isnt a dictatorship, or a monarchy. A lot of good people (especially from his loose base) will end up in jail or maybe dead before that ever happens...", "userDisplayName": "BoRegard", "assetID": 3466295, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 73746179, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1341, "createDate": "1488639857", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21684628, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": null, "rgt": 1455, "replyCount": 0, "userLocation": "rva", "commentSequence": 21684628, "commentBody": "The word contempt implies that Trump has the capacity to understand America's place in the world, how we got here and why it should be preserved; that he rejects that vision of America and has other ideas about where we should be going. In other words, in order to be in contempt one must have the competence to understand the situation that one is contemptuous of. Mr. Trump does not. How could he? He doesn't read. He is a child in a man's body. He does not have the competence to have contempt. He is the dog who caught the car, and now has no earthly idea what to do with it. Hanlon's razor applies perfectly to Trump: Never attribute to malice that which is adequately explained by incompetence.", "userDisplayName": "gg", "assetID": 3466295, "recommendationCount": 7, "status": "approved", "replies": [], "userID": 54050045, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1454, "createDate": "1488639888", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21684761, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": 21683809, "rgt": 1408, "replyCount": 0, "userLocation": "Philadelphia, PA", "commentSequence": 21684761, "commentBody": "Following an administration, there were never so many books published by leaders in history and foreign policy, across the spectrum, denouncing its foreign policy. You could have covered a table at Barnes &amp; Noble with them. Dennis Ross’ “Statecraft” quotes leaders of the moderate Islamic nations – who we need to work with. They liked Clinton were able to work with the Clinton administration. They were not able to work with Bush/Cheney – a disaster for our foreign policy. Good luck for them working with Trump/Bannon going forward.<br/><br/>Bannon is to Trump like Cheney was to Bush, a misguiding, extremist, divisive, destructive influence.", "userDisplayName": "Harry Thorn", "assetID": 3466295, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 54543915, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1407, "createDate": "1488640282", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21684782, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": null, "rgt": 1457, "replyCount": 0, "userLocation": "Washington DC", "commentSequence": 21684782, "commentBody": "Thank you for your column, Mr. Cohen. I wish at one point in time you would address the contempt of millions of currently outraged Americans for the democratic process; in other words, the vote. Last November 8, 97 million people who could have voted did not vote. If those people would have voted, we would probably not be facing the problems we are confronting today. How many of those 97 million Americans are now furiously criticizing the current administration when they directly contributed to the results. This high level of abstention needs to be addressed. This is what Democrats should be focusing on: getting the people who did not vote to vote (and hopefully vote for them). The vote is where everything starts. If we did not vote, why are we complaining? ", "userDisplayName": "RoseMarieDC", "assetID": 3466295, "recommendationCount": 7, "status": "approved", "replies": [], "userID": 65631869, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1456, "createDate": "1488640369", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21684798, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": null, "rgt": 1459, "replyCount": 0, "userLocation": "Sao Paulo, Brazil", "commentSequence": 21684798, "commentBody": "This is so dangerous to have empty seats in such important cabinets. That is how democracy starts to crumble: when institutions don't do their job and fall apart. ", "userDisplayName": "Ricardo", "assetID": 3466295, "recommendationCount": 11, "status": "approved", "replies": [], "userID": 66758707, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1458, "createDate": "1488640437", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21684807, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": null, "rgt": 1461, "replyCount": 0, "userLocation": "Kansas", "commentSequence": 21684807, "commentBody": "To see a bizarre man with orange hair, a TV personality womanizer without knowledge of the constitution who rules with tweets and arrogant pronouncements, absurdly incompetent but a bully at heart who is incapable of saying, \"I don't know and need some help\" gain repeated standing ovations in his address to Congress has become a transformational and surreal moment. We are in the hands of a madman. What was for me and for all whom I have come to know as a land I love, we love, as Americans has been transformed into a nightmare no longer in the hands of those who respect and abide by the Constitution. We have become in the hands of this aberrant madman an autocracy immune to reality and contemptuous of liberty and justice for all. Whether we can mount an impeachment seems to fade as a wish amidst this nightmarish now galloping disaster headed over a cliff into the greatest tragedy in the history of civilization. 'Tis a wistful moment to sing God Bless America...we seem to now be damned to a fate more horrendous than the great flood...who will and can end this nightmare?", "userDisplayName": "Sid", "assetID": 3466295, "recommendationCount": 11, "status": "approved", "replies": [], "userID": 55344153, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1460, "createDate": "1488640468", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21684985, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": null, "rgt": 1463, "replyCount": 0, "userLocation": "Reno, NV", "commentSequence": 21684985, "commentBody": "\"president’s oath is to “preserve, protect and defend the Constitution of the United States.” It is to the law not the “volk.” \"<br/><br/>Congrats: a point largely lost upon those that think democracy is majority rule, and that their representatives have no responsibility for judgment, but need only be able to count. They hope only that they count votes, not dollars.", "userDisplayName": "John Brews", "assetID": 3466295, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 59220351, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1462, "createDate": "1488641157", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21685039, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": null, "rgt": 1465, "replyCount": 0, "userLocation": "New York City", "commentSequence": 21685039, "commentBody": "There are more shades to Trump's psychotic nature than hues in his atrocious hairdo. He's up, he's down. He acts \"normal for him\" for an hour before Congress, reading with great effort and discipline from a teleprompter he accused of President Obama using because it was a sign Barack was a \"bad president\" the \"worse\". Now that Trump managed to steal this election with the help from his Broke Back Mountain buds Comey and Putin President Obama and all others presidents of the past can be assured, none of them will ever even the criminal Tricky Dicky Nixon be labeled the worse president ever. Trump now has a lock on that title. <br/><br/>DD<br/>Manhattan", "userDisplayName": "Dennis D.", "assetID": 3466295, "recommendationCount": 8, "status": "approved", "replies": [], "userID": 22528152, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1464, "createDate": "1488641375", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21685213, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": 21678657, "rgt": 1254, "replyCount": 0, "userLocation": "Ky", "commentSequence": 21685213, "commentBody": "I agree these are serious problems that politicians have been unwilling or unable to address. Trump promised to address them and that's basically how he got so many votes. That, and Clinton failed to get her answer to domestic issues such as health care and college costs, and jobs, out there to rural areas. Out of the things listed, President Trump has worked on one, deporting illegal aliens. As a compassionate human being I cannot support the manner in which this is being done. Now today I read that they plan to sepatate mothers from their children as a policy. A policy! Is this the type of nation we have become? Shameful. There has to be a better way.", "userDisplayName": "Fabulous.rainbowunicorn", "assetID": 3466295, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 77756163, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1253, "createDate": "1488641990", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21685239, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": null, "rgt": 1467, "replyCount": 0, "userLocation": "Bethesda", "commentSequence": 21685239, "commentBody": "Well said, Mr. Cohen.  The president - through his contempt for one of the most fundamental of our nation's freedoms, those enshrined in the First Amendment of the Constitution; his failure to allow his cabinet secretaries (flawed as they are) to hire the necessary deputy and assistant secretaries; and his use of family members, rather than hiring staff with appropriate experience and expertise - is turning our country into a third world, banana republic.<br/><br/>Throughout the campaign Trump talked about making America great again, but his governing style (if it could be called that) is quickly making America a third rate nation and so far his enablers in Congress are allowing this to happen.<br/><br/>Throughout my life I have seldom agreed with Republicans about social or economic issues, but I never doubted their patriotism.  Now, with their failure to reign the administration in, along with their failure to investigate suspicious contacts with the Russians, I do doubt Republican patriotism.", "userDisplayName": "liceu93", "assetID": 3466295, "recommendationCount": 11, "status": "approved", "replies": [], "userID": 30653991, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1466, "createDate": "1488642088", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21685265, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": 21671281, "rgt": 258, "replyCount": 0, "userLocation": "New York, NY", "commentSequence": 21685265, "commentBody": "While much or your view is valid you can't overlook the fact that (until now?) people from all over the world wanted to emmigrate here, find a future for themselves and their families, and that the USA was in fact a true role model for all. My fear is that our greatness, which seemed always within reach, if not realized, is now going to elude us altogether under our new \"leadership.\"", "userDisplayName": "Olivia", "assetID": 3466295, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 48779637, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 257, "createDate": "1488642234", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21685345, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": null, "rgt": 1469, "replyCount": 0, "userLocation": "Cleveland", "commentSequence": 21685345, "commentBody": "Reading this significant column by Roger Cohen nearly 24 hours after it appeared, one is struck by several things. First is the fact that Donald Trump better worry about more than simply making immigration to the United States tougher. He should be terrified of what happens when those immigrants become American citizens.<br/><br/>New American citizens are like converts to a religion. They take their oaths very seriously and their duties to the governing precepts -- in this case, the Constitution. We native-born citizens are loyal to the principles upon which the nation exists, but we tend to get lazy.<br/><br/>Demagogues who are in love with authoritarianism and who worship at the altar of Mammon need people to be careless about protecting themselves. New American citizens take nothing for granted.<br/><br/>In the present crisis – that word is not an overstatement – either President Trump is such an historical ignoramus that he knows not what he does or he is monumentally corrupt.<br/><br/>An increasing number of us vote for the latter explanation.<br/><br/>What, then, is the corruption which causes our new leader to place the interests of Russia ahead of those of America? Maybe the spymaster, Vladimir Putin, has some evidence to compromise Mr. Trump. More likely, the motivation for the Trump subjugation involves billions of dollars – some already received and much more promised.<br/><br/>This is why we need a truly independent investigation. Most of us would be happy and relieved to have our suspicions proved wrong.", "userDisplayName": "sdw", "assetID": 3466295, "recommendationCount": 14, "status": "approved", "replies": [], "userID": 56679104, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1468, "createDate": "1488642618", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21685349, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": 21675214, "rgt": 918, "replyCount": 0, "userLocation": "Malone, NY", "commentSequence": 21685349, "commentBody": "Leroy, look up the meaning of instinct.  Though your teacher was a bit off, you are further off.  (Sexuality?  Spirituality?  Compassion?)<br/><br/>Extreme multiculturalism tends to even out after a generation or two.  We can help that process along by working with it; not by fighting off strangers.", "userDisplayName": "Rea Tarr", "assetID": 3466295, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 42543762, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 917, "createDate": "1488642643", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21685385, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": null, "rgt": 1471, "replyCount": 0, "userLocation": "Phoenix", "commentSequence": 21685385, "commentBody": "Roger, Trump is not an aberration, 63 million citizens (just like you and me) voted for him. I bet the majority of those 63 million would be hard pressed to know the difference between EU and NATO nations or for that matter any foreign policy matter. The problem is there is a severe issue with our economic situation in large segments of our country and that is driving people to make choices. In our mind these may be bad choices but to them it seems like the only choice. Free trade, the bastion of republican policies, is now looked upon with contempt.  The GOP is poised to make us isolationists! People have a very short memory.  Blaming others (illegals) for our problems is much easier.  My only hope is that we can get thru this period unscathed and intact as a leader of democracy and freedom. ", "userDisplayName": "Theni", "assetID": 3466295, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 1130586, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1470, "createDate": "1488642792", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21685433, "editorsSelection": 0, "updateDate": "1488643316", "approveDate": "1488643316", "parentID": 21679569, "rgt": 1412, "replyCount": 0, "userLocation": "Burlington, VT", "commentSequence": 21685433, "commentBody": "I think perhaps a mild dose of ritalin held him in check.  There was a distinct change in his affect, noticeable for much of the time.  ", "userDisplayName": "jljarvis", "assetID": 3466295, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 31687987, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1411, "createDate": "1488643046", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21684368, "editorsSelection": 0, "updateDate": "1488643323", "approveDate": "1488643323", "parentID": null, "rgt": 2299, "replyCount": 0, "userLocation": "Blaine, WA", "commentSequence": 21684368, "commentBody": "Trump could end all the questions about his Russian \"ruse\" if he would just release his tax returns. As one of his biographers pointed out about his business failures in the 1990s, \"he owed a lot of money and then suddenly he didn't.\" Who bailed him out? If it was the Russians we need to know. If it wasn't he may be in the clear. Then he can get on with the business of governing and wasting the taxpayers' money with weekend trips to Florida.", "userDisplayName": "Christy", "assetID": 3466329, "recommendationCount": 10, "status": "approved", "replies": [], "userID": 9644622, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2298, "createDate": "1488638935", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21685482, "editorsSelection": 0, "updateDate": "1488643329", "approveDate": "1488643329", "parentID": null, "rgt": 1777, "replyCount": 0, "userLocation": "Rochester", "commentSequence": 21685482, "commentBody": "Governor, if you are really concerned about protests, try listening instead of cracking down (which is the first instinct of Republicans).  \"Standing strong\" to attack health care or collective bargaining is an attack on freedom that will backfire against your party.   The more you put off the day of reckoning by gerrymandering, voter suppression and putting obstacles of dubious legality in the way of peaceful assembling, the greater will be the people's wrath when your policies start to bite ", "userDisplayName": "mancuroc", "assetID": 3466322, "recommendationCount": 34, "status": "approved", "replies": [], "userID": 12582762, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1776, "createDate": "1488643275", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21684378, "editorsSelection": 0, "updateDate": "1488643370", "approveDate": "1488643370", "parentID": 21682525, "rgt": 1926, "replyCount": 0, "userLocation": "NYS", "commentSequence": 21684378, "commentBody": "\"Bill Clinton bumps into the then Attorney General at an airport. Sessions and the Republicans melted down: call in a special prosecutor!\" <br/><br/>I think many would dispute the \"bumps\" into part.   In that Lynch was investigating Clinton's wife, both should not have met with the other privately.  That seems clear it me.<br/><br/>In the case of the Sessions meeting, one was arranged by the Obama White House where foreign ambassadors went to the RCN convention.<br/><br/>What very much concerns me is that it appears there may be a false narrative fabricated to damage the Trump administration, and that Federal spying resources and criminal leaking could have been used politically to support that narrative. Hopefully no wrong doing occurred in investigating the Trump campaign.<br/><br/>If I understand correctly, unless there was a special warrant, it would be unlawful to identify the content related Flynn, a U. S. citizen.  If general wiretapping was done on the Trump administration, wouldn't that be a crime unless there was a Forth Amendment compliant warrant based on probably cause, and an oath of affirmation, specifically identifying the scope of the surveillance.  The Forth should clearly prevent spying on the next administration for politically purposes.. <br/><br/>I hope the Obama administration did not illegally spy on the incoming Trump administration.  Should that have occurred, I hope any violation of the law will be addressed by the judicial system to the fullest extent the law allows.", "userDisplayName": "John", "assetID": 3466329, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 65035652, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1925, "createDate": "1488638971", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684384, "editorsSelection": 0, "updateDate": "1488643375", "approveDate": "1488643375", "parentID": null, "rgt": 2301, "replyCount": 0, "userLocation": "Roslyn, New York", "commentSequence": 21684384, "commentBody": "Of course, no one on team Trump is going to say \"We spoke about the hacking of the DNC\".<br/>So it is up to the investigators to connect the dots - meeting took place and then hacked documents were released. They also have to follow money connections.<br/>For example: The Billy Bush tapes were released then an hour or two later Wikileaks starts the drip. Coincidence? ", "userDisplayName": "Elizabeth", "assetID": 3466329, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 75756905, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2300, "createDate": "1488638992", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684385, "editorsSelection": 0, "updateDate": "1488643384", "approveDate": "1488643384", "parentID": null, "rgt": 2303, "replyCount": 0, "userLocation": "Arlington, VA", "commentSequence": 21684385, "commentBody": "Maybe, just maybe, Putin has copies of our president's tax returns which show that he owes Russian state banks tons of money after banks in the US didn't want to do business with him anymore due to his frequent bankruptcies?<br/><br/>Heck, there are so many conspiracy theories by Trump flying around, e.g. Obama having tapped the phone lines in his gaudy tower, why not add another one that might possibly be the reason why he become such an sycophant of the Russian bear?", "userDisplayName": "Sarah", "assetID": 3466329, "recommendationCount": 8, "status": "approved", "replies": [], "userID": 53959348, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2302, "createDate": "1488638994", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}], "api_timestamp": "1488826234"}, "debug": {"version": 3.1}, "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "status": "OK"}