{"results": {"totalCommentsFound": 8064, "totalCommentsReturned": 25, "comments": [{"commentID": 21685749, "editorsSelection": 0, "updateDate": "1488644827", "approveDate": "1488644827", "parentID": 21685054, "rgt": 864, "replyCount": 0, "userLocation": "<br/>", "commentSequence": 21685749, "commentBody": "\"I agree with what Mother Theresa taught us by example.\"<br/><br/>From what I've read, Mother Theresa made a virtue of living in poverty, not helping people to get out of it, and her facilities were more primitive than they needed to be.  She added suffering to suffering that was already unspeakable.", "userDisplayName": "Lifelong Reader", "assetID": 3466331, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 17055899, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 863, "createDate": "1488644724", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21685750, "editorsSelection": 0, "updateDate": "1488644827", "approveDate": "1488644827", "parentID": null, "rgt": 1069, "replyCount": 0, "userLocation": "Edmonton, Alberta", "commentSequence": 21685750, "commentBody": "I love this article. No longer will I feel slightly embarrassed when I  give money to panhandlers. This does not seem like an easy way to make money and sometimes a smoke or a drink  can make a day great!.  <br/><br/>This does not mean we can't also give  generously to nonprofits!", "userDisplayName": "Lois Field", "assetID": 3466331, "recommendationCount": 35, "status": "approved", "replies": [], "userID": 62578720, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1068, "createDate": "1488644727", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21685751, "editorsSelection": 0, "updateDate": "1488644827", "approveDate": "1488644827", "parentID": 21681935, "rgt": 982, "replyCount": 0, "userLocation": "New England", "commentSequence": 21685751, "commentBody": "Pope Francis has worked to return the Catholic Church to its roots, but it has had almost two millennia in which to entrench its own concepts of entitlement, arrogance, and hypocrisy.<br/><br/>I have not doubt that Francis would desire a more rapid return to the tenets of their religion, but he is facing a bureaucracy that has far more to lose than most would care to imagine.", "userDisplayName": "The Owl", "assetID": 3466331, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 57702801, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 981, "createDate": "1488644730", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21685767, "editorsSelection": 0, "updateDate": "1488644830", "approveDate": "1488644830", "parentID": null, "rgt": 853, "replyCount": 0, "userLocation": "Virginia", "commentSequence": 21685767, "commentBody": "Over the last fifteen years, after George W. Bush infamously labeled 3 countries as constituting an \"axis of evil\" in a January 2002 speech, the North Korean and Iranian regimes have taken what can only be called logical steps to ensure that they don't end up suffering the fate of Saddam Hussein in Iraq. <br/><br/>Unfortunately, the USA has never entirely repudiated the megalomaniacal chickenhawkery nonsense of the Bush 43 years, and that's a big reason for the continuing problems America has with Tehran and Pyongyang. <br/><br/>George W. Bush, apparently trying to resurrect his reputation by appearing on Jimmy Kimmel and other silly programs where he'll get softball questions, should never, ever be forgiven for how poorly he treated Kim Dae Jung--president of South Korea from 1998 to 2003, a Nobel Peace Prize winner, former dissident who came within an inch of being executed by South Korea's previous authoritarian government in 1980, one thousand times the man Bush 43 is or ever will be, and a person who met with Kim Jong Il in 2000 in an attempt to bring about some sort of North-South rapprochement that was vehemently opposed by Bush and his team after they took office in 2001. <br/><br/>Remember, North Korea's government is no more radical and \"crazy\" today than China's was 50 years ago in 1967, at the height of that country's Cultural Revolution madness under Mao Zedong. Countries can and do change. ", "userDisplayName": "AR", "assetID": 3466332, "recommendationCount": 25, "status": "approved", "replies": [], "userID": 10369639, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 852, "createDate": "1488644811", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21684903, "editorsSelection": 0, "updateDate": "1488644868", "approveDate": "1488644868", "parentID": 21682574, "rgt": 1940, "replyCount": 0, "userLocation": "Dayton Ohio", "commentSequence": 21684903, "commentBody": "Avshimmy,<br/><br/>It is not at all hard to appreciate that the Trump team wants to reset the relationship between the USA and Russia, and I believe that most Americans, myself included, applaud this effort and sincerely pray for its success.<br/><br/>The problem is that there are disturbing details that get in the way of accepting this at face value:<br/>1. The Democratic party server was hacked, with indications that the Russians were responsible.  This information was published on WikiLeaks.  We are supposed to believe that the Republican party was somehow immune to hacking?<br/>2.   Everyone in the Trump administration denies having any contact with the Russians.  These denials then prove to be false.  Is this lying or selective memory?  If the contacts are on the up and up, stand up and state \"yes, of course we had contact with the Russians, how else can we expect to reset our relationship ?\"  Don't you get concerned when someone lies to you?  Ever wonder why?<br/>3. You are correct that the Obama administration did attempt to improve relationships with Russia and Iran. The big difference is that they never lied about it.  ", "userDisplayName": "Erik Nelson", "assetID": 3466329, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 68022381, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1939, "createDate": "1488640860", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684909, "editorsSelection": 0, "updateDate": "1488644909", "approveDate": "1488644909", "parentID": null, "rgt": 2359, "replyCount": 0, "userLocation": "holbrook", "commentSequence": 21684909, "commentBody": "As weak as Obama appeared when many of us felt he should be strong, as much as many of us felt he and the democratic legislators should have fought back relentlessly against the vocalized pronouncements by McConnell and the Republican horde of lemming like followers of NOT working with the new president and trying to \"make him a one term president\", most of us NEVER once felt that under Barack Obama's leadership the government of the United States was not fully functioning and the people's business was not being cared for.<br/>It was difficult when the other side absolutely refused to do their part of working to do the people's business in a cooperative manner  and yet the Obama Administration did function fairly well but NOT as well as it should have because of the negativism and \"strike mentality\" of the other side.<br/>However , when compared to the hideous malfunctioning of the Trump administration in it first 100 days, the immense movement of people in and out of his top cabinet and staff positions, his inclusivity of civilians in his inner circle possibly without proper vetting, his exclusivity of proper intelligent and military chiefs from his inner circle and his apparent lack of understanding how the government works and his continued campaigning while leaving his very weak staff to run this country the Obama administration was superb.<br/><br/>As flawed as it may have been, we felt more secure, more sure and more comfortable than we do with this bunch of amateurs in control!", "userDisplayName": "usually", "assetID": 3466329, "recommendationCount": 15, "status": "approved", "replies": [], "userID": 70794933, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2358, "createDate": "1488640875", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684911, "editorsSelection": 0, "updateDate": "1488644923", "approveDate": "1488644923", "parentID": null, "rgt": 2361, "replyCount": 0, "userLocation": "usa", "commentSequence": 21684911, "commentBody": "David Frum of the Bush administration has said that to get to the facts a special or select committee has broader powers than a special prosecutor.  A select committee has subpoena powers and is not limited to investigating only things that were done that are/were illegal.<br/>According to Frum a special prosecutor would have to turn away from following any leads where no law was broken.  <br/><br/>American's need to know the entire scope of Trump and his campaign's dealing with the Russians.  And that would include knowing why the Russian \"King of Fertilizer\" kept showing up at cities along the campaign trail in his private jet when Trump's private jet was sitting on the tarmac as well.  (Remember all the hoopla surrounding the Bill Clinton/Loretta Lynch two-jet meeting?)<br/><br/>FYI the King of Fertilizer was the Russian oligarch who paid Trump $100 million for a property Trump had purchased for only $40 million.  During a time Trump was in great need of $.  And Trump has stated he \"never met the man\".  How odd to not meet or shake the hand of a man who just fattened your wallet by $60 million.", "userDisplayName": "medianone", "assetID": 3466329, "recommendationCount": 21, "status": "approved", "replies": [], "userID": 71502644, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2360, "createDate": "1488640887", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684921, "editorsSelection": 0, "updateDate": "1488644942", "approveDate": "1488644942", "parentID": 21679486, "rgt": 200, "replyCount": 0, "userLocation": "Cental Florida", "commentSequence": 21684921, "commentBody": "In know of no one who has any issue with the Russian people.  It's not about the Russians. It's Putin and his cronies and their possibly interference in our government that is the problem.", "userDisplayName": "WT Roan", "assetID": 3466329, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 67545178, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 199, "createDate": "1488640927", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21685798, "editorsSelection": 0, "updateDate": "1488645008", "approveDate": "1488645008", "parentID": null, "rgt": 1501, "replyCount": 0, "userLocation": "Seattle", "commentSequence": 21685798, "commentBody": "The Con Don looks in the mirror every chance he gets, sees what is there and tries to project his hateful, small-minded, narcissistic traits on someone else.<br/><br/>Yes, Donny, go ahead and attack President Obama.  Dig your grave a little deeper. ", "userDisplayName": "njglea", "assetID": 3466295, "recommendationCount": 11, "status": "approved", "replies": [], "userID": 60025659, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1500, "createDate": "1488644998", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/trumps-many-shades-of-contempt.html", "userURL": "NULL"}, {"commentID": 21684946, "editorsSelection": 0, "updateDate": "1488645020", "approveDate": "1488645020", "parentID": null, "rgt": 2363, "replyCount": 0, "userLocation": "oakland", "commentSequence": 21684946, "commentBody": "The real issue with all of the evidence of the connections between Trump and the Russians is the strong suspicion of a quid pro quo arrangement between them based on personal benefit to Trump in exchange for removing US sanctions against Russia.  Information of Trump's financial and possible other ties to Russia is being obscured and hidden, while Trump praises Putin and hints that financial sanctions very problematic for Putin and his oligarchs may be withdrawn, with no evidence of any benefit to the US.  Trump appoints Tillerson, who negotiated a mega oil deal with Russia, which is now on hold.  The lies and failure to disclose Trump's taxes fuel the flame.  And the only telephone call between Trump and various heads of state that was not recorded was his call with Putin.  Why?  Too much lying, too many cover-ups.  There is a building body of evidence that Trump owed Russia a lot of money, and that he promised, if they helped him get elected and helped his financial empire, that he would remove the US sanctions against them.  There is almost certainly a core of corruption underneath all of these contacts.", "userDisplayName": "will", "assetID": 3466329, "recommendationCount": 14, "status": "approved", "replies": [], "userID": 78398865, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2362, "createDate": "1488641019", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684955, "editorsSelection": 0, "updateDate": "1488645057", "approveDate": "1488645057", "parentID": null, "rgt": 2365, "replyCount": 0, "userLocation": "Altair IV", "commentSequence": 21684955, "commentBody": "Nothing used to rile devoted Barack Obama critics like the president’s winter Hawaiian vacation. A watchdog group once calculated that the Aloha state trips cost taxpayers $3.5m a pop – in airfare, security arrangements, communications and medical staff.<br/><br/>Among the harshest critics of Obama’s travel was Donald Trump, then a private citizen. <br/><br/>The joke, it turns out, is on Trump. Now he is the president – and it appears that he is on track to spend many more millions of taxpayer dollars on trips that might be construed as vacations for him and his family than Obama ever dreamed of. The arc of the moral universe is long, but it bends toward... Mar-a-Lago?<br/><br/>By one sketchy estimate, Trump and his family, in their security and travel demands, have already rung up as much in accounts payable by taxpayers as the Obama and Biden families did in eight years, a figure elsewhere calculated, by the Washington DC-based Judicial Watch, as topping $97m.<br/><br/>How is it possible? The complicated receipt involves weekend trips by Trump to Mar-a-Lago, his resort in Palm Beach, Florida; travel by his children and their government security details on Trump family business; and costs associated with protecting Trump’s Manhattan home, the high-rise Trump Tower building, where Trump’s wife and youngest child live but where the real estate mogul himself has not set foot since becoming president.", "userDisplayName": "The Last of the Krell", "assetID": 3466329, "recommendationCount": 28, "status": "approved", "replies": [], "userID": 53909157, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2364, "createDate": "1488641046", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684957, "editorsSelection": 0, "updateDate": "1488645069", "approveDate": "1488645069", "parentID": 21682547, "rgt": 1930, "replyCount": 0, "userLocation": "New York, NY", "commentSequence": 21684957, "commentBody": "If the Republicans don't get out of their own way and do the right thing (investigate), they run the risk of doing their own party irreparable damage. If this circus of an administration (and members of Congress, and just about everyone else apparently) is found to have colluded with Russia to fix the election, having let the crisis slowly percolate and draw focus for a year or more, the blowback from the American people will be a firestorm.<br/><br/>My hope is that the people who voted for Trump will actually disapprove of such scurrilous behavior, even if their senators and congressmen are willing to put their narrow personal interests above national security. ", "userDisplayName": "kicksotic", "assetID": 3466329, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 32896840, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1929, "createDate": "1488641049", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684990, "editorsSelection": 0, "updateDate": "1488645195", "approveDate": "1488645195", "parentID": null, "rgt": 2367, "replyCount": 0, "userLocation": "Texas", "commentSequence": 21684990, "commentBody": "As horrible and as unqualified as Trump is, the nefarious and evil puppet master Bannon is far worse.  He and his little, small minded yes man and toady, Mr. Miller, need to be removed and put away as soon as possible.  The power before the throne is true evil.", "userDisplayName": "Richard", "assetID": 3466329, "recommendationCount": 24, "status": "approved", "replies": [], "userID": 43507596, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2366, "createDate": "1488641190", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684998, "editorsSelection": 0, "updateDate": "1488645209", "approveDate": "1488645209", "parentID": null, "rgt": 2369, "replyCount": 0, "userLocation": "California", "commentSequence": 21684998, "commentBody": "Well then,<br/>Nothing to hide.  I assume that the administration will support a bipartisan independent commission to fully investigate the entire Russian Hacking Operation.", "userDisplayName": "Sheryl", "assetID": 3466329, "recommendationCount": 12, "status": "approved", "replies": [], "userID": 76091291, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2368, "createDate": "1488641222", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21685005, "editorsSelection": 0, "updateDate": "1488645217", "approveDate": "1488645217", "parentID": 21683657, "rgt": 2206, "replyCount": 0, "userLocation": "New York, NY", "commentSequence": 21685005, "commentBody": "Charles, you propose a simple and ethical solution for Trump &amp; Co.  It's an ironic suggestion given the conniving and deceitful 'deal makers' that have been at this game for a long, long time.", "userDisplayName": "F. McB", "assetID": 3466329, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 28654637, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 2205, "createDate": "1488641251", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21685027, "editorsSelection": 0, "updateDate": "1488645237", "approveDate": "1488645237", "parentID": null, "rgt": 2371, "replyCount": 0, "userLocation": "NYC", "commentSequence": 21685027, "commentBody": "Hey, hey. One thing at a time. How can Trump deny that anyone on his team had contact with the Russians when Jared Kushner met with Kislyak right under his nose at Trump Tower? If nothing was amiss, why was Kisylak shown up the back way? Remember please, all the cameras that were stationed in the lobby then. But not one captured that little courtesy call. And why was Kushner meeting with anyone at all at that point? Maybe there were more than two people in that meeting. I smell a smokescreen.", "userDisplayName": "llnyc", "assetID": 3466329, "recommendationCount": 19, "status": "approved", "replies": [], "userID": 70214401, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2370, "createDate": "1488641322", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21685031, "editorsSelection": 0, "updateDate": "1488645247", "approveDate": "1488645247", "parentID": null, "rgt": 2373, "replyCount": 0, "userLocation": "Connecticut", "commentSequence": 21685031, "commentBody": "It took less than two months to move from \"making America great again\" to \"putting America in extreme danger\" through ineptitude and deceit. <br/><br/>After the Republican Congress is defeated in 2018, and Trump is exiled (or imprisoned) in 2020, it is going to take the next Democratic president his or her first term -- four years -- to undo the damage Donald Trump and his administration have done in just eight weeks. <br/><br/>I'm the grandson of a U.S. Army general and a West Point graduate. My father served in occupation forces in Germany after WWII. My uncle served in the Air Force and then the CIA during the Cold War. And right now I am almost ashamed to be an American, heartened only by the constant anti-Trump rallies and the enormously important job that the American press corps is doing in its daily reporting. ", "userDisplayName": "LBC", "assetID": 3466329, "recommendationCount": 39, "status": "approved", "replies": [], "userID": 60614830, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2372, "createDate": "1488641335", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21685840, "editorsSelection": 0, "updateDate": "1488645249", "approveDate": "1488645249", "parentID": null, "rgt": 1719, "replyCount": 0, "userLocation": "Formerly From Nyc", "commentSequence": 21685840, "commentBody": "As a librarian, I was startled to see that this writer is not only the children's author of \"Duck, Rabbit\" but also \"The Encyclopedia of an Ordinary Life,\" at least part of which I read years before.<br/><br/>When my grandmother died over a decade ago, I told my partner that we had to go on our trip to Canada.  We couldn't wait any longer.  We've since been fortunate enough to travel through a good portion of Europe over the last few years.  If one has the time and means to do it, travel now.  Retirement and good health in old age is not promised to all.<br/><br/>Three weeks ago I had a bad accident which, if I'm lucky, will only cost my two front teeth.  I could have died.  So I have learned to be thankful for what I have and to live for the moment.  In fact, an interest in how and where I would be buried (this was before my accident) led me back to my childhood religion and am attending services regularly now.<br/><br/>One never knows when it will end, so it is good that Amy Krouse Rosenthal left not only a written record of her accomplishments but also a love prose poem to her husband.", "userDisplayName": "Debra", "assetID": 3466311, "recommendationCount": 13, "status": "approved", "replies": [], "userID": 32140220, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1718, "createDate": "1488645183", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/style/modern-love-you-may-want-to-marry-my-husband.html", "userURL": "NULL"}, {"commentID": 21685040, "editorsSelection": 0, "updateDate": "1488645254", "approveDate": "1488645254", "parentID": 21683646, "rgt": 2198, "replyCount": 0, "userLocation": "Philadelphia", "commentSequence": 21685040, "commentBody": "Let's start with perjury by Sessions and go from there.", "userDisplayName": "Bill", "assetID": 3466329, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 46908890, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 2197, "createDate": "1488641377", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21685042, "editorsSelection": 0, "updateDate": "1488645262", "approveDate": "1488645262", "parentID": 21683304, "rgt": 2144, "replyCount": 0, "userLocation": "New Mexico", "commentSequence": 21685042, "commentBody": "Well, we now know that the GOP will protect a habitual liar and sacrifice the integrity of the United States over money, power and racism.   ", "userDisplayName": "Edgar", "assetID": 3466329, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 65840548, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 2143, "createDate": "1488641381", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21685059, "editorsSelection": 0, "updateDate": "1488645284", "approveDate": "1488645284", "parentID": null, "rgt": 2375, "replyCount": 0, "userLocation": "New Britain, CT", "commentSequence": 21685059, "commentBody": "Where do we start?<br/><br/>The Russian ambassador invited to Trump Tower prior to the election?<br/><br/>A Russian businessman's plane arriving the same time as Trump's during multiple campaign stops?<br/><br/>More campaign staffers meeting Russian officials at various times up to the election?<br/><br/>Still hasn't disclosed his tax records!<br/><br/>Refuses to fill government positions but encourages destroying it.", "userDisplayName": "Larry Buchas", "assetID": 3466329, "recommendationCount": 22, "status": "approved", "replies": [], "userID": 40452278, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2374, "createDate": "1488641451", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21685075, "editorsSelection": 0, "updateDate": "1488645295", "approveDate": "1488645295", "parentID": 21682456, "rgt": 1890, "replyCount": 0, "userLocation": "East Texas", "commentSequence": 21685075, "commentBody": "The substance is in the fact that Trump insists none of his people had any contact with Russians. If this was all so routine why lie about it? You don't want to see that because of what it means about Trump.", "userDisplayName": "Max Deitenbeck", "assetID": 3466329, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 66825597, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1889, "createDate": "1488641493", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21685090, "editorsSelection": 0, "updateDate": "1488645332", "approveDate": "1488645332", "parentID": null, "rgt": 2377, "replyCount": 0, "userLocation": "nyc", "commentSequence": 21685090, "commentBody": "when you distill the facts of the article, you have to ask<br/><br/>\"where's the beef?\" as was once famously proclaimed.<br/><br/>so, until something more interesting is unearthed, I have to agree <br/><br/>The president’s supporters say innocuous encounters, routine for any incoming presidential team, are being treated for political reasons as somehow subversive<br/><br/>or, as the former US ambassador to Moscow said “we’re beginning to out-Russian the Russians”", "userDisplayName": "TimNYC", "assetID": 3466329, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 26699718, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2376, "createDate": "1488641543", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21685095, "editorsSelection": 0, "updateDate": "1488645366", "approveDate": "1488645366", "parentID": null, "rgt": 2379, "replyCount": 0, "userLocation": "Cincinnati", "commentSequence": 21685095, "commentBody": "Trump has brought this on himself.  Perhaps there is nothing \"dramatically\" ugly with what has been discussed in these various meetings but the continuous denials of any connection to Russia only to have more and more surface almost daily as in the the \"drip - drip\" adds to what can only be viewed now as a very suspicious situation.  <br/><br/>I'm old enough to remember Nixon, and this brings flashbacks to that time.  Trump may attack the press but Washington &amp; national politics is a whole new level and Trump &amp; cronies are quickly digging a deeper hole whether \"merited\" or not.", "userDisplayName": "Jimi", "assetID": 3466329, "recommendationCount": 11, "status": "approved", "replies": [], "userID": 58440454, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2378, "createDate": "1488641564", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21685872, "editorsSelection": 0, "updateDate": "1488645367", "approveDate": "1488645367", "parentID": 21685748, "rgt": 1876, "replyCount": 0, "userLocation": "Seattle", "commentSequence": 21685872, "commentBody": "It worked in Russia after the fall of the Soviet Union.  That's how Putin's mafia got control.  That is how the Robber Barons plan to get control of America.  UNLESS WE STOP THEM.", "userDisplayName": "njglea", "assetID": 3466322, "recommendationCount": 22, "status": "approved", "replies": [], "userID": 60025659, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1875, "createDate": "1488645321", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}], "api_timestamp": "1488826238"}, "debug": {"version": 3.1}, "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "status": "OK"}