{"results": {"totalCommentsFound": 8064, "totalCommentsReturned": 25, "comments": [{"commentID": 21686642, "editorsSelection": 0, "updateDate": "1488652438", "approveDate": "1488652438", "parentID": null, "rgt": 1123, "replyCount": 0, "userLocation": "NYC", "commentSequence": 21686642, "commentBody": "Sadly, there is no solution. Of course we can try and negotiate but that generally is a futile way to divide opinions with no real resolution (look at the mideast).<br/><br/>And we all know the jong is irrational, and so is trump. And jong is not going to stop research and development until he can hit any target anywhere on earth.<br/><br/>Hopefully a few level heads behind the scene in each country will have an influence on both leaders to not fire first. And maybe China or even Russia will have an effect on jong, but we can't count on it.<br/><br/>The rest of us can pray, and vote for someone more sensible next time. But still, there is no real solution. No one is going to change either side's mind unless new people come into power. Then maybe. <br/><br/>Otherwise there will probably be war at some point. The side with the best cyber capabilities and anti-missile system might win. Be ready is about all we can do.", "userDisplayName": "dre", "assetID": 3466332, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 69464265, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1122, "createDate": "1488651670", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21686652, "editorsSelection": 0, "updateDate": "1488652438", "approveDate": "1488652438", "parentID": null, "rgt": 1125, "replyCount": 0, "userLocation": "Lake Charles, La.", "commentSequence": 21686652, "commentBody": "Mr Trump has created a \"sinkhole\" during his transition that has myopically engaged him in trying to prove that he is the \"best\" and has done the \"most\" as compared to other presidents. To his (dis)credit, he has also the worst record in having the number of important vacancies filled, has offended the most number of allies, threatened to dissolve or disengage from the organizations like NATO, UN, etc.<br/>Today, with his tweets against President Obama, he will perhaps earn the reputation of being the \"meanest\" president ever during the first 45 days of his term.<br/>How good is Mr Trump at dealing with such International crises? How difficult will it be for him to transition to a \"mindset\" of a security focused president from a \"mindset\" of fiscally focused CEO? How capable is he when it comes to negotiating with North Korea? How much does Russia control his agenda? <br/><br/>I guess, today, Americans are wondering, does Mr Trump have the competency to make the \"best\" decisions when it comes to North Korea? We have very rich people in the current cabinet. Do we have competent people, though?", "userDisplayName": "jay", "assetID": 3466332, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 64900194, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1124, "createDate": "1488651886", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21686653, "editorsSelection": 0, "updateDate": "1488652438", "approveDate": "1488652438", "parentID": null, "rgt": 1127, "replyCount": 0, "userLocation": "Minnetonka, MN", "commentSequence": 21686653, "commentBody": "The most viable options, variables, initiatives, and countermeasures are clear and straightforward. The NSC and military planners have enough tactical and strategic wherewithal to make the right choices at the right time. Unfortunately our commander in chief has neither the patience, intellectual capacity, attention span, emotional comportment, nor the comprehension of all the moving parts to make a rational decision. Pray that someone near the top of the chain of command has gamed out what to do and how to execute the overriding of a catastrophic order by our impaired chief executive. ", "userDisplayName": "JS", "assetID": 3466332, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 63286714, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1126, "createDate": "1488651908", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21686655, "editorsSelection": 0, "updateDate": "1488652438", "approveDate": "1488652438", "parentID": null, "rgt": 1129, "replyCount": 0, "userLocation": "Goshen, NY", "commentSequence": 21686655, "commentBody": "The new \"bad guy\" in the eyes of most Americans  and the corporate press is Kim Jong-un.  The most alarming realization is having President Trump as our leader dealing with North Korea.  Given his history, political statements and Cabinet appointments, it is highly unlikely that the United States would seek a peaceful relationship with North Korea.  It will probably be only a matter of time and continued low public ratings before Mr. Trump orders a strike against North Korea.  Tragically such a decision would be horrendous.", "userDisplayName": "patrick ryan", "assetID": 3466332, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 70590156, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1128, "createDate": "1488651917", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21686676, "editorsSelection": 0, "updateDate": "1488652438", "approveDate": "1488652438", "parentID": null, "rgt": 1131, "replyCount": 0, "userLocation": "New Jersey", "commentSequence": 21686676, "commentBody": "The article has Obama advising Trump that this is the most serious issue facing his presidency.  One has to ask if Trump would accept this, as it seems he is more concerned about the fake news and daily knocks against his administration re: Russia.  And now all these tweets on Obama tapping his phones.  With that in his mind, would the president take his predecessor seriously on anything he might have told him?", "userDisplayName": "Bill Fennelly", "assetID": 3466332, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 8950382, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1130, "createDate": "1488652225", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html", "userURL": "NULL"}, {"commentID": 21681886, "editorsSelection": 0, "updateDate": "1488652454", "approveDate": "1488652454", "parentID": 21680164, "rgt": 1208, "replyCount": 0, "userLocation": "miami shores", "commentSequence": 21681886, "commentBody": "Many local governments require a type of coverage that stands in the place of a commercial vehicle policy. In my area, this information must appear on their cell phone Waybill.<br/><br/>Where there are large gatherings of people anxious to go someplace in a hurry, like an airport, solicitors pretending to be Uber are common and people will use them without looking for anything more than the logo in the window, which can easily be downloaded and printed.<br/><br/>If you must use a ride service, ask to see their Waybill, which should show the name of the Uber-sponsered insurance company in your area.", "userDisplayName": "lloyd", "assetID": 3466321, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 15734698, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1207, "createDate": "1488626561", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21682274, "editorsSelection": 0, "updateDate": "1488652454", "approveDate": "1488652454", "parentID": null, "rgt": 1425, "replyCount": 0, "userLocation": "London", "commentSequence": 21682274, "commentBody": "Uber uber alles. This company is the worst. Aside from all the digital skullduggery described in the article, ever-increasing fleets of vehicles, low-emission or otherwise, are exactly what our congested cities don't need. Improve public transport. ", "userDisplayName": "John", "assetID": 3466321, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 75905132, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1424, "createDate": "1488629671", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21683348, "editorsSelection": 0, "updateDate": "1488652454", "approveDate": "1488652454", "parentID": 21677611, "rgt": 198, "replyCount": 0, "userLocation": "saluda, virginia", "commentSequence": 21683348, "commentBody": "I used Uber once and first felt that I was \"beating the system.\" Since then I realized I was supporting someone who drove to pick up extra money while cutting the income of a taxi driver who did it  to make a living.  (full disclosure, I drove a licensed taxi evening to help pay for college.)<br/><br/>Uber is a bit like being a \"scab\" or strikebreaker. But we educated, white-collar folks don't need to worry, not until our job is outsourced. ", "userDisplayName": "hank roden", "assetID": 3466321, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 29945789, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 197, "createDate": "1488635051", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21683423, "editorsSelection": 0, "updateDate": "1488652454", "approveDate": "1488652454", "parentID": null, "rgt": 1427, "replyCount": 0, "userLocation": "Nebraska", "commentSequence": 21683423, "commentBody": "I continue to be amazed that people use Uber, when it's business plan is based on exploitation  of its drivers/team members and their capital/their autos.  I have always been curious about the insurance coverage that these drivers have.   They are \"transporting people for hire\".  I rode with a friend in an Uber, the driver a young college graduate who told us that he was driving his parents car, and could only drive for another 1000 miles or his dad's insurance rates would go up, and his parents would find out how he was using their car.<br/>From now on I will call a cab!", "userDisplayName": "Marsha  Congdon", "assetID": 3466321, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 34284453, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1426, "createDate": "1488635341", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21683674, "editorsSelection": 0, "updateDate": "1488652454", "approveDate": "1488652454", "parentID": null, "rgt": 1429, "replyCount": 0, "userLocation": "nyc", "commentSequence": 21683674, "commentBody": "If I avoid a government sting purely by my wits; Have I committed the crime of obstruction of justice? Simply because government sets up a sting I am not required to fall into it. It is clear Uber committed no crime in its use of Greyball. That said, Uber is not a cash business, it is a straight forward investigative technique to get a subpoena for the bank records and you have them.  ", "userDisplayName": "mkm", "assetID": 3466321, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 52521572, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1428, "createDate": "1488636257", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21684043, "editorsSelection": 0, "updateDate": "1488652454", "approveDate": "1488652454", "parentID": 21677763, "rgt": 364, "replyCount": 0, "userLocation": "Wisconsin", "commentSequence": 21684043, "commentBody": "Pat, you describe exactly my experiences with countless yellow cabs in Manhattan. Even in good weather, I have had to speak to at least three or four cab drivers before one would take me to a frequent destination, Fort Greene, Brooklyn.  Between four and six pm, I have had much difficulty getting cabs to go even within Manhattan, sometimes they will have on their for hire lights but won't pick you up if the destination isn't on THEIR way home due to change of shift. A couple of months ago a cab driver decided to drop me off before he got to my midtown destination because he said  he didn't want to face the traffic. Truly! Out of respect for their profession, I have never reported these people. I am an average looking, mobile 69 year old grandma and recently told another such grandma standing next to me in the E. 70's how to use Uber when she could not get a cab while I was whisked away in mere minutes by an Uber car<br/>Sorry to hear about the legal problems, hope those get resolved. But there are well founded reasons why customers use Uber and similar companies- they want to get efficiently to their destination. ", "userDisplayName": "nancy bendiner", "assetID": 3466321, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 58658138, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 363, "createDate": "1488637720", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21684142, "editorsSelection": 0, "updateDate": "1488652454", "approveDate": "1488652454", "parentID": null, "rgt": 1431, "replyCount": 0, "userLocation": "Boston", "commentSequence": 21684142, "commentBody": "As I travel a lot for work, I am a big Uber fan as it is incredibly easy to get a ride since there is only one \"number\" to remember no matter where I am. A<br/><br/>But I find it hard to look the other way  as it's increasingly clear that Uber's leadership  starting with its CEO is suspect with this gray tool, its gray practices with female employees and its gray dealings with drivers.  And I realize my continued use of this service makes me gray as well. <br/><br/>Money talks. And so we should walk away until Uber gets its act together. And so I'm now using other ride sharing services.  Boycott Uber.", "userDisplayName": "StandUp", "assetID": 3466321, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 19339656, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1430, "createDate": "1488638124", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21684347, "editorsSelection": 0, "updateDate": "1488652454", "approveDate": "1488652454", "parentID": 21677514, "rgt": 68, "replyCount": 0, "userLocation": "Florida", "commentSequence": 21684347, "commentBody": "Let us know when you figure out a better economic system than one that allows people to voluntarily trade on the open market. That includes the drivers, that, to your apparent amazement, chose to drive for Uber on their own accord. Apparently it was the best option available, in one of the best countries in the world as to standard of living. We could always go back to govt backed, monopolized taxi services. Cuz everyone just loves them so much. Never mind that the system probably violate a dozen antitrust laws. ", "userDisplayName": "Sammy", "assetID": 3466321, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 68732982, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 67, "createDate": "1488638880", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21684646, "editorsSelection": 0, "updateDate": "1488652454", "approveDate": "1488652454", "parentID": 21680257, "rgt": 1230, "replyCount": 0, "userLocation": "California", "commentSequence": 21684646, "commentBody": "If the \"law\" is bogus protectionism or dubious (as in California where the municipalities were found to be legislating outside their jurisdiction), then go for it.<br/>Besides, it's just making themselves less vulnerable to the shakedowns.<br/>Also they are not spewing pollution into the air like VW.<br/>It seems the consumers sure like them, and the drivers sure like them, or they wouldn't have so many of each!", "userDisplayName": "Dr. Azin", "assetID": 3466321, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 63982955, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1229, "createDate": "1488639928", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21685172, "editorsSelection": 0, "updateDate": "1488652454", "approveDate": "1488652454", "parentID": null, "rgt": 1433, "replyCount": 0, "userLocation": "LA", "commentSequence": 21685172, "commentBody": "Uber serves me well when I travel.<br/><br/>Those who oppose Uber are usually politically on the Left and prefer a highly-regulated taxi economy where rides will cost more, vehicles will be dirtier, and drivers will have an \"You're lucky that I picked you up\" attitude.<br/><br/>Being a native of New York City, I have long and frequently unsatisfactory experience with a highly regulated taxi economy.<br/><br/>I voluntarily choose Uber, and drivers voluntarily choose to work for Uber.", "userDisplayName": "James Stewart", "assetID": 3466321, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 2398146, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1432, "createDate": "1488641814", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21685554, "editorsSelection": 0, "updateDate": "1488652454", "approveDate": "1488652454", "parentID": null, "rgt": 1435, "replyCount": 0, "userLocation": "San Antonio TX", "commentSequence": 21685554, "commentBody": "Don't you just love the smell of raw capitalism in the morning?<br/><br/>Reading this article, it does not seem that this program is illegal.  Immoral and unethical yes but not illegal because it takes a while for the laws to catch up with reality.<br/><br/>Not that I am defending Uber but why aren't those speed traps Professor Henning talks about considered illegal too?  Cops camping out and writing tickets are doing so to generate revenue, not to ensure public safety.<br/><br/>Uniformed cops driving around in unmarked cars or worse white cars with white lettering or black cars with black lettering should also be against the law.  This does not improve safety one iota but did does wonders for revenue generation.<br/><br/>I have been wanting to write an app to find speed traps, the information needed is public but just try to get it.  You will get a huge bill for \"data processing\" when it is just a matter of dumping a database file.  A simple SQL query is all it takes.<br/><br/>Government by the people for the people is nothing but a big joke.  All legislators need to do is raise taxes and then the police can stop being revenue generators for cities all over the US.  That one act would boost public safety more than anything else.<br/><br/>Of course \"law and order\" Republican types will never raise taxes even if it intended to improve public safety.  No ,they would rather rob Peter to pay Paul and as a result the overall general welfare of the citizenry suffers.<br/><br/>What a messed up country we live in.", "userDisplayName": "Ben Alcala", "assetID": 3466321, "recommendationCount": 9, "status": "approved", "replies": [], "userID": 68656841, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1434, "createDate": "1488643709", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21685646, "editorsSelection": 0, "updateDate": "1488652454", "approveDate": "1488652454", "parentID": null, "rgt": 1437, "replyCount": 0, "userLocation": "Bella Vista, Ar", "commentSequence": 21685646, "commentBody": "So in the same manner in which it has largely destroyed the taxi industry, as soon as its self driving technology is perfected, Uber will doubtless make redundant its legions of contractor/drivers. For the new breed of tech \"disrupters\" this sort of soulless social darwinism is completely in character, even as they tell themselves they are somehow saving the world. Unfortunately I see a clear echo of this attitude in the comments of many Times readers, when speaking of \"low information\" Trump supporters who have been \"left behind by the global economy\". Not like I voted for President Dunderhead, but all I can say people is be careful who you talk smack about, you may end up on the same breadline.", "userDisplayName": "Glenn Baldwin", "assetID": 3466321, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 70261234, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1436, "createDate": "1488644204", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21685874, "editorsSelection": 0, "updateDate": "1488652454", "approveDate": "1488652454", "parentID": null, "rgt": 1439, "replyCount": 0, "userLocation": "Trust", "commentSequence": 21685874, "commentBody": "Uber is successful because it mostly offers great service at a reasonable price. It delivers what consumers want. If cabs were doing it better no need to worry about the competition. But they don't. Best of luck to Uber to abolish the entrenched mafia-like cab monopolies all over the world.", "userDisplayName": "Anti", "assetID": 3466321, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 62858942, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1438, "createDate": "1488645372", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21686037, "editorsSelection": 0, "updateDate": "1488652455", "approveDate": "1488652455", "parentID": 21677626, "rgt": 216, "replyCount": 0, "userLocation": "Everytown USA", "commentSequence": 21686037, "commentBody": "Oops. For a moment I thought this was a comment about Trump.    We live in times where uber-aggressive people amass great wealth by deconstructing frameworks that are still required for a prosperous society-- all while the counterbalances of power are either mesmerized and mystified by the antics of the Master Promoters posing as CEO's, or are standing by them waiting to gather crumbs they drop.   ", "userDisplayName": "Withheld", "assetID": 3466321, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 37403221, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 215, "createDate": "1488646254", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21686187, "editorsSelection": 0, "updateDate": "1488652455", "approveDate": "1488652455", "parentID": 21685918, "rgt": 1418, "replyCount": 0, "userLocation": "Pasadena, Ca", "commentSequence": 21686187, "commentBody": "Makes one wonder how many of today's \"successful\" business models are based solely on finding ways to exploit and violate the law.  That would explain a lot of what we see around going on.<br/><br/>I thought I was plenty clever too, when I was a kid, when I learned my dad left his change in his pockets when he hung them on the end of the bed.  Why earn and wait for my allowance anymore?", "userDisplayName": "Iver Thompson", "assetID": 3466321, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 37475504, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1417, "createDate": "1488647108", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21686292, "editorsSelection": 0, "updateDate": "1488652455", "approveDate": "1488652455", "parentID": null, "rgt": 1441, "replyCount": 0, "userLocation": "Washington, DC", "commentSequence": 21686292, "commentBody": "Uber is one of the most successful starts up using the disruptive business model.  It is a great transportation alternative to taxis, which are usually local monopolies.  Capitalism is about competition and choice enablers for consumers.  As Uber matures, I wish it continued success, and improvements in its internal operation and company culture without sacrificing its entrepreneurial spirit.", "userDisplayName": "MRL", "assetID": 3466321, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 36982192, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1440, "createDate": "1488647733", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21686464, "editorsSelection": 0, "updateDate": "1488652455", "approveDate": "1488652455", "parentID": null, "rgt": 1445, "replyCount": 1, "userLocation": "Pa", "commentSequence": 21686464, "commentBody": "If a city deems it illegal for Uber to operate there then its illegal. If Uber willingly goes out of its way to break the law fine and them. I am not sure what the big fuss is here. Uber is legal in many cities and countries for that matter. I think Uber is a great company for the most part. Where I live its legal and most people love it. If a city wants to make it illegal then they are doing a disservice to its residents and making getting around more costly \"their choice\". In a time when everything is getting expensive one would think people would want a cheaper and better alternative. ", "userDisplayName": "chrls", "assetID": 3466321, "recommendationCount": 0, "status": "approved", "replies": {"comments": [{"commentID": 21687180, "commentSequence": 21687180, "editorsSelection": false, "updateDate": "1488662368", "depth": 1, "approveDate": "1488662368", "userURL": "NULL", "parentID": 21686464, "createDate": "1488662074", "parentUserDisplayName": "chrls", "recommendations": 1, "commentBody": "\"one would think people would want a cheaper and better alternative.\"<br/><br/>And, in your opinion, Uber is that \"cheaper and better alternative.\" Not everyone holds that opinion.", "trusted": 0, "userDisplayName": "Lamont MacLemore", "status": "approved", "recommendedFlag": 0, "userID": 55919750, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "Kingston, PA"}]}, "userID": 78813641, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1442, "createDate": "1488649101", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21686467, "editorsSelection": 0, "updateDate": "1488652455", "approveDate": "1488652455", "parentID": null, "rgt": 1449, "replyCount": 1, "userLocation": "nyc", "commentSequence": 21686467, "commentBody": "This comment applies to NYC only.  Since the explosion of the app-based cars (Uber, Lyft, Gett, Via) in 2014, there are now 60,000 of them on the streets of Manhattan compared to 13,000 yellow taxis.   This has created two distinct problems: 1) The market for app-based service has reached its saturation point and the drivers, many of whom are chained to expensive leases for the vehicles they purchased, are barely able to make a living wage, and 2) the traffic in Manhattan has exceeded its saturation point. Perpetual jams are the norm in the city during the day and throughout the evening rush hours, far worse than anything we've seen in the past.  Want to go across town from 2nd Avenue to Broadway at 4 pm?  Better allow yourself an hour.  And if you're waiting for an ambulance to arrive, consider purchasing a skateboard.<br/>There needs to be a limit set on the number of for-hire vehicles that are permitted to operate in Manhattan.  This was done in 1937, when the medallion system (with all its flaws) was created.  A similar (but smarter) regulation needs to be created today. ", "userDisplayName": "Old Yeller", "assetID": 3466321, "recommendationCount": 8, "status": "approved", "replies": {"comments": [{"commentID": 21687199, "commentSequence": 21687199, "editorsSelection": false, "updateDate": "1488662956", "depth": 1, "approveDate": "1488662956", "userURL": "NULL", "parentID": 21686467, "createDate": "1488662270", "parentUserDisplayName": "Old Yeller", "recommendations": 2, "commentBody": "Empty Ubers jam shopping center parking lots and bus zones. Ubers with one passenger or just cruising are blocking our downtown streets. In San Francisco too", "trusted": 0, "userDisplayName": "george", "status": "approved", "recommendedFlag": 0, "userID": 65396387, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "coastline"}]}, "userID": 54288782, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1446, "createDate": "1488649151", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21686484, "editorsSelection": 0, "updateDate": "1488652455", "approveDate": "1488652455", "parentID": null, "rgt": 1451, "replyCount": 0, "userLocation": "<br/>", "commentSequence": 21686484, "commentBody": "Uber only shows that the unbridled capitalists in the \"new economy\" are no different from those of the old economy or the \"uber-wealthy\" in general.  Rules and laws (and taxes) are just for the \"little people\".  No rights for workers, no rights for customers, or for voters and their representatives, just profits for \"entrepreneurs\" who demand sovereignty over people and their elected governments. ", "userDisplayName": "Jaspm", "assetID": 3466321, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 1578727, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1450, "createDate": "1488649395", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}, {"commentID": 21686489, "editorsSelection": 0, "updateDate": "1488652455", "approveDate": "1488652455", "parentID": 21677514, "rgt": 70, "replyCount": 0, "userLocation": "Austin", "commentSequence": 21686489, "commentBody": "I agree there should be competition in this market. It's always best for the consumer. It baffles me how many monopolies exist today. I also believe UberX should comply with background checks and any related laws. Passengers would feel safe and cities would have no argument to kick them out of town. They are making things much more difficult they need to be. ", "userDisplayName": "Jenn Mansito", "assetID": 3466321, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 79387013, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 69, "createDate": "1488649462", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html", "userURL": "NULL"}], "api_timestamp": "1488826247"}, "debug": {"version": 3.1}, "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "status": "OK"}