{"results": {"totalCommentsFound": 8064, "totalCommentsReturned": 25, "comments": [{"commentID": 21680075, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": 21679836, "rgt": 160, "replyCount": 0, "userLocation": "Ohio", "commentSequence": 21680075, "commentBody": "@Luettgen: <br/><br/>I believe that we are in sufficiently desperate straits that the failure of this administration is the least bad thing that could happen at this time. From that standpoint it may be best that Sessions stay on for now and be closely scrutinized, since he is becoming a net liability to the administration. <br/><br/>But one need not accuse the Dems of bushwhacking. The Trumpkins are doing that to themselves.", "userDisplayName": "Realist", "assetID": 3466327, "recommendationCount": 20, "status": "approved", "replies": [], "userID": 1425920, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 159, "createDate": "1488599342", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680078, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 561, "replyCount": 0, "userLocation": "MA", "commentSequence": 21680078, "commentBody": "The reader is tempted to laugh, and it's probably a good thing to give in to the temptation, if for no other reason than to retain a sliver of sanity. But this exploding episode is getting more disturbing by the day and we seem to be looking at only the iceberg tips. <br/><br/>It is interesting to see leading Republicans suddenly circle the wagons against the indignity of shedding sunlight on this gathering stain when only a few months ago they insisted so much on investigating Hillary Clinton's each and every move. <br/><br/>Senator Grassley doesn't even want to require AG Jeff Sessions to return to Committee to clarify what might have been perjury. I guess it's OK if Sessions simply sends a handwritten sick note from home.<br/><br/><a href=\"http://www.endthemadnessnow.org\" title=\"www.endthemadnessnow.org\" target=\"_blank\">www.endthemadnessnow.org</a>", "userDisplayName": "John LeBaron", "assetID": 3466327, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 48751578, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 560, "createDate": "1488599377", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680138, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": 21679620, "rgt": 94, "replyCount": 0, "userLocation": "Manhattanville", "commentSequence": 21680138, "commentBody": ".<br/>A good analysis, Michjas, with one caveat:<br/><br/>Sessions's capacity for fair and honorable conduct of his new office was tainted before his name was placed into nomination. His history of rash and hateful actions and statements should have disqualified him. For months and months, he was the sole Senator supporting Trump's candidacy. That doesn't make him a Trump supporter, it makes him an outlier who never had to worry about winning elections and who was therefore free to act in accordance with his character.<br/><br/>In this instance, he showed he had no character.<br/><br/>All the other Senators -- good, bad, and Pat Roberts who is sleeping someplace where they never heard of Kansas -- showed, at the very least, decorum; for months. none of them supported Trump. (Marco Rubio gets a pass here, because he had absolutely no idea what he was doing when he was running, when he was a former candidate, or when he endorsed Trump.)<br/><br/>I often hear talk of Southern \"honor\". The Confederate flag stands for a time when honor was important, some say.<br/><br/>Sessions displayed his lack of honor when he took his oath of office, one that he had already broken (as the President had done, as well).", "userDisplayName": "MTF Tobin", "assetID": 3466327, "recommendationCount": 12, "status": "approved", "replies": [], "userID": 26424636, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 93, "createDate": "1488599789", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680178, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 563, "replyCount": 0, "userLocation": "Stockton", "commentSequence": 21680178, "commentBody": "Here's what I think happened,<br/>The Party of Lincoln, knowing full well the demographics do not favor their white male base in national elections are desperate to win the White House, and given a thoroughly despicable candidate, they resort to the lowest form of cheating, inviting a foreign power to help destabilize their \"enemy\", the party of FDR, thinking that if they lose, which they fully expected, no one would care and they could let the whole thing go. But now that they miraculously won the executive seat, they are confronted with a lack of planning on how to cover their tracks. Cries of fake news and attempts to shift blame are feeble attempts to cover up the fact that the party of Lincoln condoned, endorsed and coordinated the hacked data to their advantage. The Russians could not have done it on their own without help from within the American Political Establishment. And while Rome burns, Dimitri is out golfing again this weekend. What is his handicap, anyway, I wonder?", "userDisplayName": "Oneiric", "assetID": 3466327, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 37076710, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 562, "createDate": "1488600077", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680245, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": 21679836, "rgt": 162, "replyCount": 0, "userLocation": "Manhattanville", "commentSequence": 21680245, "commentBody": ".<br/>Cooperation with a foreign power in skewing the American process for vetting candidates -- for dogcatcher, mayor, President, or anything else -- should never be ignored.<br/><br/>If Hillary Clinton really did favors for foreign governments so as to enrich the Clinton Foundation (which she didn't), that should be pursued as well.<br/><br/>People talk about \"intent of the Founders\"? They disagreed on almost everything. There was no intent except this one thing: <br/><br/>They agreed to have an independent Nation, beholden to no Foreign Prince (they would have used uppercase that way).<br/><br/>If a NYT Commenter is willing to sacrifice that Independence -- that sovereignty -- then s/he opposes the Constitution. It's an option. For officers of the federal government, this is not optional. Devotion to the cause of nationhood is required, daily, hourly. No, it wasn't Russians who burned Washington D.C. in the war of 1812; but the nation's very existence hung by a few threads (symbolized by the tattered flag that flew over Fort McHenry, and led Francis Scott Key to ask a VERY long question), and that can happen again.<br/><br/>Just ask the leaders of a once-whole Ukraine.<br/><br/>(full disclosure: my ancestors were from various parts of the Russian Empire, including Ukraine. The last relatives we know of got out of USSR 3 decades ago. Only one of my grandparents was a natural-born US Citizen.)", "userDisplayName": "MTF Tobin", "assetID": 3466327, "recommendationCount": 14, "status": "approved", "replies": [], "userID": 26424636, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 161, "createDate": "1488600615", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680267, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 565, "replyCount": 0, "userLocation": "Bloomington, Indiana", "commentSequence": 21680267, "commentBody": "It would take a moron to think at this point that the election was not trained by Russian interference and that Trump and his people were participants.  Was the Russian ambassador (who is reportedly a spymaster) also at the Democratic convention?  If not, why in world was he in Cleveland?  I don't want a Special Prosecutor.  I want a new election.  Impeaching Trump only gives us Pence and as someone who has lived with him as Governor, we really don't want Pence.  The Republicans didn't win this election fair and square. They shouldn't be in the White House.  Is there any way to achieve that without waiting 4 years?", "userDisplayName": "Nancy", "assetID": 3466327, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 65883026, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 564, "createDate": "1488600783", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680275, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": 21679836, "rgt": 164, "replyCount": 0, "userLocation": "Pacific Palisades", "commentSequence": 21680275, "commentBody": "I disagree. There are no real solutions to real problems with Zero-sum Trump. There is no trust or cooperation possible when a so-called president vilifies publicly and frequently a hundred million of the citizens of this country, and has within a month in office enacted policies that hurt and threaten their communities, friends and family. The only way out is to stop this man and his people by all means within the constitution.", "userDisplayName": "Yasser Taima", "assetID": 3466327, "recommendationCount": 17, "status": "approved", "replies": [], "userID": 6621814, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 163, "createDate": "1488600854", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680368, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 567, "replyCount": 0, "userLocation": "Toronto", "commentSequence": 21680368, "commentBody": "At some point one or many of the many people the administration is arresting and deporting as being detrimental to the interests of the United States is going to site Sessions et al as a precedent capable of exonerating them.", "userDisplayName": "The Dog", "assetID": 3466327, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 60686108, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 566, "createDate": "1488601465", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680394, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 569, "replyCount": 0, "userLocation": "<br/>", "commentSequence": 21680394, "commentBody": "How hopelessly inept and unlawful does it have to get?  We can't be surprised that the Republicans are trying to close ranks around the miscreants, but seriously--the AG? The laws against perjury and treason don't reside within the exclusive realms of Congressional oversight, so why are the Dems not bringing out their big guns outside of the various not-ready-for-prime-time Congressional committees, and pursuing this to the extent possible under the law?  I'd happily donate to a legal fund for something like this.  We can't afford to wait until 2018, given the uncertainty of those elections and the clear pattern of Russian interference and involvement in undermining our democracy.  There's clearly more to come on this front--what are we waiting for?", "userDisplayName": "LoriB", "assetID": 3466327, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 46060901, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 568, "createDate": "1488601687", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680436, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 571, "replyCount": 0, "userLocation": "Massachusetts", "commentSequence": 21680436, "commentBody": "What to do with Sessions? What we should do with all good passive aggressive white nationalists, send them back to whence they came. This man deserves the same treatment and standards he applied to Bill Clinton. I have  learned that the folks who are most sanctimonious usually are the largest sinners. Sessions' news conference was a study in contorted body language and facial expressions. This is not the behavior of a man who had honest, but misguided conversations with an adversary. I am not feeling sympathetic.", "userDisplayName": "historyRepeated", "assetID": 3466327, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 77932223, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 570, "createDate": "1488602071", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680444, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 573, "replyCount": 0, "userLocation": "Roslyn, New York", "commentSequence": 21680444, "commentBody": "Apparently we are to believe that all these discussions were normal business for politicians. And yet never before in my time (think Eisenhower) have so many Russians spoken to so many people associated with one candidate then POTUS.<br/>All conducted while Russia was releasing hacked emails of the opponent.<br/>Given the current political reality, Democrats will have to settle for recusal. AG Sessions has other business to attend to such as voter suppression laws to ignore. I would like to chose option C but must be pragmatic.", "userDisplayName": "Elizabeth", "assetID": 3466327, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 75756905, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 572, "createDate": "1488602153", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680482, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 575, "replyCount": 0, "userLocation": "Bogotá, Colombia", "commentSequence": 21680482, "commentBody": "So Russia intervened in the US elections, just as the US has intervened in countless elections across the globe. Remember  the overthrow of Mosaddegh  in Iran in 1953. Remember the overthrow of Jacobo Arbenz in Guatemala in 1954. Remember the CIA interventions in the Chilean elections of 1964 and 1970, followed by the CIA sponsored coup d'etat on September 11th, 1973 (the first 9/11).<br/><br/>We know of this history because of the Church Committee hearings in the US Senate in 1976 set up to investigate abuses by the CIA and other agencies.<br/><br/>The regimes that followed US intervention were in most cases authoritarian and subject to the whims and temperament of the leader, surrounded by his generals and cronies. Yet in all these regimes, someone assumed the position of chief prosecutor and law enforcement official. That is, all had someone like Jeff Sessions who was, in most cases, complicit with and quietly supportive of the foreign intervention. <br/><br/>Of course, foreign influence could never be discussed or admitted. The cronies, generals and political hacks occupying the top positions of government all believed it was for the greater good of the country. Prevarication or perjury in the name of the common good is a small price to pay for achieving national renewal and greatness.<br/><br/>We in Latin America and in countries across the globe have seen this film before. It ends ugly. ", "userDisplayName": "Policarpa Salavarrieta", "assetID": 3466327, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 28388557, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 574, "createDate": "1488602431", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680526, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 579, "replyCount": 1, "userLocation": "Franklin,TN", "commentSequence": 21680526, "commentBody": "In order to understand Mr. Sessions' answer, you need to read Senator Franken's entire question: \"CNN just published a story alleging that the intelligence community provided documents to the president-elect last week that included information that \"there was a continuing exchange of information during the campaign between Trump's surrogates and intermediaries for the Russian government.\" Now, again, I'm telling you this as it's  coming out, so you know. But if it's true, it's obviously extremely serious and if there is any evidence that anyone affiliated with the Trump campaign communicated with the Russian government in the course of this campaign, what will you do?\" Sessions replied: \"Senator Franken, I'm not aware of any of those activities. I have been called a surrogate a time or two in that campaign and I didn't have communications with the Russians, and I am unable to comment on it.\" Three brief points: 1. Franken's question was framed in the context of the infamous dossier revealed by CNN. This dossier alleged repeated contacts in the previous five years between Trump advisers and the Russians. 2. Sessions meeting with the ambassador was in his senate office with two military aides in his capacity as a senator on the Armed Services committee, not as a campaign surrogate. 3. Given the context of the question and the contact it inferred, Sessions' answer is logical.", "userDisplayName": "Dennis De Young", "assetID": 3466327, "recommendationCount": 1, "status": "approved", "replies": {"comments": [{"commentID": 21682534, "commentSequence": 21682534, "editorsSelection": false, "updateDate": "1488634288", "depth": 1, "approveDate": "1488634288", "userURL": "NULL", "parentID": 21680526, "createDate": "1488631183", "parentUserDisplayName": "Dennis De Young", "recommendations": 0, "commentBody": "Haven't heard about the two military aides before but if true why hasn't Sessions trotted them out to back up his \"Only talking Senator stuff\" story? And \"infamous\" is one way of characterizing the dossier - another would be \"revealing.\"", "trusted": 0, "userDisplayName": "Lance Fortune", "status": "approved", "recommendedFlag": 0, "userID": 62378325, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "n/a", "replyCount": 0, "userLocation": "Illinois"}]}, "userID": 77770239, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 576, "createDate": "1488602766", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680728, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 583, "replyCount": 1, "userLocation": "Hanford, CA", "commentSequence": 21680728, "commentBody": "The fact that Mr. Sessions may have briefly spoken to the Russian Ambassador Sergey Kislyak in the context of his job as US Senator from Alabama in and of itself means nothing. Sen. Al Frankin's question to Mr. Sessions on this matter clearly was asking whether or not Mr. Sessions and the Russian Ambassador ever discussed the presidential campaign, not whether or not they ever spoke. Useless Washington meetings where the two may have met or spoken on other matters are commonplace and not by themselves unethical.  Although there is ample evidence that the Russian government actively tried to discredit the legitimacy of the 2016 Presidential election, there is no evidence that Mr. Sessions conspired with any Russian interlocutor to try to influence the result of that election. Unless such evidence is discovered, there is no reason why Mr. Sessions should be fired, forced to resign or for a special prosecutor. Given the need to quickly and thoroughly investigate Russian interference in the election, recusal is appropriate and sufficient at this point. ", "userDisplayName": "J. T. Stasiak", "assetID": 3466327, "recommendationCount": 1, "status": "approved", "replies": {"comments": [{"commentID": 21682444, "commentSequence": 21682444, "editorsSelection": false, "updateDate": "1488638624", "depth": 1, "approveDate": "1488638624", "userURL": "NULL", "parentID": 21680728, "createDate": "1488630736", "parentUserDisplayName": "J. T. Stasiak", "recommendations": 1, "commentBody": "Go back and look at the Franken video. You have your \"facts\" wrong.", "trusted": 0, "userDisplayName": "Deborah", "status": "approved", "recommendedFlag": 0, "userID": 60339062, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "Montclair, NJ"}]}, "userID": 2488984, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 580, "createDate": "1488604747", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680766, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 585, "replyCount": 0, "userLocation": "Ganoush", "commentSequence": 21680766, "commentBody": "Trump's world is only money.   Very possibly he has been laundering dirty Russian money for years in exchange for loans.   He needed cash since US creditors started turning him down after six bankruptcies and a lot of financial mess.<br/>Sessions is only a side show in this.<br/>Russia just needs to know all the players are on their team.<br/>Ross has the bank in Cyprus with Russian money coming in.  It flows out to the Trump team.<br/>Tillerson is going through the motions as Secretary of State...waiting for the big payoff of lifting Russian sanctions.  Rex will be richly rewarded by both sides.<br/>Manafort,  Page,  Flynn are the soldiers relaying messages,  reassuring Putin's team that what they want is coming.<br/>Trump is frustrated that he can no longer openly direct traffic on the plan.<br/>He was doing it until the late stages of the campaign.   Now he wants Kushner to direct traffic.  Jared is in over his head and no doubt very worried about what he's gotten himself into.  ", "userDisplayName": "Baba", "assetID": 3466327, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 72345522, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 584, "createDate": "1488605184", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680790, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 587, "replyCount": 0, "userLocation": "NY", "commentSequence": 21680790, "commentBody": "Jeff Sessions' ethical failures are doubly aggravating because he is so self-righteous to others.  This is the same Sessions who supports discrimination against LBGT individuals out of supposed religiosity.  This is the same Sessions who supports voter suppression out of supposed fraud concerns.  This is the same Sessions who feels entitled to judge what women do with their own bodies, however grudgingly he supposedly accepts Roe v. Wade as law.<br/>Jeff Sessions is hardly the only liar or judgmental person in the GOP, but the combination makes him insufferable. ", "userDisplayName": "NM", "assetID": 3466327, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 40118532, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 586, "createDate": "1488605395", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680889, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 589, "replyCount": 0, "userLocation": "CA", "commentSequence": 21680889, "commentBody": "In 2016, Fox News (as well as other media more trustworthy outlets) reported on the results of an Australian scientific study that indicated that approximately 20% of CEOs and prisoners are psychopaths. (<a href=\"http://www.foxnews.com/health/2016/09/15/your-ceo-could-be-actual-psychopath.html)\" title=\"http://www.foxnews.com/health/2016/09/15/your-ceo-could-be-actual-psychopath.html)\" target=\"_blank\">http://www.foxnews.com/health/2016/09/15/your-ceo-could-be-actual-psycho...</a> This percentage is much higher than in the general population. The psychopath can appear normal, even charming. Underneath, he/she lacks conscience and empathy, making him/her manipulative, volatile and often (but by no means always) criminal. Trump is a classical psychopath, but the diagnosis does not stop at the president. Although the researchers did not study politicians, it would be surprising if there wasn’t a higher percentage of psychopaths in politics and a disproportionately higher percentage as Republican politicians. Recent research indicates that the diagnosis of psychopathy can be made with PET scans of the brain. Perhaps all politicians should be required to have such scans and their results be part of full disclosure when they run for political office. ", "userDisplayName": "DAK", "assetID": 3466327, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 46626973, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 588, "createDate": "1488606673", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680959, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 591, "replyCount": 0, "userLocation": "SF", "commentSequence": 21680959, "commentBody": "Mr. Sessions met with the Russian Ambassador in his official capacity as Chairman of the Senate Armed Services Committee.  What did they discuss?  I assume it wasn't just two good-old-boys white nationalists getting together to shoot the breeze, i.e. that the Ambassador had a purpose in making the call.  For instance, did it have anything to do with easing the sanctions against Russia, either then or if Mr. Trump were elected?  Did they discuss Mr. Trump's relations with Russia, or anything about the political campaign.  Did the Ambassador give any hint or indication that his government would help the campaign, or prefer Mr. Trump over Sect'y Clinton.<br/><br/>I assume Mr. Sessions kept careful notes about their conversation (Was anyone else present?).  As this was official business, did he share these notes with his committee members, and also, especially, with the State Dept.?  (It's possible he was a backdoor channel authorized to negotiate with the Russians)<br/><br/>What, if anything, did the Ambassador ask the Senator about the state, or the plans, of American Armed Forces? <br/><br/>In this meeting, or in any other meeting with representatives of the Russian government, did Mr.Sessions confront them with their military aggression in Crimea or Ukraine, the downing of a civilian airliner, support for the use of chemical weapons in Syria, the bombing of civilians in Syria, assassinations of Russian dissidents, or violations of Arms Treaties with the U.S?  <br/><br/>Let's see the complete record of this.", "userDisplayName": "loveman0", "assetID": 3466327, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 73511720, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 590, "createDate": "1488607582", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680970, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": 21679620, "rgt": 96, "replyCount": 0, "userLocation": "Santa Monica", "commentSequence": 21680970, "commentBody": "Misspoke? Sessions was asked a direct question that had no complexity to it and his answer was not truthful, not factual, it was a lie. Why this incessant need to tap dance around this. Sessions was under oath to tell the truth and he did not. What more needs to be said? And if one insists on giving him some rope on this: isn't it a problem that our Attorney General is inept? That he cannot be clear and concise under questioning. That essentially he is a bad lawyer? ", "userDisplayName": "ffejers", "assetID": 3466327, "recommendationCount": 20, "status": "approved", "replies": [], "userID": 33988705, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 95, "createDate": "1488607865", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680993, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 593, "replyCount": 0, "userLocation": "Fairfiled, Ct.", "commentSequence": 21680993, "commentBody": "Sessions and Page are two of the Trump campaign associates who are probably just rabbit holes.<br/><br/>Manafort and Stone are the major connects.  They have been involved with Russian Intelligence/Officials/Kleptocrats for many years.  Not sure they knew about the hacking - probably just conduits for Putin and the Kleptocrats to launder money.  I doubt Putin would let those bozos any closer.<br/><br/>In that scenario Trump was just another \"useful idiot\" for Putin.  Trump is just someone who desperately needed loans and wasn't particular about the source. <br/><br/>Putin is considered an evil genius but maybe not.  Look at the blowback as a result of this little operation - the definition of over playing your hand : More sanctions and absolutely no chance for Trump to help Russia in any way.<br/><br/> There will be an independent investigation and his taxes will be subpoenaed.   They will probably show no taxes and no charity.  The only Russian conection may his willingingness to deal with Putin's kleptocrat buddies. <br/><br/>The conclusion may be that Trump and his associates did no more than wink at the Russians and cheer them on.<br/><br/>However, most Americans have enough of their values intact so the ugly truth will be enough to crater Trumps ratings to the extent that Republicans will find grounds to impeach him.  Lots of Republicans will come out from hiding under their beds - with their knives out.<br/><br/>The death spiral is speeding up.", "userDisplayName": "John", "assetID": 3466327, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 55290126, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 592, "createDate": "1488608213", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21681010, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 595, "replyCount": 0, "userLocation": "Arlington, Texas", "commentSequence": 21681010, "commentBody": "This administration's contempt for the truth lies at the root of its troubles over the Russian connection.  It is perfectly possible that none of the contacts between Trump's people and the Russians had any connection with Putin's intervention in our election.  <br/><br/>But  who will believe that now?  These people have lied so often about so many things that they long ago lost any credibility with reasonable people.  If Trump's presidency crashes because of suspicions aroused by his affection for Putin, then he will have only himself to blame.", "userDisplayName": "James Lee", "assetID": 3466327, "recommendationCount": 11, "status": "approved", "replies": [], "userID": 63418614, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 594, "createDate": "1488608546", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21681032, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 599, "replyCount": 1, "userLocation": "Portland Oregon", "commentSequence": 21681032, "commentBody": "\"He has these horrible views but he's sort of not viscous about them.\" Seriously.  Anyone familiar with the South knows that there are two types of racists.  <br/><br/>One is the in your face kind who casually drops racist terms in casual conversation.  This type is very angry and makes no bones about the fact that they consider whatever group they are prejudice against as less than human.  The good news is that at least you see this person coming and know exactly where they stand.<br/><br/>But the second kind, that's the kind who is scary.  They are polite and well mannered.  Kind even.  But while they may not advertise their prejudices, they will act on them.  These are the ones who change voting laws specifically to make it harder for the group they are prejudice against to vote.  They will smile and shake your hand and then stab you in the back.<br/><br/>Should Mr. Sessions be removed, probably.  Will he, highly doubtful.<br/><br/>The good news is we know what he is so we know what watch out for.  He's a quiet racist who wants to eviscerate civil rights especially for people of color and LGBT people.  He'll force us to have many much needed conversations about these rights which will likely land in court.<br/><br/>We absolutely need a special prosecutor.  Someone unbiased and not loyal to Trump needs to get to the bottom of this Russia situation for the sake of our democracy.  I don't want to wait 50 years like we did with Nixon.<br/><br/>At least we live in interesting times.", "userDisplayName": "Ami", "assetID": 3466327, "recommendationCount": 12, "status": "approved", "replies": {"comments": [{"commentID": 21682517, "commentSequence": 21682517, "editorsSelection": false, "updateDate": "1488631149", "depth": 1, "approveDate": "1488631149", "userURL": "NULL", "parentID": 21681032, "createDate": "1488631115", "parentUserDisplayName": "Ami", "recommendations": 3, "commentBody": "Ami,<br/><br/>I lived in North Carolina for 6 years and I can tell you I encountered these two kinds of people there. Similarly were those who held the prevailing opinion that there are two kinds of people from the North who are in the South - Yankees and Damn Yankees.<br/><br/>The difference? Damn Yankees stay.<br/><br/>So I left. <br/><br/>I did not like the feeling that behind the southern gentility lay a hatred that extends back to the 18th century, when sectionalism reared its ugly head and set our nation on a course it has yet to steer fully away from. Even Southerners I became friendly with would make no bones about the fact that they harbored that hatred for us Yankees and desperately wished for the South to return to its \"days of glory.\"<br/><br/>Jeff Sessions appears to me to be a Southerner who thinks that way and has committed the error of making his feelings known at times. He, like many Southerners, will deny it but in the end the truth will out.", "trusted": 1, "userDisplayName": "Citizen", "status": "approved", "recommendedFlag": 0, "userID": 49648210, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "RI"}]}, "userID": 66854707, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 596, "createDate": "1488609034", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21681060, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 601, "replyCount": 0, "userLocation": "Centennial", "commentSequence": 21681060, "commentBody": "What a tangled web of deceit and lies the whole Russian connection is.  Who associated with Trump hasn't been meeting with the Russians is the question.  With Sessions as Ag the fix was in.  Now he is hamstrung.  Hope Trump does what he usually does when someone is of no further use to him, and fires Sessions.  Sessions needs to beat Trump to the punch, and step up to the plate and resign like Flynn did.  He has no moral authority now with the people who work for him, and he cannot be an effective AG (not that he ever could) either.<br/>Too bad the Republicans have no moral compass anymore.  This fiasco does warrant investigation, because it is beginning to rise to the level of treason, but they aren't interested because their long held goals of destroying the social safety nets, getting even bigger tax breaks for the wealthy, and undermining women's and civil rights is just within reach, not to mention deregulating everything from banking laws to laws that protect the environment.  So, they will hold their tongues, and prevent to whatever degree they can any investigation of Trump's aides and of Trump himself. Who is there to trust anymore?<br/>Oh how I dearly miss President Obama, and his wise, cool intelligence, and most of all his integrity.", "userDisplayName": "Diana", "assetID": 3466327, "recommendationCount": 14, "status": "approved", "replies": [], "userID": 22629813, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 600, "createDate": "1488609456", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21681597, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": 21679836, "rgt": 166, "replyCount": 0, "userLocation": "Orlando, FL", "commentSequence": 21681597, "commentBody": "@Richard: You act as if Republicans got branded with contempt at random. No, they've well earned it. The party has given way to a radical right-wing anarchist insurgency against the very idea of modern government itself. It drags the principles of conservatism through the mud with every utterance, and endangers -- with its own contempt for science -- the survival of not just the nation but the entire species.<br/><br/>Any real conservative had a decent enough candidate in Hillary \"Everything's Fine\" Clinton. The people who've stuck with the party as it dove deeper into the pockets of the rich to collect the conspiracy-addled dregs of the American electorate into an organized political force had plenty of opportunities to abandon ship, to take a stand to save their party from ideological subordination to the madness of Steve Bannon. Frankly, those who made the conscious choice not to do so -- not out of visceral feelings or economic desperation, but largely free of such coercion -- are lucky to receive the generosity of contempt from the fellow Americans they've dragged into this Brave New World.", "userDisplayName": "Seb Williams", "assetID": 3466327, "recommendationCount": 24, "status": "approved", "replies": [], "userID": 72387087, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 165, "createDate": "1488622376", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21682251, "editorsSelection": 0, "updateDate": "1488630238", "approveDate": "1488630238", "parentID": null, "rgt": 605, "replyCount": 1, "userLocation": "Ann Arbor, Michigan", "commentSequence": 21682251, "commentBody": "But speaking of Cleveland, what in the world are foreign diplomats doing at our major political conventions?  The basic tenets of our democracy forbid the involvement or interference by foreign powers with our electoral process. Once our electoral process has been breached asit was in this campaign was, truth demands that we the people find out if this election was in fact rigged.  Perhaps it was the Republicans and the Russians both wanting to use<br/>Trump as their \"useful idiot\" to pursue their own agendas, and the Trump campaign thinking they were using the Russians to get elected, and of course to pursue more money for the trump family enterprises, i.e. Kushner and the Russians having meetings along with other Trump associates becoming too numerous to count, meeting with the Russians.", "userDisplayName": "fg", "assetID": 3466327, "recommendationCount": 7, "status": "approved", "replies": {"comments": [{"commentID": 21683904, "commentSequence": 21683904, "editorsSelection": false, "updateDate": "1488639657", "depth": 1, "approveDate": "1488639657", "userURL": "NULL", "parentID": 21682251, "createDate": "1488637210", "parentUserDisplayName": "fg", "recommendations": 0, "commentBody": "@fg: When Godefroi Munongo, Katanga's interior minister was accused in early 1961 of having a hand in the kidnapping and assassination of Patrice Lumuma, he replied, \"Prouvez le!\"Obama spent hundreds of thousands of taxpayer dollars to send political strategists to Israel in a failed attempt to defeat Bibi Netanyahu, liberal media was deafeningly silent. Grow up. This is one world, and has been since the explosion of the first atom bombs near the end of WWII. Nations are always interfering in other nations' internal affairs. In 1970 US intervened in Chile to bring down democratically elected president,Salvador Allende in favor of a \"golpe de estado\"by a camarilla of right wing generals. We backed Operativo Condor, anti communist alliance of cone nations in Latin America, and were complicit in the car bombing murder of Orlando Letelier in  Washington DC in 1976 by Pinochet's DINA. 0ne of the car bombers, who put together the \"engin infernal\" which killed Letelier and an aide, Ronnie Moffitt, was an American, Michael Vernon Townley. So, who's kidding whom?  ", "trusted": 0, "userDisplayName": "ALALEXANDER HARRISON", "status": "approved", "recommendedFlag": 0, "userID": 67182855, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "New York City"}]}, "userID": 40145447, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 602, "createDate": "1488629483", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}], "api_timestamp": "1488826192"}, "debug": {"version": 3.1}, "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "status": "OK"}