{"results": {"totalCommentsFound": 8064, "totalCommentsReturned": 25, "comments": [{"commentID": 21681602, "editorsSelection": 0, "updateDate": "1488631263", "approveDate": "1488631263", "parentID": 21680956, "rgt": 264, "replyCount": 0, "userLocation": "AZ", "commentSequence": 21681602, "commentBody": "Unlike private sector Unions, public sector Unions have enormous political power and are negotiating with an elected official with budget and taxing power.  Private sector Unions have a stake in the company making a profit.  Public sector Unions are negotiating with public officials with taxing and budget power. <br/><br/>Public sector Unions negotiating with politicians is a clear conflict of interest for both sides.  <br/><br/>They have the right to vote like everyone else.  That's called taxation with representation.", "userDisplayName": "HL", "assetID": 3466322, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 21919862, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 263, "createDate": "1488622436", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681656, "editorsSelection": 0, "updateDate": "1488631263", "approveDate": "1488631263", "parentID": null, "rgt": 467, "replyCount": 0, "userLocation": "New York", "commentSequence": 21681656, "commentBody": "Walker supporters in Wisconsin vote against their own self interest all the time. As a typical Republican, his politics are predictable support for policy that benefits elite money vice providing taxpayer service for taxpayer dollars. It is truly ironic Trump succeeds in getting wage-earner votes with labor-like populist rhetoric. However, Republicans have been doing that for years by stringing-together various single-issue causes, and tapping the simplistic and base impulses of their constituency by leveraging fear. In other words, it doesn't matter what they say to get a vote. Republicans will modify their narrative. Their true philosophy resides in what they establish as policy, and that policy always benefits wealthy people and transnational corporate interests.", "userDisplayName": "Ghost Dansing", "assetID": 3466322, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 67324313, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 466, "createDate": "1488623272", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681739, "editorsSelection": 0, "updateDate": "1488631263", "approveDate": "1488631263", "parentID": null, "rgt": 469, "replyCount": 0, "userLocation": "VA", "commentSequence": 21681739, "commentBody": "States have a history of discriminating against its weakest citizens by denying voting rights, by denying marital status to certain loving relationships, by under funding state schools that serve poor communities and by placing hazardous waste sites next to poor communities<br/><br/>State government  tend to work solely for  the interests of it most powerful constituents while ignoring how their economic, social  and environmental activities may impact neighboring  states and populations<br/><br/>A weak federal government with extremely strong, independent states were tried and codified once before  (The articles of confederation) and it led to the drafting of the US Constitution, the fighting of a civil war and the addition of a slew of new amendments to limit state rights and to ensure equality for all under the law<br/><br/>State Rights is  a deceitful euphemism  used for   denying vulnerable people civil, economic  and human rights <br/><br/>The examples cited in the opinion  ironically  demonstrate this by extolling the virtues of   rationing rights (reducing Collective bargaining, denying healthcare) and by humiliating its vulnerable populations (demanding drug tests as if unemployment is a character flaw) ", "userDisplayName": "Confused Democrat", "assetID": 3466322, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 75048738, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 468, "createDate": "1488624531", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682054, "editorsSelection": 0, "updateDate": "1488631263", "approveDate": "1488631263", "parentID": null, "rgt": 471, "replyCount": 0, "userLocation": "heartsny", "commentSequence": 21682054, "commentBody": "Scott Walker speaks about us Wisconsinites like we're all drug addicts and leaches off taxpayer money.<br/><br/>Truth is, Walker is the leach, a lifetime leach.  He has been leaching off us taxpayers since he dropped out of college and went into politics, a place he's been almost ever after, a legislator, Milwaukee County Executive, and now governor.<br/><br/>Truth is, he is probably concerned that he  won't be elected again because he has decimated our state and he is trying to get in with Pence, Trump, and other Buddy Wisconsinite Paul Ryan.<br/><br/>His leadership?  Our Veterans Hospital, which had a great reputation prior to Walker, is under federal investigation because of the horrible allegations there.  The administrator was just \"reassigned\" to a state finance position instead of being canned.<br/><br/>When Walker was in Milwaukee as County Exec, there were atrocities going on at the Milwaukee Behavioral Facility, even death.  Instead of giving the administrator the axe, Walker reassigned him.<br/><br/>When Walker came into offices, he closed down a juvenile correctional facility which had served juveniles for decades.  This was a place in closer the vicinity of the Milwaukee area, where many of the juveniles' families reside.  So he has sent them north, to another facility, far from potential family visitation, and probable oversight.  The result, the place is under federal investigation because of atrocities, including terrible injuries, there.<br/><br/>Walker schmoozes with the rich.  He cares not for others.", "userDisplayName": "MIMA", "assetID": 3466322, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 51905269, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 470, "createDate": "1488628144", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682107, "editorsSelection": 0, "updateDate": "1488631263", "approveDate": "1488631263", "parentID": null, "rgt": 473, "replyCount": 0, "userLocation": "GA", "commentSequence": 21682107, "commentBody": "If the Founders wanted the states to have great power, they would not have created a strong central government in the Constitution. Gov. Walker sounds like he adheres to the Articles of Confederation.<br/>The consevative agenda is to reverse the role of central government that addresses the needs of the governed. Gov. Walker suggests this responsibility belongs to the states. A third grader would understand this would not result in a \"United\" states where all people would have the same opportunities and rights. In addition, conservatives want the power plus a continuation of all the federal taxpayer dollars.<br/>It is incorrect to label progressives and liberals as adherents of \"big government.\" Progressives and liberals are committed to \"the common good\" of Americans that can only be realized by a strong central government that does not ignore the needs of the governed, that treats each American as a human being with dignity and respect, not as a lower class to be mistrusted.<br/>Gov. Walker is exhibiting Ivory Tower thinking, where all who reside there benefit, not those on the ground. ", "userDisplayName": "Kathy White", "assetID": 3466322, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 74003506, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 472, "createDate": "1488628497", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682170, "editorsSelection": 0, "updateDate": "1488631263", "approveDate": "1488631263", "parentID": null, "rgt": 475, "replyCount": 0, "userLocation": "Maryland", "commentSequence": 21682170, "commentBody": "Walker's message: hand over the social safety net (among other government functions, like education, justice, citizen rights) to the control of the states. After all, we are a nation of distinct states with differing populations, resources, views on society and the role of government. <br/><br/>Let's do that. Give Republicans what they want. ONLY if ALL federal aid to states is ended. No taxes from Maryland to educate Alabama or Mississippi. No taxes from New York to help rebuild states devastated by once-in-a-century storms which now strike every year. No taxes from Massachusetts to provide health care in Kentucky. No taxes from any Blue states to aid Red states.<br/><br/>Yes, according to Walker and Republican ideology, we are a nation of 50 states. Divided. <br/><br/>If Wisconsin wants to lower its education standards, by all means let them do it. Businesses will have to decide whether low taxes or poor educational opportunities are most important to their employees. Employees will have to decide whether low taxes and a low paying job is better than moving to a state where higher taxes pay for better education of their children.<br/><br/>Let Kentucky and West Virginia develop their coal industry on steroids. But only if other states can sue them for damages to their citizen's health and environment.<br/><br/>Republicans, like Walker, want to change the federal government of the United States of America back to its role under the Articles of Confederation. Make America great again: the Divided States of America.", "userDisplayName": "JABarry", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 55063995, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 474, "createDate": "1488628951", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682194, "editorsSelection": 0, "updateDate": "1488631263", "approveDate": "1488631263", "parentID": null, "rgt": 477, "replyCount": 0, "userLocation": "Westchester", "commentSequence": 21682194, "commentBody": "“I like to pay taxes. With them, I buy civilization.” - Oliver Wendell Holmes. This simple quote from one of the most influential Supreme Court Justices seems to have been forgotten by Republican Governors such as Sam Brownback who have tax cut their states back to the dark ages, where public education is now so underfunded, and producing such poor outcomes, that courts in Kansas have declared that the state has failed its children by not providing them even a basic education. A failure that disproportionately falls, of course, on minority students. What do you do to make it up to even one student who will not be able to succeed in life simply because of Republican policy? There is no remedy. There is only shame. Unfortunately shame is a concept that is foreign to most Republicans. You can point to case after case of Republicans failing to provide even the basic services that a government is responsible to provide. Those protesters are not protesting Republicans, they are protesting policies that will completely destroy Americas ability to excel at what has made us great.  ", "userDisplayName": "Jeff", "assetID": 3466322, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 46612130, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 476, "createDate": "1488629107", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682257, "editorsSelection": 0, "updateDate": "1488631263", "approveDate": "1488631263", "parentID": null, "rgt": 479, "replyCount": 0, "userLocation": "Massachusetts", "commentSequence": 21682257, "commentBody": "Just as all problems cannot be solved by the Federal Government, returning \"authority\" to the states will not magically create solutions to our national problems. It's all about balance between federal initiatives and management and the role of robust state government, which dates back to the post revolutionary war constitutional convention. A case in point is healthcare. Does Mr. Walker really believe every state given a block grant will create great, efficient and comprehensive health care for their citizens? Will there be national standards based on scientific evidence? Or do we allow poorer states to slip even further backwards? Another case in point is the environment. Without the clean water act and the EPA the Great Lakes would have never been cleaned up. The states simply could not agree to do it. Yes Mr. Walker Lake Michigan would still be filthy and unusable. In fact, the Lake Michigan shoreline is lovely and the water mostly clean. Finally, you say the founders envisioned this state run \"confederation\". On the contrary, the founders argued this point and won the battle to have a strong, central government that could provide a national framework that could look beyond only local needs. You might read \"The Quartet\" by Joseph Ellis in which the beginning of this journey is eloquently described. ", "userDisplayName": "johns", "assetID": 3466322, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 54804468, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 478, "createDate": "1488629525", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682310, "editorsSelection": 0, "updateDate": "1488631263", "approveDate": "1488631263", "parentID": null, "rgt": 481, "replyCount": 0, "userLocation": "Miami", "commentSequence": 21682310, "commentBody": "I am always puzzled by arguments that the founders established a precedent and there should be no deviation from it.  On the contrary, they were all about upsetting the status quo and inventing new institutions to suit the needs of the people.<br/>States rights began because governing as a democracy over long distances without a monarchy and standing army to enforce uniform rule was impossible.  We were a federation of democracies, each with the ability to look over its citizens.  Now we're a nation and the federal government can rule as a democracy so that every citizen has equal rights.  Too often states fail to provide equally for their citizens as the current differences in the treatment of LGBT people shows. My own state, Florida, refused Medicaid expansion funds.  Poor citizens went without basic medical treatment, our hospitals had to lose money to care for their emergency treatment and we taxpayers in Florida picked up the extra hospital bill when funds coming back from the federal government could have paid for it. All because our Republican legislature wanted to snub Obama.  Petty! ", "userDisplayName": "mzmecz", "assetID": 3466322, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 66159958, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 480, "createDate": "1488629912", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682370, "editorsSelection": 0, "updateDate": "1488631263", "approveDate": "1488631263", "parentID": null, "rgt": 483, "replyCount": 0, "userLocation": "Newport, RI", "commentSequence": 21682370, "commentBody": "How disingenuous to cloak important social and economic issues as \"states rights\"  and to take credit for 8 successful years of Obama's economic Federal direction of the economy suggesting it was the little state of Wisconsin's governor who returned the state to sounder financial footings.<br/><br/>So, are we now going to use States Rights to deal with the essentially global issue of Climate Change?  No, here the cloak comes off:  Since there is the State of California that wants tighter rules for emissions, the Trump regime is trying to take away their State's right to make their environment better.<br/><br/>Governor:  it is too easy to see through your arguments that States' rights are the issue. ", "userDisplayName": "Willem van Rijn", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 15075521, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 482, "createDate": "1488630316", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682432, "editorsSelection": 0, "updateDate": "1488631263", "approveDate": "1488631263", "parentID": null, "rgt": 485, "replyCount": 0, "userLocation": "Madison, Wisconsin", "commentSequence": 21682432, "commentBody": "As a long time Wisconsin resident, I can attest that Wisconsin is only doing \"great\" in the eyes of Gov Walker and his supporters like the Koch Brothers who have spent many million dollars to buoy his governance.   The Republicans have maintained tight control here by extreme gerrymandering that is under intense scrutiny and likely illegal.  The roads are in terrible shape, our employment and real wages lag in growth, and our public school system is undermined, underfunded and our state university system is faltering.   Our state, that has always had political extremes, but neighbors who could talk about that, now has citizens divided on politics as never before.  Our governor has set that tone of arrogance and self serving righteousness, rather than being inclusive of all of the state's citizens.  While Governor Walker would love to see himself in the favorable terms he wrote in this article, the reality on the ground is far different from his self view. ", "userDisplayName": "Karen Berger", "assetID": 3466322, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 63828867, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 484, "createDate": "1488630686", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682513, "editorsSelection": 0, "updateDate": "1488631263", "approveDate": "1488631263", "parentID": null, "rgt": 487, "replyCount": 0, "userLocation": "Wisconsin", "commentSequence": 21682513, "commentBody": "Scott Walker likes to think of himself as the brave superhero who faced down protesters and saved Wisconsin.   Even Republican primary voters realized that he has no qualifications as a leader other than that myth and quickly dispatched him from the primary.<br/><br/>Like Trump, Walker won by a tiny margin against a weak opponent and then proceeded to govern as if he had a mandate from the far right, slashing education, disregarding environmental protections, cutting road maintenance, turning back federal mass transit money, weakening gun laws, shredding the social safety net, and cutting taxes for wealthy campaign donors.  <br/><br/>He professes to like local control but when it doesn't suit him, like when counties and cities want environmental protections or parks without gun use, or regulation of frack sand mines, the state overrules them.<br/><br/>The result is that Wisconsin lags the country in job creation, roads are crumbling, the once proud University of Wisconsin is in decline, the budget now has a structural deficit that Walker wants to fill with borrowing, and clean water and air protections have been systematically undermined.<br/><br/>All this amounts to disinvestment in Wisconsin's future. Jobs?  There are some coming back to pockets of the 21st century economy that Walker neglects, like Madison, thanks mostly to President Obama's stimulus package, monetary policy and the workings of the business cycle. <br/><br/>Sorry, Scott.  You get zero credit for that!", "userDisplayName": "Ron", "assetID": 3466322, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 11018466, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 486, "createDate": "1488631108", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680179, "editorsSelection": 0, "updateDate": "1488631299", "approveDate": "1488631299", "parentID": null, "rgt": 489, "replyCount": 0, "userLocation": "California", "commentSequence": 21680179, "commentBody": "Scott Walker seems to be reminding Republican members of Congress that they are Republicans who represent only loyal Republican voters and donors. Their allegiance is to Republican leadership, ideology, and particularly to the donors who spent millions of dollars to advance the Republican agenda. They must ignore (and preferably denigrate) the ragtag protesters disrupting town hall meetings, as they're not constituents and are probably paid by liberal agitators to cause trouble and get undeserved attention. <br/><br/>In particular, Republican members of Congress must not be spooked by fake outrage from people who claim to be worried about losing their health care. That doesn't matter. The voters they represent hate Obamacare, and want it repealed sooner rather than later! And even more important, the donors are eager for the big tax cut they'll get when it's repealed. That's what Republican members of Congress need to focus on, and not get distracted by fake protests of whining liberal agitators.  <br/><br/>Of course, \"returning authority to the states\" applies only to states with Republican  governors and solid Republican-majority legislatures that dutifully rubber-stamp ALEC \"model\" laws and help the Koch Brothers achieve their vision of a Libertarian-Feudal America. Democratic states need the strong arm of the federal government to whip them into submission.<br/><br/>Republicans need to fact the voters. But only the loyal Republicans who voted for them, and will vote for them again in 2018.", "userDisplayName": "Ted", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 2675899, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 488, "createDate": "1488600079", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680454, "editorsSelection": 0, "updateDate": "1488631299", "approveDate": "1488631299", "parentID": null, "rgt": 491, "replyCount": 0, "userLocation": "Cincinnati", "commentSequence": 21680454, "commentBody": "I read this article to better understand the point -of-view of a leader who represents one spectrum of the GOP.  I hoped for substantive policy and fresh ideas. Instead, we got a specious states rights screed that is short on meaningful proposals. Wisconsin's citizens deserve better. Americans should continue to protest Scott Walker and other gutless, soulless, power-mongering politicians who systematically are destroying our government and our democracy. Don't rest, persist, only confront. ", "userDisplayName": "Just one voice", "assetID": 3466322, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 47361069, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 490, "createDate": "1488602213", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680567, "editorsSelection": 0, "updateDate": "1488631299", "approveDate": "1488631299", "parentID": null, "rgt": 493, "replyCount": 0, "userLocation": "Charlotte", "commentSequence": 21680567, "commentBody": "Gov. Walker either doesn't know history or chooses to ignore it when it comes to the relationship between states and the federal government.<br/>Yes, states used to have a lot of power and independent control. Some of them used that power to enact racist Jim Crow laws that deliberately protected and advanced the rights of whites and stomped all over the basic human rights of people of color.<br/>Other states were controlled by a small cabal of business interests that monopolized industry, wreaked havoc on the environment, kept working wages near the poverty level, and bought politicians who ensured that this caste system stayed in place generation after generation.<br/>The federal government pretty much had to step in to right so many wrongs. Give states half a chance, and they'll step back to what life was like 100 years ago, and we can't afford to let that happen.", "userDisplayName": "Vance", "assetID": 3466322, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 56516669, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 492, "createDate": "1488603237", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680938, "editorsSelection": 0, "updateDate": "1488631299", "approveDate": "1488631300", "parentID": null, "rgt": 495, "replyCount": 0, "userLocation": "Madison, Wisconsin", "commentSequence": 21680938, "commentBody": "Scott Walker is a liar on par with Donald Trump.  I am therefore shocked that the NYT bothers to print a word he says (or has ghost-written).  Walker and his fellow Republicans are well on the way to ruining Wisconsin.  They have gutted K-12 education, the vaunted UW system, and even technical schools; they have effectively destroyed conservation and anti-pollution efforts through our once-proud Department of Resources; they have move money to the rich and corporations.  It's a pay for play state.  Walker's notion of governmental \"reform\" would make George Orwell roll over in his grave.  I have voted in four states over the past 45 years, and no gubernatorial candidate – not one – has so promoted on his own political career at the cost of the citizens as Scott Walker.", "userDisplayName": "Thomas Givnish", "assetID": 3466322, "recommendationCount": 7, "status": "approved", "replies": [], "userID": 5891148, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 494, "createDate": "1488607228", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680945, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": 21679563, "rgt": 132, "replyCount": 0, "userLocation": "Illinois", "commentSequence": 21680945, "commentBody": "And Walker's desire to return power to the states flies in the face of the Fourteenth Amendment.  That Amendment changed the relationship between states and the federal government, and charged the federal government with protecting citizens of the United States against abuses of their rights perpetrated by state and local governments.<br/><br/>American citizens have the right to be treated the same, as American citizens, in each and every state.  Those rights don't vary from state to state, and include the blessings of liberty and a fair share of the general welfare.", "userDisplayName": "Tom", "assetID": 3466322, "recommendationCount": 10, "status": "approved", "replies": [], "userID": 7896611, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 131, "createDate": "1488607337", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681037, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 497, "replyCount": 0, "userLocation": "Vine", "commentSequence": 21681037, "commentBody": "His reference to the death threats his wife and he received is notable.  He deliberately conflates the person(s) who made those threats with the whole of the opposition he faced and that members of Congress face in town halls today.  In reality, such threats (and worse) are the products of mental illness and extremism that have nothing really to do with political dissent.  Yet he brings it up because it is part of a current talking point on the right, that the ongoing anti-Trump/anti-GOP protest movement is dangerous and that those involved are prone to violence.  The speech of Wayne LaPierre at CPAC was a paranoid and terrifying call to arms for conservatives to defend themselves against \"violent leftists.\"  Scott Walkers seems to be mainstreaming the paranoia.   ", "userDisplayName": "Heather", "assetID": 3466322, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 77790510, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 496, "createDate": "1488609095", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681054, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 499, "replyCount": 0, "userLocation": "Long Island N.Y.", "commentSequence": 21681054, "commentBody": "I don't care if Governor Walker reads this or not, but to my fellow intellects, have pity on him.<br/><br/>Here is an elementary school lesson anyone can understand; In the last fifty years, the American population has doubled and it has tripled since the great war. Currently there is only one federal employee serving every 100 American citizens, hardly an \"Enormous Government\". If the population grows then so must the government just to provide essential services.", "userDisplayName": "Patrick", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 44287968, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 498, "createDate": "1488609366", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681110, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 501, "replyCount": 0, "userLocation": "Somewhere in Maryland", "commentSequence": 21681110, "commentBody": "Perhaps some Democrats should take Walker and other Republicans up on their ideas for greater power for the states. The path to individualizing federal programs has been opened by the court rulings that allowed states to op-out of expanding Medicaid under Obamacare. What would result in all likelihood is that the poorer and/or Republican dominated states would continue to shrink back into an economic deep hole and residents who wanted a more fulsome approach to government and services to citizens would have to flee those states. Then, Wisconsin, Kansas, Louisiana, Mississippi and others could stew in their own juices. In 10 to 20 yrs. those states would be begging for a more active federal government. ", "userDisplayName": "Doug Terry", "assetID": 3466322, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 65455323, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 500, "createDate": "1488610450", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681274, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 503, "replyCount": 0, "userLocation": "Fort Mill SC", "commentSequence": 21681274, "commentBody": "Isn't this how Trump humiliated Walker in the election, by Walker promoting some kind of 00s conservativism?   Right to Work in 2017 is a formula for free market capitalism for the masses and socialism for the nation's corporations.  States rights today means free reign for national and global capital and no rights for workers or citizens.  The day that Walker has the power or the will to charge the national companies in his state to pay for \"the needy in your community\" -let alone the pensions for its teachers -is the day he and other 00 conservatives can once again talk about states rights or powers.  Insofar as business is state or local, Walker's argument might make some sense but insofar as national businesses have freedom Wisconson's workers never will, Walker promotes Wall Street ahead of Main Street.", "userDisplayName": "rudigermk", "assetID": 3466322, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 74556666, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 502, "createDate": "1488615142", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681348, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 505, "replyCount": 0, "userLocation": "USA", "commentSequence": 21681348, "commentBody": "This article is yet another example of the intellectually dishonest, self-serving, exploitative propaganda spewed by right wing politicians with no other intent than to persuade hard working Americans to give those politicians the power to their take away their collective bargaining rights, health care, quality public education, and good government.  <br/><br/>Protesters should take heart from this article and others like them. Politicians like Scott Walker wouldn't be trying to discredit and delegitimize them unless they were worried that the protesters might break through the propaganda and reveal the truth about the right wing agenda. Protesters should not stop excercising their first amendment rights to free speech and assembly; the clumsy attempts to restrict those rights in order to stop protesters from speaking their minds will only demonstrate that the Republican lip service to defending the Constitution is nothing but a sham.", "userDisplayName": "Teg Laer", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 78199554, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 504, "createDate": "1488617211", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681353, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 507, "replyCount": 0, "userLocation": "Wisconsin", "commentSequence": 21681353, "commentBody": "Yeah, about your \"triumph\" in Wisconsin, Gov, you really should look at what that \"courageous stand\" has wrought unto our state. You declined federal hi-speed rail funding that could have put Milwaukee and Madison on the 21st century transportation grid. You declined Medicare expansion, costing WI taxpayers the opportunity to get some bang for the bucks we send to DC and leaving thousands without adequate health care coverage. Huzzah!<br/><br/>As for busting the public sector unions, my wife is an RN in Madison, I work at a PhD level position at the UW and interact extensively with public school educators. In both professions I have witnessed an exodus of experienced professionals from their prior careers, unable or unwilling to work in public-goods institutions whose budgets have been cut in order to fund business, personal, and property tax rates. It will take decades to repair the damage to our educational and health care systems. Bully!", "userDisplayName": "Arabiflora", "assetID": 3466322, "recommendationCount": 7, "status": "approved", "replies": [], "userID": 69051750, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 506, "createDate": "1488617263", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681390, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 509, "replyCount": 0, "userLocation": "San Francisco", "commentSequence": 21681390, "commentBody": "American voters' \"clear answer\" in November was that we wanted Hillary Clinton to be president, by a margin of 3 million votes. It so happens that the preferences of Americans don't matter as to who becomes president, because the law of this land is that we in California are apparently subhuman drones unworthy of equal rights (it is mathematically impossible to believe that the Electoral College is just without believing this), but the fact of the matter remains: America wanted Hillary. Republicans have no mandate for anything. Walker and his Republicans may do what they will with our semi-democratic, rural-suprematist government; the laws give them all the power. But we must never allow them to get away with dressing up their perverse ideology in a false mantle of popular will. On this we must insist: America wanted Hillary.", "userDisplayName": "Eli", "assetID": 3466322, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 6214334, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 508, "createDate": "1488617982", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681421, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 511, "replyCount": 0, "userLocation": "Watertown, MA", "commentSequence": 21681421, "commentBody": "Republican congress men and women can also realize that they are deriving at their policy decisions from wrong premises. For instance they could understand that, contrary to GOP belief, people like the ACA (Obamacare), their public schools, clean water and air, and a federal hand that ensures they are staying safe against unfair lending practices by big banks. At the very least, Republican Congress men and women could realize that, before they are dismantling something that generally works even though it needs perhaps improvement, it would be good to have a plan in hand with what this needs to be replaced. If after 7 years of railing against Obamacare there is no credible plan for replacement, the call for repeal is rather ridiculous and bares the sole desire  for obstruction to everything a Democratic President may have done once.", "userDisplayName": "TT", "assetID": 3466322, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 75098016, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 510, "createDate": "1488618844", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}], "api_timestamp": "1488826193"}, "debug": {"version": 3.1}, "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "status": "OK"}