{"results": {"totalCommentsFound": 8064, "totalCommentsReturned": 25, "comments": [{"commentID": 21681546, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 517, "replyCount": 2, "userLocation": "Walllkill, NY", "commentSequence": 21681546, "commentBody": "Governor Walker, as a public school teacher and member of the teachers union, there aren't enough expletives for me to toss your way. They would be unprintable on this page anyway.   The Republican love with union busting and vouchers has one goal and one goal only. To further enrich those at the very top.    In the Republican universe, anyone who is not in the top 1% has been left behind. And they will be left behind even further once Social Security and Medicare have been privatized and voucherized out of existence.  I and liberals like me have absolutely no use for your brand of Lord of the Flies conservatism.   Your policies and politics would have us go back to a period of time where all of the social and economic advancement that we have made will have been rolled back and at that point we might as well start using leeches again to cure our ills. Legal, constitutionally protected free speech is guaranteed as a right in this country and nothing that you  or your fellow Republican lackeys can do can change that fact. The right to peaceably assemble shall not be infringed. Obviously people who break the law should get arrested but after what your side pulled in 2010  at town hall meetings, which included openly carrying assault weapons, you have a lot of nerve to try to stifle free-speech now just because it's against your side.  This self-serving screed just further demonstrate how deplorable the current conservative position is.", "userDisplayName": "Mark Rosengarten", "assetID": 3466322, "recommendationCount": 54, "status": "approved", "replies": {"comments": [{"commentID": 21682913, "commentSequence": 21682913, "editorsSelection": true, "updateDate": "1488633191", "depth": 1, "approveDate": "1488633191", "userURL": "NULL", "parentID": 21681546, "createDate": "1488633063", "parentUserDisplayName": "Mark Rosengarten", "recommendations": 277, "commentBody": "As a fellow teacher, I wish that our union took more action at the national level to protect our pay and living standards.  If teaching can't pay enough for a teacher to provide a decent standard of living for their kids, no high quality professionals will want to teach.", "trusted": 0, "userDisplayName": "Rod Viquez", "status": "approved", "recommendedFlag": 0, "userID": 67491063, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "n/a", "replyCount": 0, "userLocation": "New Jersey"}, {"commentID": 21686019, "commentSequence": 21686019, "editorsSelection": false, "updateDate": "1488646218", "depth": 1, "approveDate": "1488646218", "userURL": "NULL", "parentID": 21681546, "createDate": "1488646133", "parentUserDisplayName": "Mark Rosengarten", "recommendations": 16, "commentBody": "You can't blame unions for the low salaries and living standards. People in states like New Jersey and Wisconsin have chosen republican governors who clearly stated their intentions to undermine, and eventually, dismantle workers' protections and rights. A union can't fight when the political establishment is hostile and committed to their demise, and has been given absolute power by the voters.", "trusted": 0, "userDisplayName": "Mario Ruiz", "status": "approved", "recommendedFlag": 0, "userID": 74477580, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "Chino Hills, California"}]}, "userID": 59021402, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 512, "createDate": "1488621658", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681640, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 519, "replyCount": 0, "userLocation": "Dover, N.J.", "commentSequence": 21681640, "commentBody": "The writer pretends (lies to us) that voters repudiated Washington.  But they did not do that at all.  In fact, the Trump voter wants a strong man to actively help them with jobs etc.  They don't hate federal involvement in health care, they just want a lower price.  And a significant part of Trump's support is the elderly who benefit from Medicare and Social Security.  <br/><br/>So far, there has been no miracle delivered, either in Wisconsin or Kansas or anywhere else.  If you look at the data, much of the better and worse performance with regard to schools, unemployment and so on tracks with the percentage of non whites in the population.  So lily white Iowa does better than Illinois and Michigan with much larger black populations. <br/><br/>But nation wide, prosperity is much more likely in largely democratic states like CA, CT or NJ than in places with low taxes and so forth.", "userDisplayName": "Terry McKenna", "assetID": 3466322, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 58642608, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 518, "createDate": "1488623122", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681703, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 521, "replyCount": 0, "userLocation": "Midlands", "commentSequence": 21681703, "commentBody": "It is not that seldom that a former Government tries to direct the governing one after it to stay in the same tracks it had followed itself - and there are ways and methods to maintain power - even when long out of office.<br/>We have seen it clearly for all the time since 20 January: The election campaigning has never ended - only gone more like an unofficial \"revolution\", up and down the roads, burning a couple of cars, crashing a couple of shops, kicking a couple of people thinking otherwise, and filling democratic halls with undemocratic noise.<br/>And all that by a \"sudden all-people-embracing-spirit of-'oh-there-we-go\". Don't make me laugh! It's more like the demonstrations on the Maidan - remember that? - And remember where it ended? And remember who was closest with the people who did some very undemocratic things there - with hunting rifles, brought in from Lvov (near Poland). And remember how Mr. Obama's UN representative's Ms. Nuland consulted with \"Our Yats\", the leader of those movements (not to mention agents of a certain secret service mingling with Yats's troops)?<br/>It's not that bad - yet. But it looks like the same strategists at work. That should worry any President. But also all reasonable people. It's true: This change in Government was not expected - not by the Obama-Clinton side. And a number of his (and her?) favorite programs of \"Social Engineering\" towards his own orientation may be reversed in the interest of the majority.<br/>Is that why the rage is so wild?", "userDisplayName": "Jo Boost", "assetID": 3466322, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 33050428, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 520, "createDate": "1488624041", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681794, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 523, "replyCount": 0, "userLocation": "Tokyo", "commentSequence": 21681794, "commentBody": "A majority of taxpayers in America voted for Clinton, for Democratic Senators and for Democratic Representatives and thus for Democratic-supported policies.  It is only because of Citizens United and Republican voter suppression efforts that Republicans are in power in Congress and in so many state legislatures and indeed, in the Executive. How many black citizens and taxpayers were denied the vote in Wisconsin in 2016 thanks to Republican voter suppression efforts, Governor?   We don't want you or the other Republicans to tear American institutions up by the roots, to abrogate the Constitution or to improverish American workers.", "userDisplayName": "American in Tokyo", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 46880193, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 522, "createDate": "1488625397", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681810, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 525, "replyCount": 0, "userLocation": "East St Louis, Illinois", "commentSequence": 21681810, "commentBody": "Scott Walker used a divide and conquer strategy in Wisconsin, and it worked. The GOP plan was to separate union workers from non- union workers, weaken the public sector unions who were strong for the Democrats, and take control of the state government.<br/><br/>Wisconsin has since passed restrictive voter ID laws, making it more difficult for people to vote. Had the third-party voters voted for Hillary, Trump would not have won Wisconsin. Trump is clearly incompetent, the GOP is a wholly owned subsidiary of the NRA and the fossil fuel industry. Witness: the legislation that allows mentally ill people to buy assault weapons and the person who now heads the EPA.<br/><br/>We the People get the government we deserve. If we do not stay active against the Grand Obstructionist Party and Donald Trump, if we do not #Resist, we will be complicit in making America a second rate nation.", "userDisplayName": "Valerie Elverton Dixon", "assetID": 3466322, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 40246734, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 524, "createDate": "1488625665", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681880, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 527, "replyCount": 0, "userLocation": "Whidbey Island, WA", "commentSequence": 21681880, "commentBody": "Wisconsin gets 60% more Federal money than it pays<br/>Its unemployment rate is the same as in 2008.<br/>0.4% of its budget goes to public assistance- the same as most% state. Is it worth testing for drugs?<br/>18% to Medicaid- less than most states", "userDisplayName": "Andrew Mitchell", "assetID": 3466322, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 25113802, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 526, "createDate": "1488626483", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681943, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 529, "replyCount": 0, "userLocation": "Georgia", "commentSequence": 21681943, "commentBody": "Governor Walker, <br/><br/>I appreciate your acknowledgement that your Republican counterparts need to face their constituents. I believe that if they want to maintain representation for their states, it is imperative they actively listen to their neighbors and vote based on wisdom, not on wealthy donors and their political colleagues wishes. The hypocrisy is glaring. Many of your counterparts call us when they want votes, yet when you call them or send emails to their offices regarding concerns, there is barely a response and some of their staffers are rude. <br/><br/>I disagree with you regarding \"authority returning to states\". If that occurs, especially in education.....we will have pockets of excellence in some parts of our country and mediocrity in others. Additionally, this is one of the reasons we had conflicts between the Union and Confederacy in the past. If we fail to learn from history Mr. Walker, we are in danger of repeating it. I believe that In order for our Nation to remain competitive, the bar must be set high irrespective of zip code and shifting educational authority to the state level would be disastrous and the unintended consequences decades from now.....slow reversing. <br/><br/>My advice to you and your Republican colleagues is to slow down. This is not the time to be making drastic changes. Congratulations for a Republican Victory, but slow and steady wins the race. Failure for your Republican counterparts to recognize this may have negative results in upcoming elections.", "userDisplayName": "OMgoodness", "assetID": 3466322, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 69166128, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 528, "createDate": "1488627138", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682297, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 531, "replyCount": 0, "userLocation": "NY State", "commentSequence": 21682297, "commentBody": "What some call protests are actually demands by American citizens for a decent, honest, competent government.  Not the government we have today.<br/><br/>The American Revolution, which achieved our independence from Great Britain, and the enactment of the United States Constitution, began with protests.", "userDisplayName": "Charles", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 67190444, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 530, "createDate": "1488629842", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682343, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 533, "replyCount": 0, "userLocation": "Woodstock", "commentSequence": 21682343, "commentBody": "\"Yes, liberals will turn out to protest. But don’t let the left shape the debate.\"<br/><br/>Walker wants the right to misshape the debate instead. His \"my way or the highway\" approach to governing mangles the body politic and amounts to despotism. Democracy in our republic is supposed to keep sovereign power in the people--all of the people, not just those on one side of the body. We're the United States of America, not the Republican States of America. <br/><br/>After telling us that \"protesters dressed as zombies once interrupted a ceremony while I was talking with Special Olympians,\" Walker makes a risible claim: \"While not easy, I decided to take the high road.\" On his high road, peaceful protesters get arrested.<br/><br/><a href=\"http://host.madison.com/wsj/news/local/crime_and_courts/silent-zombie-protesters-arrested-at-capitol/article_94a2b5fa-a0bc-5d69-9097-55ff3de76569.html\" title=\"http://host.madison.com/wsj/news/local/crime_and_courts/silent-zombie-protesters-arrested-at-capitol/article_94a2b5fa-a0bc-5d69-9097-55ff3de76569.html\" target=\"_blank\">http://host.madison.com/wsj/news/local/crime_and_courts/silent-zombie-pr...</a><br/><br/>While it may be fair to question the timing of the protesters taking attention away from the Special Olympians that day, \"Walkers against Walker\" does have a nice ring to it. The governor needs to start paying attention to why the zombies of Wisconsin rise up against him, or one of these election days they will have him for breakfast.", "userDisplayName": "leeserannie", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 50453624, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 532, "createDate": "1488630190", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682442, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 535, "replyCount": 0, "userLocation": "Ms", "commentSequence": 21682442, "commentBody": "Mr. Walker, do you really think the allies would have won World War two if our response to the fascism's attempt to kill the free world had been limited by sates rights?<br/>Our world is now even more complicated and the problems are more critical than at any time in the past, what with terrorism, ignorance, famine, population's demand on resources, millions of displaced persons, obscene inequality, the effects of climate change generating ever more and deadlier disasters...<br/>Any fool can look at Brownback's Kansas, for a fine example of the failure of misdirected policies on a state level.<br/>Look at Africa, the Middle-East, Russia and the Ukraine...we need to understand the essential importance of national unity now more than ever.<br/>And the most bitter irony is that the Koch's (for just one example) selfish use of wealth to politically try and increase their wealth and control will only lead to more instability and a greater cost for everyone- including the billionaire's- further down the road.", "userDisplayName": "Bruce", "assetID": 3466322, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 32411948, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 534, "createDate": "1488630723", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682453, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 537, "replyCount": 0, "userLocation": "Cape Cod", "commentSequence": 21682453, "commentBody": " We can all agree that the federal government should give the citizens of a state the right to control their own lives to the extent that such control doesn't impact the lives of people in another state. That concept is in the Constitution. Further it is normal politics to argue about where the lines are drawn and when the doings of one state demand federal oversight and control. <br/><br/>But it is utter nonsense to argue that a state has any right to control federal land that happens to be within its borders. Federal land is owned by all of us and I, for one, as an American citizen of Massachusetts, care a whole lot about what happens to the federal land in Utah, Nevada and elsewhere.", "userDisplayName": "Mike Marks", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 30817763, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 536, "createDate": "1488630781", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682478, "editorsSelection": 0, "updateDate": "1488631300", "approveDate": "1488631300", "parentID": null, "rgt": 539, "replyCount": 0, "userLocation": "<br/>", "commentSequence": 21682478, "commentBody": "People who people who protest also vote and pay taxes. They should also have a voice in government through their representatives. Minority voices must be listened to, not restricted or arrested, that is not the way of a free society. Policy should be about needs, not ideology. And party should not come before country or people. Ideology does not get us clean air, good schools, drinkable water, or safe streets. And either does a balanced budget help children eat and aid the homeless, and heat the homes of elderly people. Budgetary ideology must not be the determinant of what is good and what is humane. Lawmakers must listen to the people, and that means all of them!", "userDisplayName": "Dianne", "assetID": 3466322, "recommendationCount": 12, "status": "approved", "replies": [], "userID": 72386513, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 538, "createDate": "1488630903", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680417, "editorsSelection": 0, "updateDate": "1488631321", "approveDate": "1488631321", "parentID": null, "rgt": 541, "replyCount": 0, "userLocation": "Los Angeles", "commentSequence": 21680417, "commentBody": "\"The GOP must stand strong\" against the will of the majority. Stand strong for the interests of the wealthiest, of the biggest meanest corporations. Stand strong against health care for all, stand strong against justice for the oppressed, stand strong against people of color. Stand strong against workers, stand strong in favor of the bosses who exploit them at every turn.<br/>Stand strong for gerrymandering and vote suppression, against the right of everyone to have equal access to cast a ballot -- because once everyone's vote counts, there won't be any more standing strong for the GOP!", "userDisplayName": "Al", "assetID": 3466322, "recommendationCount": 11, "status": "approved", "replies": [], "userID": 26768074, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 540, "createDate": "1488601869", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680456, "editorsSelection": 0, "updateDate": "1488631321", "approveDate": "1488631321", "parentID": null, "rgt": 543, "replyCount": 0, "userLocation": "new Jersey", "commentSequence": 21680456, "commentBody": "\"Despite the intimidation, we stood strong in our fight for taxpayers. It paid off, and today the budget is balanced, taxes are down and more people in the state are working than ever.\"<br/><br/>Wisconsin's economy ranks 28th in the nation.  Congratulations on your below average performance. Oh and tell the Koch's brothers hello.", "userDisplayName": "Babel", "assetID": 3466322, "recommendationCount": 14, "status": "approved", "replies": [], "userID": 48307985, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 542, "createDate": "1488602216", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680548, "editorsSelection": 0, "updateDate": "1488631321", "approveDate": "1488631321", "parentID": null, "rgt": 549, "replyCount": 2, "userLocation": "Madison, Wisconsin", "commentSequence": 21680548, "commentBody": "Give me a break.  This state is in decline and we can thank Scott Walker's war on the middle and lower classes, his assaults on unions and collective bargaining, his political corruption, and his contempt for education in general and teachers in particular for it.  Our neighbor and sister state to the northwest, Minnesota, is flourishing while we continue to sink.  We are leaving. After twenty-five years, we're out of here.  At 71, I'm going to a small village school at the foot of the Himalayas to teach.  I'm going to love it, just by being on another continent from Scott Walker and Donald Trump.", "userDisplayName": "Paul Benjamin", "assetID": 3466322, "recommendationCount": 17, "status": "approved", "replies": {"comments": [{"commentID": 21682765, "commentSequence": 21682765, "editorsSelection": false, "updateDate": "1488643270", "depth": 1, "approveDate": "1488643270", "userURL": "NULL", "parentID": 21680548, "createDate": "1488632476", "parentUserDisplayName": "Paul Benjamin", "recommendations": 0, "commentBody": "Lucky you! Enjoy !", "trusted": 0, "userDisplayName": "Bea", "status": "approved", "recommendedFlag": 0, "userID": 36727276, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "n/a", "replyCount": 0, "userLocation": "NYC"}, {"commentID": 21684499, "commentSequence": 21684499, "editorsSelection": false, "updateDate": "1488639851", "depth": 1, "approveDate": "1488639851", "userURL": "NULL", "parentID": 21680548, "createDate": "1488639412", "parentUserDisplayName": "Paul Benjamin", "recommendations": 0, "commentBody": "\" At 71, I'm going to a small village school at the foot of the Himalayas to teach. \"<br/><br/>Good for you!  As someone pushing 60 suffering from age discrimination in IT I love it when people like you demonstrate that age is nothing but a number.<br/><br/>\"I'm going to love it, just by being on another continent from Scott Walker and Donald Trump.\"<br/><br/>I am thinking of going to Canada where there are plenty of unfilled IT jobs, but then again I will be on the same continent.  Air and water pollution do not respect borders.<br/><br/>Once the USA returns to the state it was in during the 1930s I wonder if Canada will have to build a fence to keep Americans fleeing the smoking ruins of the USA out!<br/><br/> Scott Walker will not be satisfied until he turns the once proud University of Wisconsin into Trump University!<br/><br/><a href=\"https://userctl.com/BlueVsRed/074.png\" title=\"https://userctl.com/BlueVsRed/074.png\" target=\"_blank\">https://userctl.com/BlueVsRed/074.png</a>", "trusted": 0, "userDisplayName": "Ben Alcala", "status": "approved", "recommendedFlag": 0, "userID": 68656841, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "San Antonio TX"}]}, "userID": 57968899, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 544, "createDate": "1488603037", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680874, "editorsSelection": 0, "updateDate": "1488631321", "approveDate": "1488631321", "parentID": null, "rgt": 551, "replyCount": 0, "userLocation": "USA", "commentSequence": 21680874, "commentBody": "Republicans want to keep more dollars in the deep pockets and offshore tax sheltered accounts of their millionaire and billionaire supporters. Republicans seek to run up federal deficits again with tax cuts on the rich so the deficit explodes and they can 'save' both Medicare and Social Security by privatizing them, sending the money and 'caring for the needy' on Wall Street. To top it off they want to gut consumer protections.  Establishing programs to help average Americans, state or federal, is anathema to Republican ideology, and the GOP will work tirelessly to destroy any such programs, as they are now dismantling affordable health care for American families.", "userDisplayName": "AC", "assetID": 3466322, "recommendationCount": 10, "status": "approved", "replies": [], "userID": 6967505, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 550, "createDate": "1488606544", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680920, "editorsSelection": 0, "updateDate": "1488631321", "approveDate": "1488631321", "parentID": null, "rgt": 555, "replyCount": 1, "userLocation": "Tehachapi,Ca", "commentSequence": 21680920, "commentBody": "I guess the problem I have with \"states rights\" is the way this concept<br/>was used to try to keep racial segregation alive in the South years ago.<br/>It seems that \"states rights\" comes up whenever the real result looked for<br/>is to easily evade federal legislation of some sort. And that is the result I think<br/>Mr. Walker wants to happen.He wants free rein for the states to anything<br/>they darn well please with no interference from the Federal Government or<br/>anyone else. Well, Mr. Walker that is not the way things work in America.<br/>And instead of weaseling around you would do well to understand that.", "userDisplayName": "KT", "assetID": 3466322, "recommendationCount": 10, "status": "approved", "replies": {"comments": [{"commentID": 21682715, "commentSequence": 21682715, "editorsSelection": false, "updateDate": "1488643270", "depth": 1, "approveDate": "1488643270", "userURL": "NULL", "parentID": 21680920, "createDate": "1488632220", "parentUserDisplayName": "KT", "recommendations": 0, "commentBody": "this, exactly this!", "trusted": 0, "userDisplayName": "grace", "status": "approved", "recommendedFlag": 0, "userID": 60792576, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "chicago"}]}, "userID": 10835900, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 552, "createDate": "1488607014", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680968, "editorsSelection": 0, "updateDate": "1488631321", "approveDate": "1488631321", "parentID": null, "rgt": 557, "replyCount": 0, "userLocation": "New York", "commentSequence": 21680968, "commentBody": "The state Governors and the Republicans of the middle of the country states are the ones who watched while that part of the country went from a perfect mix of industry and agriculture to a shrinking economy consisting of stagnant farmland.  This has happened while the Northeast and West coast thrived in, if not created, the booming information age. Instead of realizing this phenomenal strategic blunder, they seem to want to regress to the stone ages. The youth of these states should throw out people like Walker and join the rest of new world economy and thinking. ", "userDisplayName": "Fleetwood", "assetID": 3466322, "recommendationCount": 13, "status": "approved", "replies": [], "userID": 55317548, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 556, "createDate": "1488607858", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21680976, "editorsSelection": 0, "updateDate": "1488631321", "approveDate": "1488631321", "parentID": null, "rgt": 559, "replyCount": 0, "userLocation": "Chicago, IL", "commentSequence": 21680976, "commentBody": "Hey Scooter. How're doing?<br/>How're the roads doing up there in Wisconsin? How's government transparency? Have to love those gerrymandered voting districts that a three-person federal judge panel (two appointed by Republican presidents) ruled unconstitutional and told your Republican legislature to redraw by the end of the year. Have to also love that the same legislature has just hired (with no spending cap) two highly-priced law firms to appeal that decision to the US Supreme Court---at taxpayer expense. Charging the public to disenfranchise themselves. Nice.", "userDisplayName": "Christina Thuli", "assetID": 3466322, "recommendationCount": 65, "status": "approved", "replies": [], "userID": 59188232, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 558, "createDate": "1488608043", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681022, "editorsSelection": 0, "updateDate": "1488631321", "approveDate": "1488631321", "parentID": null, "rgt": 561, "replyCount": 0, "userLocation": "San Francisco", "commentSequence": 21681022, "commentBody": "It's amazing that someone can think like this and be honest about it. What I like is that it's out in the open and center stage for all Americans to view and contemplate where they want our county to go. I'm lucky.  I live in California and more autonomy  would work well as our GDP and creative sectors will continue to improve and at the same time our safety net could be expanded. What about the rest of the US? And how the heck did the Republicans capture so much power with literally no message other than obstruction? What's wrong with our country? Now Walkers message is spreading to different parts of world via Trumpism. Out of work manufacturing workers did this on their own with help from liberals who didn't vote or stand up till it was too late. So game on Mr. Walker! The race for the domination of the world begins. ", "userDisplayName": "Phillip", "assetID": 3466322, "recommendationCount": 10, "status": "approved", "replies": [], "userID": 60293718, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 560, "createDate": "1488608851", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681065, "editorsSelection": 0, "updateDate": "1488631321", "approveDate": "1488631321", "parentID": null, "rgt": 563, "replyCount": 0, "userLocation": "Dubai", "commentSequence": 21681065, "commentBody": "Governor Scott Walker seems oblivious to the fact that the poorest states that depend most on Federal largesse are Red states run by his fellow Republican governors. He ought to know also that most of the \"donor\" states are Blue states where the liberals he detests so intensely work hard for the higher standard of living they enjoy. I am all for everybody keeping their tax dollars. Let's see who ends up missing the Federal government the most.  ", "userDisplayName": "Alfred Yul", "assetID": 3466322, "recommendationCount": 34, "status": "approved", "replies": [], "userID": 64558030, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 562, "createDate": "1488609536", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681217, "editorsSelection": 0, "updateDate": "1488631321", "approveDate": "1488631321", "parentID": null, "rgt": 565, "replyCount": 0, "userLocation": "NC", "commentSequence": 21681217, "commentBody": "I burst into tears at Scottie's vision for America. Then I went and looked at what's happened in Kansas, and I shuddered to even think what my brethren in the southern states would do with this sort of \"freedom.\" The more this stuff he thinks is good for the country actually becomes reality, the more I hope people who actually believe in it have to live with the consequences.<br/><br/>The problem is, the rest of us do, too.", "userDisplayName": "DVX", "assetID": 3466322, "recommendationCount": 23, "status": "approved", "replies": [], "userID": 66131335, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 564, "createDate": "1488613450", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681225, "editorsSelection": 0, "updateDate": "1488631321", "approveDate": "1488631321", "parentID": null, "rgt": 567, "replyCount": 0, "userLocation": "Texas", "commentSequence": 21681225, "commentBody": "Like his cohort Sam Brownback of Kansas, Scott Walker is nothing but a bought-and-paid-for puppet for the Koch brothers. Both of these undistinguished, witless men have have led their respective states to complete economic ruin, and have good reason to fear their constituents. Walker is such a coward he wouldn't even face senior citizens (a majority of them women) singing songs of protest in the Wisconsin capital building lobby. So much for the party of \"personal responsibility.\"", "userDisplayName": "John H", "assetID": 3466322, "recommendationCount": 51, "status": "approved", "replies": [], "userID": 54134008, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 566, "createDate": "1488613676", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681281, "editorsSelection": 0, "updateDate": "1488631321", "approveDate": "1488631321", "parentID": null, "rgt": 569, "replyCount": 0, "userLocation": "Charlottesville", "commentSequence": 21681281, "commentBody": "Scott Walker has ruined Wisconsin, which used to be an enlightened progressive state. Now it's a shriveled and scared and joined the midwestern rust belt. The University of Wisconsin, especially in Madison, used to be one of the pre-eminant universities in the world; despite a lot of talent, it's been squeezed and beaten down into a diploma mill.", "userDisplayName": "Larry Figdill", "assetID": 3466322, "recommendationCount": 27, "status": "approved", "replies": [], "userID": 33947, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 568, "createDate": "1488615359", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21681320, "editorsSelection": 0, "updateDate": "1488631321", "approveDate": "1488631321", "parentID": null, "rgt": 571, "replyCount": 0, "userLocation": "Paris", "commentSequence": 21681320, "commentBody": "Remember when Scott Walker tried (quietly) and failed to alter the mission statement of the University of Wisconsin by removing the words \"search for the truth\" and \"improve the human condition\" and replace them with \" meet the state's workforce needs?\" Just seeing his name on this anti-democratic,  anti-government screed made me want to scream. The idea that Scott Walker knows all about what \"the founding fathers envisioned for this country \" is farcical. We have a Constitution and Bill of Rights to help rein in the damage caused by politicians like Mr. Walker and that allow the kind of peaceful protests that are such anathema to him and his ilk.<br/><br/>This \"brave\" man who claimed he was qualified to go after \"terrorists across the globe\"  because he had faced down workers' protests is Wisconsin is still stinging from his early exit from the 2016 presidential race. If the voters of Wisconsin allow him to continue in his role as mini-dictator, shame on them.", "userDisplayName": "Susan", "assetID": 3466322, "recommendationCount": 53, "status": "approved", "replies": [], "userID": 62222075, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 570, "createDate": "1488616583", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}], "api_timestamp": "1488826193"}, "debug": {"version": 3.1}, "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "status": "OK"}