{"results": {"totalCommentsFound": 8064, "totalCommentsReturned": 14, "comments": [{"commentID": 21684965, "editorsSelection": 0, "updateDate": "1488689707", "approveDate": "1488689707", "parentID": 21664410, "rgt": 50, "replyCount": 0, "userLocation": "Rhode islans", "commentSequence": 21684965, "commentBody": "It's the cortisol itself that causes weight gain. For some people stress can also lead to more eating. Double whammy for them. I am like you, acute stress causes me not to eat,  but I know that my chronic stress and high cortisol has led to weight gain for me. Especially abdominal weight gain.  I exercise a few times a week and eat healthy but the stress still has caused weight gain for me. I can't quit my stressful job especially with two kids in college next fall. Wondering how to best manage stress to lower cortisol.", "userDisplayName": "Kim", "assetID": 3466218, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 66265943, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 49, "createDate": "1488641087", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/01/well/eat/stress-can-make-the-pounds-accumulate.html", "userURL": "NULL"}, {"commentID": 21686344, "editorsSelection": 0, "updateDate": "1488689713", "approveDate": "1488689713", "parentID": null, "rgt": 75, "replyCount": 0, "userLocation": "NYC", "commentSequence": 21686344, "commentBody": "The obese are continually scorned, \"fat-shamed\" in our culture in a thousand ways; by glaring looks, commercials, rude remarks etc.  You think that's not stressful?<br/><br/>Even religion gets into the act with the sins of \"gluttony\" and \"sloth\"<br/>which is more blame the victim: accusing them of either willfully getting fat AND not having enough discipline to stay on a diet!<br/><br/>But what if they are blameless?  What if there's a problem with fat regulation?  What if society is confusing cause and effect?<br/><br/>People assume that the obese simply eat too much and then don't exercise, but what if the body simply starts to store more incoming calories in fat cells due to endocrine imbalances?  Then the obese person would feel ravenously hungry, because they'd be starving, as more food became unavailable for energy because it was being stored instead.  At some point energy would vanish, as the body tries to husband what resources it has left.  And if the obese person had enough energy to exercise, is that even wise?  Wouldn't that boost hunger even further as they \"worked up a good appetite?\" <br/><br/>And as far as minorities are concerned, many of them live in \"food deserts\"<br/>where only sugary or fried foods predominate; where the dollar menu has won out over produce aisles of vanished supermarkets, and as a result<br/>insulin, cortisol and other hormones, out of balance, lead to more obesity &amp; metabolic syndrome; the result is shortened, painful lives filled with condemnation from society &amp; self.", "userDisplayName": "L.Braverman", "assetID": 3466218, "recommendationCount": 8, "status": "approved", "replies": [], "userID": 9468034, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 74, "createDate": "1488648050", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/01/well/eat/stress-can-make-the-pounds-accumulate.html", "userURL": "NULL"}, {"commentID": 21686775, "editorsSelection": 0, "updateDate": "1488689744", "approveDate": "1488689744", "parentID": null, "rgt": 77, "replyCount": 0, "userLocation": "Dallas, TX", "commentSequence": 21686775, "commentBody": "Has this study been repeated overseas?<br/><br/>I suspect the pattern is a particularly American outcome (like so many others) because American lives seem to chaotic and random due to the way it runs its economy and society.<br/><br/>What good is it if we are the most productive economy if everyone dies younger.", "userDisplayName": "Larry L", "assetID": 3466218, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 21066648, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 76, "createDate": "1488654598", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/01/well/eat/stress-can-make-the-pounds-accumulate.html", "userURL": "NULL"}, {"commentID": 21686815, "editorsSelection": 0, "updateDate": "1488689749", "approveDate": "1488689749", "parentID": null, "rgt": 79, "replyCount": 0, "userLocation": "USA", "commentSequence": 21686815, "commentBody": "This article is nothing new -  in fact there are many published studies on the stress, increased cortisol=obesity - not to mention increased blood pressure (a silent killer).  I have had my doctor tell to consider leaving a job because of increased health issues - none which I had before starting with my current employer (the turnover is monumentous, treat professionals with disregard, the list long) - even when on FMLA/disability leave one is still harassed.  Luckily, I can retire - which is probably the best option if I want to live.  Having been out on leave for almost 3 weeks - I have dropped the lbs without trying (I do maintain a healthy diet); some of the work related aches/pains have diminished significantly and I am no longer mentally &amp; physically exhausted to almost collapsing.", "userDisplayName": "LW", "assetID": 3466218, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 9835978, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 78, "createDate": "1488655676", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/01/well/eat/stress-can-make-the-pounds-accumulate.html", "userURL": "NULL"}, {"commentID": 21688640, "editorsSelection": 0, "updateDate": "1488689752", "approveDate": "1488689752", "parentID": 21660167, "rgt": 40, "replyCount": 0, "userLocation": "Italy", "commentSequence": 21688640, "commentBody": "Cortisol is essential for life. While excesses of strong synthetic cortisones can wreak havoc, more and more people who have insufficient production of cortisol, or insufficient function of cortisol are benefitting from physiologic dose cortisone replacement therapy. My cat was cured of virally stimulated feline leukemia by Dr. AL Plechner who gave it it physiologic doses of hydrocortisone, thyroid hormone, a hypoallergenic diet, a natural clay powder for minerals, and digestive enzymes. It was emaciated with swollen lymph nodes. It then beat the virus &amp; leukemia &amp; turned into a beautiful  healthy creature again. The cat tested high in cortisol when we started the treatment, but the vet understood the high cortisol was actually non functional cortisol--the cat was cortisol deficient. He could tell from the high eosinophil level it had, and the high total estrogen test. Eosinophils drop when there is too much functioning cortisol in the system. High cortisol can be a sign of pituitary hyper stimulation in the presence of non-functioning cortisol, as can high total estrogen. Paradoxically, many people who test high cortisol, actually have adrenal exhaustion.  Thyroid  hormone receptors bind when cortisol is deficient and estrogens rise.. Many of these people are obese due to low functional cortisol and low functional thyroid hormone. Chronic stress can cause adrenal exhaustion but so can many other things including genetic inheritance, poor diet, toxic exposure, etc... ", "userDisplayName": "Fragilewing", "assetID": 3466218, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 68140866, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 39, "createDate": "1488669863", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/01/well/eat/stress-can-make-the-pounds-accumulate.html", "userURL": "NULL"}, {"commentID": 21688690, "editorsSelection": 0, "updateDate": "1488689888", "approveDate": "1488689888", "parentID": 21660167, "rgt": 42, "replyCount": 0, "userLocation": "Italy", "commentSequence": 21688690, "commentBody": "Excess functioning cortisol, or excess cortisone will do that... but a lack of cortisol will also set up a metabolic blockade. It is all about balance in the body,,,There are many metabolic poisons in the diet. Refined sugar and hydrogenated and trans fatty acids are two of the worst. Good nutrition is needed for the enzymatic systems, and other metabolic systems to function properly. Magnesium, for instance, is need for 300 different enzymatic functions in the body. ", "userDisplayName": "Fragilewing", "assetID": 3466218, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 68140866, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 41, "createDate": "1488670166", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/01/well/eat/stress-can-make-the-pounds-accumulate.html", "userURL": "NULL"}, {"commentID": 21688703, "editorsSelection": 0, "updateDate": "1488689891", "approveDate": "1488689891", "parentID": 21658953, "rgt": 32, "replyCount": 0, "userLocation": "Italy", "commentSequence": 21688703, "commentBody": "And not all high cortisol is functional cortisol, or stress related. Unfortunately the patterns can be easily mistaken by reaserchears.", "userDisplayName": "Fragilewing", "assetID": 3466218, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 68140866, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 31, "createDate": "1488670251", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/01/well/eat/stress-can-make-the-pounds-accumulate.html", "userURL": "NULL"}, {"commentID": 21688788, "editorsSelection": 0, "updateDate": "1488689894", "approveDate": "1488689894", "parentID": 21656235, "rgt": 18, "replyCount": 0, "userLocation": "Italy", "commentSequence": 21688788, "commentBody": "But that is only one of several patterns that  can occur with a high cortisol test. The other pattern creates a metabolic blockade when the body is pumping out cortisol because the cortisol is not entering the system and functioning well. Since cortisol is essential for life, the body keeps trying to stimulate its production in that case. If my cat that was cured of the leukemia with physiologic dose cortisol replacement, had had functioning cortisol, we would have lowered instead of raised its immunity by giving it cotrisol. Lots of obesity is coming from the metabolic blockade and hormonal imbalances which are set up by low functional cortisol. ", "userDisplayName": "Fragilewing", "assetID": 3466218, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 68140866, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 17, "createDate": "1488670740", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/01/well/eat/stress-can-make-the-pounds-accumulate.html", "userURL": "NULL"}, {"commentID": 21688911, "editorsSelection": 0, "updateDate": "1488689900", "approveDate": "1488689900", "parentID": 21649380, "rgt": 6, "replyCount": 0, "userLocation": "Italy", "commentSequence": 21688911, "commentBody": "The world expert on the importance of the cortisol balance in the body is a veterinarian, Dr. Al Plechner, who spent worked on over 100,000 animals. in a 50 year career. The best source is his book, \"Pets as Risk.\" There is also a book by a university researcher, Dr. William Jeffries, called, \"The Safe Uses of Cortisol\". Dr. Thierry Hertoghe has a short You Tube segment on cortisol. Dr.Plechner's therapy saved three out of four cats with feline leukemia for me, with his endocrine immune protocol. He has been subject to attack by the establishment for using physiologic dose cortisone therapy, but his therapy works. Dr. Plechner saved many animals from many things over a long, and nearly legendary career, by giving them a good hypoallergenic diet,  balancing their hormones, giving them small amounts of mineral clay, and non animal source-hypoallergenic digestive enzymes in their food . I highly recommend his book, \"Pets at Risk\", it is a life saver. ", "userDisplayName": "Fragilewing", "assetID": 3466218, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 68140866, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 5, "createDate": "1488671452", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/01/well/eat/stress-can-make-the-pounds-accumulate.html", "userURL": "NULL"}, {"commentID": 21689003, "editorsSelection": 0, "updateDate": "1488689905", "approveDate": "1488689904", "parentID": 21677058, "rgt": 70, "replyCount": 0, "userLocation": "Italy", "commentSequence": 21689003, "commentBody": "Take a look at Dr. Majid Ali's website, and his short videos on vimeo. Also look at veterinarian, Dr. Al Plechner's book, Pets at Risk\". He will explain the role hormone imbalance has in creating viral susceptibilities in various species. This occurs in humans too.  Pathology professor Dr. Majid  Ali\"s book, \"Oxygen and Aging\"-- unedited--full of mistakes, meandering, but never the less absolutely brilliant, if you can have the patience to read it will  slowly show you the universe of the biochemistry of the human body. As a pathologist and a master biochemist, he will show you how the body's systems break down, and how work to bring them back up again.  He will teach you how to work \"like a gardener, not like a mechanic.\" He saved me, and I have seen him save others from \"incurable\" diseases.", "userDisplayName": "Fragilewing", "assetID": 3466218, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 68140866, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 69, "createDate": "1488672004", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/01/well/eat/stress-can-make-the-pounds-accumulate.html", "userURL": "NULL"}, {"commentID": 21691061, "editorsSelection": 0, "updateDate": "1488689927", "approveDate": "1488689927", "parentID": 21661251, "rgt": 46, "replyCount": 0, "userLocation": "Florida", "commentSequence": 21691061, "commentBody": "Stress can be lowered by aerobics, been working for me for a long time.", "userDisplayName": "Trikkerguy", "assetID": 3466218, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 67863168, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 45, "createDate": "1488682367", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/01/well/eat/stress-can-make-the-pounds-accumulate.html", "userURL": "NULL"}, {"commentID": 21690980, "editorsSelection": 0, "updateDate": "1488689934", "approveDate": "1488689934", "parentID": null, "rgt": 81, "replyCount": 0, "userLocation": "Florida", "commentSequence": 21690980, "commentBody": "I don't know about the stress part of eating comfort foods, but I can attest to the fact that I am hooked on sugar. I'm also aware that if I knock off the cookies for a few days I lose weight.<br/>I also workout a lot for my age, 79 years old, I'm also hooked on exercise, strange combination, a cookie monster and addicted to the endorphins I get on a long ride on my Me-Mover, that and throwing weights around.<br/>But again, I don't think I'm stressed, and I know how to lose weight, just reduce the calories, the weight just drops.<br/>Maybe it's a well-kept secret what happens when you get past a certain time doing aerobics, something great happens, something maybe many people never experienced, that second wind where you just go, and your body takes over. Tension doesn't exist in that world, it can't, it's destroyed, and we all have the means to keep it away.<br/>So, I still like my cookies and my fun times on the Me-Mover, stress hasn't bothered me for some time, I'm too busy enjoying myself.", "userDisplayName": "Trikkerguy", "assetID": 3466218, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 67863168, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 80, "createDate": "1488681933", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/01/well/eat/stress-can-make-the-pounds-accumulate.html", "userURL": "NULL"}, {"commentID": 21691183, "editorsSelection": 0, "updateDate": "1488689938", "approveDate": "1488689938", "parentID": 21653414, "rgt": 10, "replyCount": 0, "userLocation": "Florida", "commentSequence": 21691183, "commentBody": "Too much political talk going on can be very stressful, along with meds, lots of meds, maybe too many meds.<br/>Two of my meds are mechanical, I ride it, go places all stress-free, it's called a Me-Mover, or I use a bicycle, it also takes you places. I don't consider them exercise tools because they are what my body needs, the physical motion that gives relief of stress.<br/>Sometimes it's hard to break free of conditioned responses to stress, but there are other answers, working out is an important one.", "userDisplayName": "Trikkerguy", "assetID": 3466218, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 67863168, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 9, "createDate": "1488683085", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/01/well/eat/stress-can-make-the-pounds-accumulate.html", "userURL": "NULL"}, {"commentID": 21692116, "editorsSelection": 0, "updateDate": "1488689947", "approveDate": "1488689947", "parentID": 21687090, "rgt": 14, "replyCount": 0, "userLocation": "New Orleans", "commentSequence": 21692116, "commentBody": "I eat pizza with a knife and fork, also, except for the crusty edge.  First, I cut that off, then nibble on it while holding it in my hand.  Then I demolish the soft, gooey, delicious part with a knife and fork, unless it is simply not runny--a four cheese pizza with no tomato sauce is an example of a pizza I will eat with my hands.<br/><br/>Ever try eating an Eritrean stew with teff?", "userDisplayName": "Lydia B", "assetID": 3466345, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 66865645, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 13, "createDate": "1488689888", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/04/opinion/sunday/donald-trump-vs-the-food-snobs.html", "userURL": "NULL"}], "api_timestamp": "1488826896"}, "debug": {"version": 3.1}, "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "status": "OK"}