{"results": {"totalCommentsFound": 8064, "totalCommentsReturned": 25, "comments": [{"commentID": 21683119, "editorsSelection": 0, "updateDate": "1488635238", "approveDate": "1488635238", "parentID": null, "rgt": 845, "replyCount": 0, "userLocation": "New York", "commentSequence": 21683119, "commentBody": "The Republican Leadership should have a clear understanding that although Mr. Trump won the election, as President, ( not a majority of voters but a majority of the electoral votes) he leads and works for everyone in the Nation. Not just the base. Those that elected and supported Mr. Trump heard that they would have better health coverage and lower premiums That is a heavy lift and I dare say no one will feel comforted in the fact that they have \"access\" to great coverage but it is out of financial reach. Compare your personal coverage, Mr. Scott or the coverage of all members on Congress enjoy  to what will be offered to your constituents in the Republican Plan. Shifting financial responsibility from the Federal Government to individual States creates a nightmare for the Governors . Those Governors send a lot of tax money to Washington and have an expectation that Washington help them to meet the needs of their constituents. You cannot praise the History of the Tea Party protest in the Boston Harbor  and dismiss the protests of the voters across the Nation. Every Republican has an issue with Teachers and Teachers Unions.. we will have that conversation another day. Your patting yourself on the back by offering the same old platitudes of \"we lowered taxes, held our ground and put people back to work\" are not supported by data. Tell that to those without work due to automation not Federal Regulations. Your governance model is grounded in the early 20th Century, not today.", "userDisplayName": "Michael", "assetID": 3466322, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 67781314, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 844, "createDate": "1488634063", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683129, "editorsSelection": 0, "updateDate": "1488635238", "approveDate": "1488635238", "parentID": null, "rgt": 847, "replyCount": 0, "userLocation": "Wilm DE", "commentSequence": 21683129, "commentBody": "Yes, the nation was founded by States, and with the intent that states retain powers.  But the constitution was created exactly because leaving most power in the states had failed under the Articles of Confederation, especially the power of collecting revenues.  85 years later the push to keep most power in the states tore the nation apart in our bloodiest war ever.  Yet people like Walker ignore the actual nightmares and chase that failed dream.<br/><br/>A key reason Wisconson was able to balance its budget was that federal  deficit spending saved the banks and the auto industry, halting the Great Resession.  When each states' share of that deficit is included, no state balanced their combined city/state/federal budgets.<br/><br/>I favor federalism.  CA should be allowed higher auto emmissions standards.  But fundamental power is constitutionally vested in national power, as are the requirements of equal justice and the Bill of Rights.", "userDisplayName": "Tolaf T", "assetID": 3466322, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 21142372, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 846, "createDate": "1488634126", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683163, "editorsSelection": 0, "updateDate": "1488635238", "approveDate": "1488635238", "parentID": null, "rgt": 849, "replyCount": 0, "userLocation": "Middle America", "commentSequence": 21683163, "commentBody": "Scott Walker is a lying, career politician propped up by billionaires looking to privatize the nation and reduce federal powers that can affect their bottom lines. They seek to do away with any regulations that were designed to balance and preserve the environment and economy.<br/><br/>He was at the forefront of the cunning Republican plan to take over state governments to wield as bludgeons against DC, helping turn an historically balanced neighborly, and community-minded populace into an extremely polarized partisan pit with his plan -- caught on video in the documentary \"As Goes Janesville\" -- to \"divide and conquer\" the public and private sectors.<br/><br/>Billionaire donor Diane Hendricks asked him in 2010 how he would make Wisconsin a red, right to work state and he -- a newly elected governor -- actually said he would \"divide and conquer\" his citizenry.<br/><br/>Mission Accomplished.<br/><br/>The partisan extremism we see nationwide happened here first because all three branches of state government were controlled by Republicans willing to sell their souls to oligarchs.<br/><br/>Walker's a cowardly puppet who has polarized the state on behalf of these billionaires.<br/><br/>He hid from the protesters and refused to listen becaus e he didn't have to . He \"lived to tell about it\" (what a tool!), but our civil society may not.", "userDisplayName": "D.A.Oh", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 57609397, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 848, "createDate": "1488634280", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683172, "editorsSelection": 0, "updateDate": "1488635238", "approveDate": "1488635238", "parentID": null, "rgt": 851, "replyCount": 0, "userLocation": "Colorado", "commentSequence": 21683172, "commentBody": "Under Walker, Wisconsin's job growth ranks 33rd in the nation. Even ALEC, hardly a bastion of liberal economic thought, ranks Wisconsin's economy between 41st and 44th in the nation.<br/>Furthermore, Walker's assertion that the Founders believed in a weak central government and strong state governments is incorrect.  Under the Articles of Confederation state governments were powerful and the Federal government was weak, and the new nation almost failed, falling into a state of gridlock.  That is the main reason that the Constitutional Convention was called and the Constitution enshrined the primacy of Federal laws over state laws and established a relatively strong Executive.  George Washington, John Adams and Alexander Hamilton were strong Federalists and Thomas Jefferson was the leader of the anti-Federalists.<br/>Scott Walker is advocating the Balkanization of the United States.  His policies should be firmly rejected by anyone who believes in economic opportunity and equality.", "userDisplayName": "Art", "assetID": 3466322, "recommendationCount": 8, "status": "approved", "replies": [], "userID": 25853092, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 850, "createDate": "1488634320", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683185, "editorsSelection": 0, "updateDate": "1488635238", "approveDate": "1488635238", "parentID": null, "rgt": 853, "replyCount": 0, "userLocation": "NYC", "commentSequence": 21683185, "commentBody": "Let's run a little thought experiment in which healthcare goes back to the states. Let's see. Insurance providers are big national corporations. Pharma the same. And then there's the consolidation in healthcare services such as clinics and hospital conglomerates. It's going to be challenging for a state to negotiate with national entities, as a purely practical matter. And what are the odds that the big providers on the other side will protest the patchwork quilt of state by state regulations? I know! Let's break up all multi-state entities in the healthcare industry. Dust off the too often body of antitrust laws. To play in this new vision of healthcare, you must be a small business. You know, to make it all workable. What do you think Scott?", "userDisplayName": "LaVonne Reimer", "assetID": 3466322, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 71188837, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 852, "createDate": "1488634382", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683189, "editorsSelection": 0, "updateDate": "1488635238", "approveDate": "1488635238", "parentID": 21681329, "rgt": 574, "replyCount": 0, "userLocation": "The Upper Peninsula", "commentSequence": 21683189, "commentBody": "And your point is what? That unions are ruining opportunity, progress, and prosperity in California? California: where the most prestigious universities in the world are humming along; where the modern tech, tourism, and agriculture industries flourish in a dynamic economy--the 7th largest economy in the world. Too bad they also have teachers, firefighters, and police who earn good wages and benefits.<br/>Who would want that? ", "userDisplayName": "Tim", "assetID": 3466322, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 40412093, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 573, "createDate": "1488634401", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683201, "editorsSelection": 0, "updateDate": "1488635238", "approveDate": "1488635238", "parentID": null, "rgt": 855, "replyCount": 0, "userLocation": "Tampa,Fl.", "commentSequence": 21683201, "commentBody": "We know Scott Walker is not so much a governor as he is a Koch brothers' proxy. In other words, he is against almost all government except for the police  and military (we must protect our property at all costs) and a firm adherent of \"all against all capitalism\". (Although he, like his fellow Wisconsin \"Kochie\" Paul Ryan, is certainly curiously attached to government paychecks.) Compare his philosophy and its underlying motivations expressed here to the other Op - ed piece today describing the Pope's view on giving and think deeply about what kind of country you want to live in - that is what is at stake and right now those who want to live in a world like that described by the Pope are losing.<br/><br/>and military (we must protect property at all costs)and a firm adherent of \"all against all\" capitalism. (Of course, like Paul Ryan and many others of the Ayn ", "userDisplayName": "pettitmichael36", "assetID": 3466322, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 66562265, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 854, "createDate": "1488634453", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683215, "editorsSelection": 0, "updateDate": "1488635238", "approveDate": "1488635238", "parentID": null, "rgt": 857, "replyCount": 0, "userLocation": "Kingston, NY", "commentSequence": 21683215, "commentBody": "Mr. Walker fails to point out that some issues cannot be effectively dealt with at the state level.  Pollution does not honor state borders.  And yet, the Trump administration is intending to gut the EPA and roll back as many environmental regulations as he can as fast as he can.  This responsibility will not be picked up by most states.  We will all suffer the results.  Another flaw in Walker's piece is that  the November election was not a strong mandate considering the outcome of the popular vote.   Finally, the real reason there is high employment in Wisconsin is not something Walker should take credit for.  It is because of the bubble of the surface mining of silica sand to support the oil fracking industry in other states.     ", "userDisplayName": "RoadFiddler", "assetID": 3466322, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 78886783, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 856, "createDate": "1488634522", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683225, "editorsSelection": 0, "updateDate": "1488635238", "approveDate": "1488635238", "parentID": null, "rgt": 859, "replyCount": 0, "userLocation": "Staten Island", "commentSequence": 21683225, "commentBody": "If we're going to drug test people seeking public assistance, we should drug test everyone who's being paid by the taxpayers: Presidents, congressman, governors, mayors, police, trash collectors, meter maids, etc. And what drugs to test for? Prescription drugs are the most abused drugs in America, will we test for them? What about alcohol? This a classic case of distraction and misdirection, so we don't realize that our pockets have just been picked.", "userDisplayName": "Ken", "assetID": 3466322, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 4556346, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 858, "createDate": "1488634537", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683279, "editorsSelection": 0, "updateDate": "1488635238", "approveDate": "1488635238", "parentID": null, "rgt": 861, "replyCount": 0, "userLocation": "Florida", "commentSequence": 21683279, "commentBody": "Republican love to justify their policies and actions by referring to the Founders. In doing so they invariably expose their ignorance of the Constitution and the intent of those who crafted it. May I remind Governor Walker that the Constitution was established to strengthen the Federal Government and to take power away from the states, which had proven themselves incapable of functioning beyond their own selfish interests. With this in mind, Madison drew up the Virginia Plan, the blueprint for the Constitution that was eventually to emerge. Much to Madison’s annoyance, he suffered two major defeats at Philadelphia. He failed to secure a federal veto of state laws and failed to establish the principle that representation should be proportional to population (hence the ludicrous fact that each state, regardless of size, has two senators). When talking about what the founders “envisioned” Scott Walker would do well to check his facts.", "userDisplayName": "Rodney", "assetID": 3466322, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 63342872, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 860, "createDate": "1488634773", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683281, "editorsSelection": 0, "updateDate": "1488635238", "approveDate": "1488635238", "parentID": 21679204, "rgt": 10, "replyCount": 0, "userLocation": "Princeton, NJ", "commentSequence": 21683281, "commentBody": "Doug, Yeah, but remember as the economy grows, the private sector needs more and more money which ultimately must come through federal deficit spending. Taxes take money out of the private sector, so only deficit spending adds the required new money.", "userDisplayName": "Len  Charlap", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 288945, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 9, "createDate": "1488634786", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683301, "editorsSelection": 0, "updateDate": "1488635239", "approveDate": "1488635239", "parentID": 21682938, "rgt": 816, "replyCount": 0, "userLocation": "New York", "commentSequence": 21683301, "commentBody": "That is a Liberal approach. One side of the dialogue is illiberal, and no longer values diversity of ideas, dialogue or deliberation in any sense. That side engages in manipulation of public opinion for purposes of achieving power only. They will engage in any amount of willful ignorance, and disinformation to achieve power, and will exploit Liberal tendencies for dialogue to achieve the perception of false equivalency. The Republicans stand on an entire landscape of \"alternative facts\", also known as falsehoods, that are widely embraced by their constituency. The appropriate response to this is to continue hammering at the invalidity of the essential propositions.", "userDisplayName": "Ghost Dansing", "assetID": 3466322, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 67324313, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 815, "createDate": "1488634840", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683361, "editorsSelection": 0, "updateDate": "1488635239", "approveDate": "1488635239", "parentID": null, "rgt": 863, "replyCount": 0, "userLocation": "Long Island", "commentSequence": 21683361, "commentBody": "I've read what this man has said. I've listened. He is wholly unconvincing. He claims so much but says so very little. He has accomplished even less. From what I can see, he has damaged his state and seeks to damage others in the name of state's rights. I think he is really doing it in search of neo-feudalism. He wants an end to protest by the average person. He is anti-democracy, cleverly disguising himself as pro-state. He seeks to divide this nation and its people so that he and his masters may rule. ", "userDisplayName": "Ralph", "assetID": 3466322, "recommendationCount": 7, "status": "approved", "replies": [], "userID": 1194442, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 862, "createDate": "1488635100", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683368, "editorsSelection": 0, "updateDate": "1488635239", "approveDate": "1488635239", "parentID": null, "rgt": 865, "replyCount": 0, "userLocation": "Bolivia", "commentSequence": 21683368, "commentBody": "    Words proper of a demagogue, someone willing to thrash higher education...to give the money to a sports club owned by a millionaire (although not surprising, coming from a guy who chose to forgo finishing college and meddle in politicking instead). It;s not that some of his assertions are untrue, it is his simpleton ideas of a complex social and economic societal problem that remains un-addressed by the G.O.P. (and Scott Walker, of course), the immediate need to assist folks in poverty, and lack of jobs, and unstable shelters with the specter of eviction ever-present, not out of compassion but in strict justice; we live in a capitalistic system that always trumps labor in favor of capital, with ever increasing inequality, and the inequities it entails. And speaking of Labor Unions, Walker seems to ignore their conquests so that today's laborer can work in dignity and relative safety, and not subject to the exploitations of abusive employers, which occurred with an awful regularity (prior to Union's intervention). Scott Walker is abusing his powers in office by trying to muzzle any riticism, however constructive. Not a good omen.", "userDisplayName": "manfred marcus", "assetID": 3466322, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 47112177, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 864, "createDate": "1488635114", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683377, "editorsSelection": 0, "updateDate": "1488635239", "approveDate": "1488635239", "parentID": 21680085, "rgt": 404, "replyCount": 0, "userLocation": "Brookline", "commentSequence": 21683377, "commentBody": "He's not alone. It seems the whole of the GOP denigrate and deride \"coastal elites\", forgetting that we generate 65% of GDP and pay 65% of the taxes that are promptly redistributed to red state denizens, whose own states refuse to tax theit wealthy citizens for the services their fellow citizens so desperately need. And these \"coastal elites\" (shorthand for all democrats, as not all dems live on the coasts) have largely gone along with this arrangement, because we genuinely want to help our fellow citizens in need. Until we got to the point of taxation without representation. Gerrymandering congressional districts to ensure they don't represent the people, then leveraging this system to stuff their retro values down our throats is really a step too far. So, I agree, The hubris of this group is breathtaking. And it will result in their downfall, just as it has from the ancient Greeks on through history. So take you're \"victory\" lap, Mr. Walker. Your warped view of this country is about to be roundly rejected. The GOP has awakened the sleeping giant by, as usual, pushing their minority views not just a bit too far, but so far out of the mainstream to awaken even the mildest mannered among us. I, too, am a nearly 60 year old who has never marched or participated in a protest in my life, but I've taken to the streets now -- and without encouragement from Soros or a paycheck! These are stories repugnicans tell themselves to avoid confronting the revolution unfolding before them..", "userDisplayName": "Oscar", "assetID": 3466322, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 53033665, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 403, "createDate": "1488635135", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683381, "editorsSelection": 0, "updateDate": "1488635239", "approveDate": "1488635239", "parentID": null, "rgt": 869, "replyCount": 1, "userLocation": "Golden, CO", "commentSequence": 21683381, "commentBody": "\" Explain that the centerpiece in the Republican agenda — returning authority to the states — is the best solution to our nation’s problems.\"<br/><br/>So true, as the EPA is busy withdrawing California's waiver  that allows California to impose more strict automobile pollution standards.", "userDisplayName": "Pat Roberts", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": {"comments": [{"commentID": 21683708, "commentSequence": 21683708, "editorsSelection": false, "updateDate": "1488638426", "depth": 1, "approveDate": "1488638426", "userURL": "NULL", "parentID": 21683381, "createDate": "1488636387", "parentUserDisplayName": "Pat Roberts", "recommendations": 0, "commentBody": "Yeah, it should it definitely be the solution. That way Wisconsin can pollute the Mississippi and let it go downstream for other states to deal with. Great idea.", "trusted": 0, "userDisplayName": "JKile", "status": "approved", "recommendedFlag": 0, "userID": 65050235, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "White Haven, PA"}]}, "userID": 42288419, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 866, "createDate": "1488635158", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682186, "editorsSelection": 0, "updateDate": "1488635243", "approveDate": "1488635243", "parentID": null, "rgt": 1779, "replyCount": 0, "userLocation": "Raleigh, NC", "commentSequence": 21682186, "commentBody": "If another country conspired to affect changes similar to those proposed by the Bannon-Putin administration, we would consider it an act of war.<br/><br/>So why is our own government acting like a foreign adversary?  Oh, wait ...", "userDisplayName": "TR", "assetID": 3466329, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 15227745, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1778, "createDate": "1488629037", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21682191, "editorsSelection": 0, "updateDate": "1488635243", "approveDate": "1488635243", "parentID": null, "rgt": 1781, "replyCount": 0, "userLocation": "North Carolina", "commentSequence": 21682191, "commentBody": "If this is a witch hunt, the coven is in big trouble.", "userDisplayName": "Michael", "assetID": 3466329, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 55169990, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1780, "createDate": "1488629099", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21682192, "editorsSelection": 0, "updateDate": "1488635243", "approveDate": "1488635243", "parentID": 21680121, "rgt": 1100, "replyCount": 0, "userLocation": "Norfolk", "commentSequence": 21682192, "commentBody": "Has our country really \"been attacked by Russia?\" I detest Trump as much as anyone but I also don't buy efforts to push for a cold (or maybe hot) war with Russia. I don't hear anyone accusing Israel of \"attacking us\" but they have done more than the Russians to influence our leaders and our elections. There are good reasons to  investigate international conflicts of interests withing this or any administration. This should include business as well as the influence of foreign governments whether Russian, Saudi, Israeli or Chinese. As for the focus on Russia we are seeing, it is vital that we separate actual harmful conflicting connections and influence from overblown narratives pushed to promote pretexts for a National Security State coup with dangerous implications. Journalist Paul Street writes of the danger of blindly repeating convention narratives:<br/> <a href=\"http://www.truthdig.com/report/item/the_deep_states_hatred_of_trump_is_not_the_same_as_yours_20170302\" title=\"http://www.truthdig.com/report/item/the_deep_states_hatred_of_trump_is_not_the_same_as_yours_20170302\" target=\"_blank\">http://www.truthdig.com/report/item/the_deep_states_hatred_of_trump_is_n...</a>", "userDisplayName": "Al M", "assetID": 3466329, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 66864730, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1099, "createDate": "1488629106", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21682193, "editorsSelection": 0, "updateDate": "1488635243", "approveDate": "1488635243", "parentID": null, "rgt": 1783, "replyCount": 0, "userLocation": "new england", "commentSequence": 21682193, "commentBody": "Our government looks inept.  They have been talking about Russian connections since way way back in the campaign, when Trump first spoke admiringly of Putin.  And are we not supposed to have the best intelligence agencies on the planet?   So what is taking so long?  Is there an actual investigation happening and why do they not have more facts?  Enough already with the speculation  and innuendo.  What we have in place of government is chaos.<br/><br/>Party politics are failing.  One side against the other and neither side is worth supporting.  The future of this country is looking very dark.  I've also been hearing about Obama having hired operatives with his Foundation in order to sabotage the Trump administration.  So all day, all night we hear about Trump because the Democrats are trying to get their power back and they are determined to get it back no matter what and we have the previous administration working behind the scenes to overthrow the current administration, but no one is investigating that?<br/><br/>You're all out of control.  And the public is getting caught up in it and not stepping back to look at the big picture of everything that is going on.  Perspective and cooler heads without an agenda are needed.  And all because we can't work out our differences and figure a way to co exist.", "userDisplayName": "liz", "assetID": 3466329, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 66955389, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1782, "createDate": "1488629107", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21682195, "editorsSelection": 0, "updateDate": "1488635243", "approveDate": "1488635243", "parentID": null, "rgt": 1785, "replyCount": 0, "userLocation": "Center City", "commentSequence": 21682195, "commentBody": "Why was Russian fertilizer oligarch Rybolovlev's private jetliner at same airport (e.g., Concord NC) as trump's plane on day of campaign appearances?  Didn't t-Rump sell this same thug an estate for $100 million that t-Rump paid $40 million for a couple of years earlier?  Never met the guy.  Really?", "userDisplayName": "Joe B.", "assetID": 3466329, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 54357050, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1784, "createDate": "1488629108", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21682197, "editorsSelection": 0, "updateDate": "1488635243", "approveDate": "1488635243", "parentID": null, "rgt": 1787, "replyCount": 0, "userLocation": "NM", "commentSequence": 21682197, "commentBody": "Tax. Returns. Now.", "userDisplayName": "Abel Fernandez", "assetID": 3466329, "recommendationCount": 7, "status": "approved", "replies": [], "userID": 51657090, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1786, "createDate": "1488629121", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21682199, "editorsSelection": 0, "updateDate": "1488635243", "approveDate": "1488635243", "parentID": null, "rgt": 1789, "replyCount": 0, "userLocation": "New Jersey", "commentSequence": 21682199, "commentBody": "\"Former diplomats and Russia specialists say it would have been absurd and contrary to American interests for the Trump team to avoid meetings with Russians...\"<br/><br/>Then it is ridiculous for Team Trump to deny having the meetings and get caught lying about it.  And it is beyond ridiculous for Sessions to claim he wasn't lying to Congress because he was wearing his armed services committee hat when he met Kislyak at the Republican convention.  Not so incidentally, Kislyak didn't attend the Democratic convention, when Clinton was still a heavy favorite to win.<br/><br/>With Trump acting like a guilty middle schooler, the path of least resistance is to assume he sold out our country to the Russians over money.  The only evidence that might refute that are his tax returns.  And he refuses to release them.", "userDisplayName": "P", "assetID": 3466329, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 1453344, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1788, "createDate": "1488629127", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21682204, "editorsSelection": 0, "updateDate": "1488635243", "approveDate": "1488635243", "parentID": null, "rgt": 1791, "replyCount": 0, "userLocation": "Florianopolis, SC", "commentSequence": 21682204, "commentBody": "At this juncture, there are two possible outcomes from the Trump/Russian affair. Both of them are sad to the occupant of the White House.  <br/><br/>In the best case scenario, a diplomatic initiative of normalization-cooperation between US/Russia is now dead. Back to the cold war status quo.<br/><br/>In the worst case scenario, president Trump could face congressional impeachment IF Kompromat material --that could be used to create negative publicity or blackmail him -- comes to light. ", "userDisplayName": "Uzi Nogueira", "assetID": 3466329, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 59960191, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1790, "createDate": "1488629160", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21682207, "editorsSelection": 0, "updateDate": "1488635243", "approveDate": "1488635243", "parentID": null, "rgt": 1793, "replyCount": 0, "userLocation": "St.Louis, MO", "commentSequence": 21682207, "commentBody": "I think Trump has proved to be the most dangerous man, intellectually vacuous, with not a sliver of a grasp of policy, and is being managed by a slew of special interests. Now with complete gutting of EPA and reversal of many critical rules that helped  this country to be livable and her air breathable, he's proven himself to be an unworthy caretaker of her people, especially the most vulnerable.  And none of the Republicans could even care?<br/><br/>I am so hoping this man's false pride and boorishness comes before a gigantic fall leading to his impeachment and the IC and the Press might be our only hope.", "userDisplayName": "Pillai", "assetID": 3466329, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 7287977, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1792, "createDate": "1488629179", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}], "api_timestamp": "1488826207"}, "debug": {"version": 3.1}, "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "status": "OK"}