{"results": {"totalCommentsFound": 8064, "totalCommentsReturned": 25, "comments": [{"commentID": 21682763, "editorsSelection": 0, "updateDate": "1488636573", "approveDate": "1488636573", "parentID": 21680014, "rgt": 110, "replyCount": 0, "userLocation": "Kyle TX", "commentSequence": 21682763, "commentBody": "Remember, \"there but for the grace of God, go I\".  Your truly intellectual, economic analysis somehow lacks the appreciation of the status, intellectual, economic, of someone in the position of asking for assistance.  Christ didn't ask people to help those in need only if there weren't adequate incomes available nor if the society had poor policies, but if there was need.  Try to earn a living as a cynic by relying on the help of strangers and see what's it's really like.   ", "userDisplayName": "Dick M", "assetID": 3466331, "recommendationCount": 7, "status": "approved", "replies": [], "userID": 63035040, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 109, "createDate": "1488632474", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21682869, "editorsSelection": 0, "updateDate": "1488636573", "approveDate": "1488636573", "parentID": null, "rgt": 379, "replyCount": 0, "userLocation": "New York", "commentSequence": 21682869, "commentBody": "Francis is clearly like one of the early Christians. In \"Through the Eye of the Needle,\" the historian Peter Brown's brilliant study of the changing attitudes toward wealth during the early Roman Empire, it's clear the early Christians understood the poor and the outcast as a special category of human existence that spiritually haunted those of who are not poor,. More, they believed giving to the poor was the only way for those with any wealth at all to reach God. After all, Jesus had explicitly said that it's easier for a camel to go through the eye of a needle [the small entry camels had to bend down and crawl through that was next to a city's gate] than for a rich man to get to heaven. <br/><br/>One of the most vigorous debates among these early Christians, then, devolved into whether getting to heaven required direct almsgiving, or whether giving indirectly, by supporting the many monasteries whose monks had deliberately chosen to be poor, reached God equally well. <br/><br/>My husband and I are not Christian, and in fact, are not religious at all. We do not see ourselves as trying to wangle anything from God; rather, out of some vague and unexamined sense of obligation that we simply must \"give back\" some of our (modest) wealth, we give regularly, with no discussion at all, to a rescue mission in LA and another here in NY.  <br/><br/>What Francis drives home for me is that while what we do may be commendable, it's a far cry from what Christianity asks of Christians. ", "userDisplayName": "Emile", "assetID": 3466331, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 34466522, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 378, "createDate": "1488632889", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21682882, "editorsSelection": 0, "updateDate": "1488636573", "approveDate": "1488636573", "parentID": 21682529, "rgt": 318, "replyCount": 0, "userLocation": "Charlotte, NC", "commentSequence": 21682882, "commentBody": "Over twenty million people moved out of poverty into the middle class during Clinton's presidency - a record number.  Yes he put limits on the amount of time able-bodied adults could stay on welfare but he also changed the rules so the working poor would not lose their health care. They also had much better access to job training, help with child care, etc. the money came from higher taxes on the wealthy. At the time I remember people on the left saying it was disrespectful to insist that people who were able to should find jobs. ", "userDisplayName": "Theodora30", "assetID": 3466331, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 58302078, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 317, "createDate": "1488632938", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21683079, "editorsSelection": 0, "updateDate": "1488636573", "approveDate": "1488636573", "parentID": null, "rgt": 381, "replyCount": 0, "userLocation": "Rhode island", "commentSequence": 21683079, "commentBody": "let him sell off some of the billions in wealth that the church owns....open the vatican gates, let the poor panhandle in his house. There will be plenty of people passing through.<br/>I along with many many others take care of the poor in a variety of ways. The goal should be to educate and employ. With all the immigrants coming in, that problem becomes even more difficult. But just giving and never educating, very rarely works.", "userDisplayName": "Angeli", "assetID": 3466331, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 62451779, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 380, "createDate": "1488633933", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21683127, "editorsSelection": 0, "updateDate": "1488636573", "approveDate": "1488636573", "parentID": null, "rgt": 383, "replyCount": 0, "userLocation": "Manhattan", "commentSequence": 21683127, "commentBody": "\"America is in the middle of a raging argument over poor outcasts. The president speaks of building walls and repelling foreigners.\"<br/><br/>This is not a correct statement. America, like the Catholic Church, is an organization founded on moral and ethical principles and the rule of law. Protecting those principles and enforcement of law is crucial to both organizations.  <br/><br/> No one speaks of repelling foreigners. We speak of protecting ourselves from foreigners who would come under the guise of a refugee but mean to do us harm; wolves in sheeps clothing.  They come from countries that don't have adequate screening capabilities. The proposed travel restrictions is a temporary measure until we can do what those countries can't. <br/><br/>We don't speak of outcasts. We speak of foreigners who have no respect for our culture and knowingly violate our laws. <br/><br/>The Catholic Church enforces their own unbending  laws and rules with an iron fist.  We deport, they excommunicate. And please note, the Pope gave that interview from behind the walls of the Vatican.", "userDisplayName": "Johannes de Silentio", "assetID": 3466331, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 29367679, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 382, "createDate": "1488634115", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21683153, "editorsSelection": 0, "updateDate": "1488636573", "approveDate": "1488636573", "parentID": null, "rgt": 385, "replyCount": 0, "userLocation": "Dallas", "commentSequence": 21683153, "commentBody": "I have always carried change in my pocket when in a city setting, so it's readily available if I'm asked. But several years ago in San Francisco, I learned another lesson---make the exact spare change, if requested.<br/><br/>My wife and I were across the street from Ben &amp;Jerry's in Haight-Ashbury when a guy asked me for thirty seven cents. Not thinking, I gave him the change I had in my pocket, probably quite a bit more than thirty seven cents. As we walked away, he began berating me from behind, yelling that \"I only wanted thirty seven cents. I have a job.\" This went on for several minutes for about a block, until I guess he got tired and gave up. It attracted a bit of attention however, and turned into a great little piece of street theater. It reminded not to question what someone else's motivation, or to judge their circumstances.<br/><br/>Maybe he'd been a bus driver.", "userDisplayName": "SLC", "assetID": 3466331, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 65862823, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 384, "createDate": "1488634241", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21683209, "editorsSelection": 0, "updateDate": "1488636573", "approveDate": "1488636573", "parentID": null, "rgt": 387, "replyCount": 0, "userLocation": "San Diego", "commentSequence": 21683209, "commentBody": "I don't know what put that person on the street.  I do know that even if they have a substance problem, I can't solve it for them.  Only they can.  In the mean time I can help ease their living conditions, so I give.<br/><br/>As a nation we have a pretty good idea about what works with the homeless and addicts, not a 100% success rate but pretty good.  We also have the money to do this, nationwide.  We, as a nation, have chosen to ignore this problem.  We have decided that spending $ Billions on bombing the rubble of the Middle East is more important than helping our people here at home.  <br/><br/>You and I did not put that person on the street, but we elected leaders (democratic and republican) who refuse to help our own people, who would rather give money to 6th century tribesmen who have been fighting each other for over 1,000 years, then solve problems here at home.  We should be first, ashamed, and then angry.", "userDisplayName": "Bruce Higgins", "assetID": 3466331, "recommendationCount": 11, "status": "approved", "replies": [], "userID": 58146393, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 386, "createDate": "1488634485", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21683309, "editorsSelection": 0, "updateDate": "1488636573", "approveDate": "1488636573", "parentID": 21682333, "rgt": 302, "replyCount": 0, "userLocation": "Tennessee", "commentSequence": 21683309, "commentBody": "If a person is reduced to being homeless, self-reliance has already been tried and found wanting. In a perfectly just society with good mental health services and a level economic playing field -in that fantasy world - it makes sense to talk about self-reliance. Not in this country, especially not right now.", "userDisplayName": "Hdb", "assetID": 3466331, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 66983264, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 301, "createDate": "1488634876", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21683337, "editorsSelection": 0, "updateDate": "1488636573", "approveDate": "1488636573", "parentID": null, "rgt": 389, "replyCount": 0, "userLocation": "NYC", "commentSequence": 21683337, "commentBody": "Many of the comments seem to take the whole thing a little bit too literally.<br/><br/>To give or not to give, to support charitable institutions instead, to perpetuate the problem, it is (or it's not) the government's responsibility... All legitimate questions, but for me what matters is what the pope says about looking these people in the eye, acknowledging their existence, their humanity. <br/><br/>If the politics, the ideological differences, the calcified truths we hold are a wall (sorry) that doesn't allow us to see the other person, then really all hope is lost. No one is suggesting that a couple of quarters will solve (or even alleviate) the problem. But making an effort to see human beings instead of an annoyance in your busy life is a good start.", "userDisplayName": "Serginho", "assetID": 3466331, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 4856553, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 388, "createDate": "1488634991", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21683356, "editorsSelection": 0, "updateDate": "1488636573", "approveDate": "1488636573", "parentID": null, "rgt": 391, "replyCount": 0, "userLocation": "Y'allywood", "commentSequence": 21683356, "commentBody": "The Pope is wrong on this one.  Giving money to panhandlers is a safety issue for the homeless person too (ie they could be hit by a car if they are holding a sign at a busy intersection).  Cities that allow panhandling also hurt the income and tips of minimum wage workers who suffer when tourists feel uncomfortable in an area.  Better to tip generously to bell hops, valets, food workers, etc.  I agree with seeing the dignity in every homeless person and I volunteer in a homeless shelter (where we sit and eat meals with the homeless to converse), but this is not incongruent with not giving money to panhandlers.", "userDisplayName": "Filmfan", "assetID": 3466331, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 55596960, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 390, "createDate": "1488635072", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21683419, "editorsSelection": 0, "updateDate": "1488636573", "approveDate": "1488636573", "parentID": null, "rgt": 395, "replyCount": 1, "userLocation": "Kansas", "commentSequence": 21683419, "commentBody": "I always find myself struggling between practicing my faith while understanding complex adaptive systems. The Pope's guidance seems to focus on the mindset of the giver without regard for the welfare of the receiver. That glass of wine may be the only source of worldly happiness for the receiver, but it may also reinforce the receiver's poverty. Don't the faithful have a responsibility to give in a manner that solves problems? Teach a man to fish...", "userDisplayName": "Hayden", "assetID": 3466331, "recommendationCount": 0, "status": "approved", "replies": {"comments": [{"commentID": 21683998, "commentSequence": 21683998, "editorsSelection": false, "updateDate": "1488637670", "depth": 1, "approveDate": "1488637670", "userURL": "NULL", "parentID": 21683419, "createDate": "1488637555", "parentUserDisplayName": "Hayden", "recommendations": 1, "commentBody": "No, because we are not God. Nowhere in the Bible does it say that we are to see ourselves as obligated to hold others accountable to God. The Prodigal Son was welcomed with open arms and the finest clothes and food, not castigated for being foolish and spending his inheritance on vices.", "trusted": 0, "userDisplayName": "A.E.", "status": "approved", "recommendedFlag": 0, "userID": 23828895, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "n/a", "replyCount": 0, "userLocation": "Los Angeles"}]}, "userID": 57416133, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 392, "createDate": "1488635326", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21683453, "editorsSelection": 0, "updateDate": "1488636573", "approveDate": "1488636573", "parentID": null, "rgt": 397, "replyCount": 0, "userLocation": "NJ", "commentSequence": 21683453, "commentBody": "I don't understand the comments of those who seem to believe that it is wrong to give money to an individual because there are agencies which better use the money or that giving money to an individual will increase the problem of hunger and/or homelessness.  The \"safety net\" has been cut almost to shreds in the past few decades and the charitable agencies are stretched to their limit which means that it is not easy for a person to get help even for hunger never mind help to actually improve the situation.  <br/><br/>No one loses if one makes a choice is based on compassion. Does it really matter if one is fortunate enough to be able to afford to give away $5.00 and the receiver spends it foolishly?  Even if one gives to a person running a scam it doesn't take away the compassionate intent of the giver and after all we all spend many $5.00 bills each day on companies which are run by millionaires scamming all of us.  I would much rather live a life knowing that a small $5.00 bill given to someone in wretched circumstances may put soup in their stomach on a cold day then to live with a heart so cold that I actually have the stomach to judge or disdain the same person.   ", "userDisplayName": "Theresa Grimes", "assetID": 3466331, "recommendationCount": 14, "status": "approved", "replies": [], "userID": 19259808, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 396, "createDate": "1488635495", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21683623, "editorsSelection": 0, "updateDate": "1488636573", "approveDate": "1488636573", "parentID": null, "rgt": 399, "replyCount": 0, "userLocation": "Boston", "commentSequence": 21683623, "commentBody": "Many of the Homeless have mental illness. Yes, they may receive disability benefits; however, that goes fast when living on the streets. Panhandling gives them a little more money. I have been told by homeless people that the humiliation of panhandling is extreme, but they have to do it. Sometimes it is for little extras. Sometimes it is for things we don't approve of; however, for them it may be a comfort or a pleasure item. Often they will use the money to go into a cinema for the day just to get a rest from the cold. Homelessness is a hard life spent waiting in long lines for food and long lines for hours to get a shelter bed. When the shelter is full they are housed on floors of shelter lobbies or left on their own to survive on the street all night.", "userDisplayName": "Philip", "assetID": 3466331, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 71702591, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 398, "createDate": "1488636089", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21682451, "editorsSelection": 0, "updateDate": "1488636575", "approveDate": "1488636575", "parentID": null, "rgt": 1905, "replyCount": 0, "userLocation": "New York", "commentSequence": 21682451, "commentBody": "I'd like to be clear, just because Sessions recused himself, that doesnt imply he lied. You have to look closer at questions he was asked.<br/>Please see a heated debate on that at <a href=\"http://debateIsland.com\" title=\"debateIsland.com\" target=\"_blank\">debateIsland.com</a><br/><a href=\"http://www.debateisland.com/discussion/503/did-jeff-sessions-lie-about-talking-to-russians\" title=\"http://www.debateisland.com/discussion/503/did-jeff-sessions-lie-about-talking-to-russians\" target=\"_blank\">http://www.debateisland.com/discussion/503/did-jeff-sessions-lie-about-t...</a>", "userDisplayName": "AG507", "assetID": 3466329, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 79168468, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1904, "createDate": "1488630775", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21681622, "editorsSelection": 0, "updateDate": "1488636585", "approveDate": "1488636585", "parentID": null, "rgt": 401, "replyCount": 0, "userLocation": "chicago", "commentSequence": 21681622, "commentBody": "The Pope is absolutely right in his statements about giving to the poor. His message is appropriate and correct for Lent.<br/>However, in his home city of Rome, as well as others around Italy and in parts of Europe, pandhandlers are parts of organized gangs whose job is to shake down well-intentioned citizens. This is not the same as being poor.  I wish the Pope had framed his message a bit differently, to emphasize charity to the needy and not the beggers.", "userDisplayName": "Helen", "assetID": 3466331, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 19882048, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 400, "createDate": "1488622768", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/the-pope-on-panhandling-give-without-worry.html", "userURL": "NULL"}, {"commentID": 21683750, "editorsSelection": 0, "updateDate": "1488636608", "approveDate": "1488636608", "parentID": 21679860, "rgt": 228, "replyCount": 0, "userLocation": "Manhattan", "commentSequence": 21683750, "commentBody": "Sessions' recusal is not adequate because, less a truly independent investigation of Trump's and Trump's circle's Russia-Putin connections, Sessions still had power to fire whoever within the Department of Justice were to investigate those connections.<br/><br/>What's more is that Sessions did not answer the question Franken had posed him. And, the response he gave was calculated, sleazy and dishonorable.", "userDisplayName": "Scott Rose", "assetID": 3466327, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 40369070, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 227, "createDate": "1488636569", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21682479, "editorsSelection": 0, "updateDate": "1488636612", "approveDate": "1488636612", "parentID": 21680547, "rgt": 1250, "replyCount": 0, "userLocation": "Colorado Springs", "commentSequence": 21682479, "commentBody": "Oh yes, he'll publish them after the \"audit\" is done. Which, the IRS says, you can do even during an audit. Let's put \"audit\" in quotes again.", "userDisplayName": "Pat", "assetID": 3466329, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 25856594, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1249, "createDate": "1488630912", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21682486, "editorsSelection": 0, "updateDate": "1488636642", "approveDate": "1488636642", "parentID": null, "rgt": 1907, "replyCount": 0, "userLocation": "San Diego", "commentSequence": 21682486, "commentBody": "Sometimes it helps to look at things with a macro lens.<br/>It's now known that Russia interfered in the US presidential election favoring Trump.<br/>Trump campaign has consistently denied any Russia contact.<br/>Pence, a fierce Russia critic suddenly speaks nice of Russia.<br/>Information starts trickling out that the campaign and close associates did have contacts with Russians.<br/> Trump associates now admit there indeed were contacts with the Russians but they were only casual.<br/>A Russian oligarch's plane is now being reported to have been at many stops during the campaign at exactly the time when Trump was there.<br/>Hmmmm........<br/>Too many coincidences, ifs ands or buts........", "userDisplayName": "Hmmmm...SanDiego", "assetID": 3466329, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 19861573, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1906, "createDate": "1488630988", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21682469, "editorsSelection": 1, "updateDate": "1488636645", "approveDate": "1488636645", "parentID": null, "rgt": 1909, "replyCount": 0, "userLocation": "Massachusetts", "commentSequence": 21682469, "commentBody": "My gut tells me there is a lot less here than meets the eye. Sessions obviously lied, gratuitously and stupidly since he wasn't even asked if he had contact. But I just don't think the Russians would have admitted to him or other Americans that they were involved in this. So I really doubt there was collusion. But the Trump administration (with support from the GOP) is circling its wagons. And that makes them look guilty and also hypocritical because of its extensive investigation into both Clinton's. Politically, they're handling it stupidly. But as someone who thinks Trump is dangerous to this country, I don't mind seeing them squirm. ", "userDisplayName": "LSR", "assetID": 3466329, "recommendationCount": 87, "status": "approved", "replies": [], "userID": 26421706, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1908, "createDate": "1488630860", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21680604, "editorsSelection": 0, "updateDate": "1488636650", "approveDate": "1488636650", "parentID": null, "rgt": 1175, "replyCount": 2, "userLocation": "Brooklyn", "commentSequence": 21680604, "commentBody": "I almost feel sorry for him. He's as dumb as a sack of horseshoes and doesn't know it. Perfect Trump pick. It makes Trump think he's smart. ", "userDisplayName": "Robert Guenveur", "assetID": 3466327, "recommendationCount": 9, "status": "approved", "replies": {"comments": [{"commentID": 21684055, "commentSequence": 21684055, "editorsSelection": false, "updateDate": "1488639517", "depth": 1, "approveDate": "1488639517", "userURL": "NULL", "parentID": 21680604, "createDate": "1488637771", "parentUserDisplayName": "Robert Guenveur", "recommendations": 3, "commentBody": "Yup. Good ole lyin' pixie dixie jeff. And yes, dumber than a sack of horseshoes, and doesn't know it. That smooth Dixie Pixie manner is used to cover it.<br/>Anyone remember Alfred E. Neuman, Mad magazines cover guy \"What, me lie?\"", "trusted": 0, "userDisplayName": "al becker", "status": "approved", "recommendedFlag": 0, "userID": 56586302, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "n/a", "replyCount": 0, "userLocation": "Who cares"}, {"commentID": 21685234, "commentSequence": 21685234, "editorsSelection": false, "updateDate": "1488642778", "depth": 1, "approveDate": "1488642778", "userURL": "NULL", "parentID": 21680604, "createDate": "1488642064", "parentUserDisplayName": "Robert Guenveur", "recommendations": 2, "commentBody": "Yep that's him. Alfred E. Neuman might be offended however.", "trusted": 0, "userDisplayName": "Robert Guenveur", "status": "approved", "recommendedFlag": 0, "userID": 68958497, "commentType": "userReply", "replies": [], "userTitle": "NULL", "commentTitle": "<br/>", "replyCount": 0, "userLocation": "Brooklyn"}]}, "userID": 68958497, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1170, "createDate": "1488603568", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680612, "editorsSelection": 0, "updateDate": "1488636653", "approveDate": "1488636653", "parentID": 21679836, "rgt": 206, "replyCount": 0, "userLocation": "Austin", "commentSequence": 21680612, "commentBody": "Yawn.", "userDisplayName": "Kathrine", "assetID": 3466327, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 38189909, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 205, "createDate": "1488603622", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680617, "editorsSelection": 0, "updateDate": "1488636664", "approveDate": "1488636664", "parentID": 21680430, "rgt": 270, "replyCount": 0, "userLocation": "Ohio", "commentSequence": 21680617, "commentBody": "Actually, hotels in Cleveland are not cheap, if you mean a modern hotel near the center of town--or even at the Cleveland Clinic.  On your other points, yesss!", "userDisplayName": "Eric", "assetID": 3466327, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 21637381, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 269, "createDate": "1488603663", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680194, "editorsSelection": 0, "updateDate": "1488636669", "approveDate": "1488636669", "parentID": null, "rgt": 1177, "replyCount": 0, "userLocation": "Los Angeles", "commentSequence": 21680194, "commentBody": "When the \"charming little pixie\" met with the Kremlin's chief hood in Washington. why didn't he tell him to tell Putin to cease and desist interfering in our election?", "userDisplayName": "Alan D", "assetID": 3466327, "recommendationCount": 8, "status": "approved", "replies": [], "userID": 16564118, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1176, "createDate": "1488600237", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680212, "editorsSelection": 0, "updateDate": "1488636669", "approveDate": "1488636669", "parentID": null, "rgt": 1179, "replyCount": 0, "userLocation": "NYC", "commentSequence": 21680212, "commentBody": "“He has these horrible views, but he’s sort of not vicious about them.”<br/><br/>Privilege strikes again. Those \"horrible views\" hurt real people, but I guess if this Senator isn't one of the people hurt it's ok.", "userDisplayName": "Chrissy", "assetID": 3466327, "recommendationCount": 12, "status": "approved", "replies": [], "userID": 47455183, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1178, "createDate": "1488600386", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21680228, "editorsSelection": 0, "updateDate": "1488636669", "approveDate": "1488636669", "parentID": null, "rgt": 1181, "replyCount": 0, "userLocation": "New Jersey", "commentSequence": 21680228, "commentBody": "He's not charming.  Quite the opposite.  Voice makes me want to hurl.", "userDisplayName": "Rae", "assetID": 3466327, "recommendationCount": 11, "status": "approved", "replies": [], "userID": 46936593, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1180, "createDate": "1488600472", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}], "api_timestamp": "1488826213"}, "debug": {"version": 3.1}, "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "status": "OK"}