{"results": {"totalCommentsFound": 8064, "totalCommentsReturned": 25, "comments": [{"commentID": 21683973, "editorsSelection": 0, "updateDate": "1488638239", "approveDate": "1488638239", "parentID": null, "rgt": 1187, "replyCount": 0, "userLocation": "North Carolina", "commentSequence": 21683973, "commentBody": "If states actually had a consistent history of following the US Constitution (remember the fight for equal education and voting rights in South and many Northern States), then the Federal Government would never have to intervene in the States affairs on behalf of US citizens.<br/>And of course Republican governors (as well as many Democratic governors) want all that Federal money with not strings attached (meaning accountability).<br/>And it is interesting how Scott Walker has channeled Trump in the way he brags about how wonderful his policies have been when the opposite is quite true.  If the economy of Wisconsin was so great, the blue collar workers would have never voted for Trump.<br/>And having a balanced budget is no great accomplishment, it is a requirement of any state government (Republican or Democrat).  It is just the means by which it is done. You can increase taxes, cut services or cut taxes for the wealthy and increase fees and consumer taxes on the working class and then cut services as well.  Which do you think Walker did?", "userDisplayName": "John  C.", "assetID": 3466322, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 3844331, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1186, "createDate": "1488637478", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683993, "editorsSelection": 0, "updateDate": "1488638239", "approveDate": "1488638239", "parentID": null, "rgt": 1189, "replyCount": 0, "userLocation": "St. Croix Falls, WI", "commentSequence": 21683993, "commentBody": "From my home overlooking the St. Croix River, I can see the hills of MN. two miles away.  Within walking distance, there's  world of difference for inhabitants!  When I moved here 40 years ago, I didn't really worry about political leaders.  GOP, Dems shared values, it seemed to me:  clean air, water, public education, basic safety nets were givens.   All gone.  Before Walker, reps from the forgotten part of WI seemed to collaborate for the common good.  The losses to quality of life in WI under the current administration are too numerous to count.  The John Doe investigation was squelched.  The \"leaked\" account, however, is available and must be read to really understand the seriousness of allegations.  Check the efforts of Common Cause WI.  Jay Heck is relentless in exposing the underbelly.  Right now, CC is fighting our battle as the GOP takes tax payer money to oppose the unconstitutional gerrymandering that keeps the state under the thump of Walkerworld.  One Wisconsin Now, Wisconsin Budget Project are other watchdogs who work against corruption and destruction of this once respected state.<br/>I only wish the NYT had not even given the puppet governor the dignity of front page attention.", "userDisplayName": "Marilyn Brissett-Kruger", "assetID": 3466322, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 60091433, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1188, "createDate": "1488637546", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21684002, "editorsSelection": 0, "updateDate": "1488638239", "approveDate": "1488638239", "parentID": null, "rgt": 1191, "replyCount": 0, "userLocation": "Cambridge", "commentSequence": 21684002, "commentBody": "Scott is all for state's rights, and I could be too.  The problem I have is that Scott and most Republicans, including prominently the Tea Party Caucus, want to rail against deficits and social programs, all the while being subsidized heavily by federal tax revenues from rich progressive states, like Massachusetts, Minnesota, Maryland, Washington and California, among others.  They want to control the nature of the social programs within their states, but want others to pay for them.  So I would be in favor of state's rights if we reduce the overall federal tax burden, and progressive states could easily make up the difference in state tax revenues.  And Republican state legislatures could, well, live within their much reduced means, and design social programs based on their own money, and see how they do electorally then.  It would not be pretty.", "userDisplayName": "Trevor Dickie", "assetID": 3466322, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 3427441, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1190, "createDate": "1488637568", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21684014, "editorsSelection": 0, "updateDate": "1488638239", "approveDate": "1488638239", "parentID": null, "rgt": 1193, "replyCount": 0, "userLocation": "Georgia via Nj", "commentSequence": 21684014, "commentBody": "If Governor walker got his way and Federal taxes from the states stayed in the states many Trump supporters would be very disappointed. Most people don't realize most liberal states pay far more to the Federal Government than they receive back. The money is used to subsidize many of Trumps red states. Be careful what you wish for.", "userDisplayName": "Gude2shuz", "assetID": 3466322, "recommendationCount": 5, "status": "approved", "replies": [], "userID": 41144009, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1192, "createDate": "1488637596", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682976, "editorsSelection": 0, "updateDate": "1488638240", "approveDate": "1488638240", "parentID": 21681527, "rgt": 1496, "replyCount": 0, "userLocation": "New York", "commentSequence": 21682976, "commentBody": "Or imagine if it were a Democratic Attorney General, and she did something like meet privately on a tarmac with the husband of the person under investigation.  Democrats would be equally outraged.  They would immediately call for her resignation.  Right?", "userDisplayName": "AACNY", "assetID": 3466329, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 73444633, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1495, "createDate": "1488633393", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684024, "editorsSelection": 0, "updateDate": "1488638240", "approveDate": "1488638240", "parentID": null, "rgt": 1195, "replyCount": 0, "userLocation": "Mission Viejo Ca", "commentSequence": 21684024, "commentBody": "Wisconsin receives about $1.75 in federal funding for every $1.00 it's citizens pay in federal taxes. Wisconsin is essentially a welfare state, being funded by taxpayers from California, New York and Illinois. I would like nothing better than for Wisconsin to pay its own way. Keep your federal taxes in Wisconsin and live on them without help from the rest of us.  ", "userDisplayName": "RER", "assetID": 3466322, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 70594443, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1194, "createDate": "1488637639", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21684044, "editorsSelection": 0, "updateDate": "1488638240", "approveDate": "1488638240", "parentID": null, "rgt": 1197, "replyCount": 0, "userLocation": "Peekskill", "commentSequence": 21684044, "commentBody": "Walker is a Koch brother pawn.  His union busting platform is nothing more than a desire to create and control the message of the education system.  The University of Wisconsin is under attack.  Professors have lost most of their tenure rights, the state budget is being used to justify cuts to programs without an academic review of the program's usefulness, and the content of what will taught is now being driven by government instead of academics.<br/><br/>Sad that such a respected institution is under such attack.  Walker's call for states rights is about losing oversight and being able to do what he (or his deep pocketed donors) pleases.<br/><br/>The anti-government fervor being cultivated by the right is going to lead us to the brink.  Deregulation is another way of saying no education, no healthcare, no clean air, no clean water, no worker rights, and no civil rights.", "userDisplayName": "Bull Moose 2020", "assetID": 3466322, "recommendationCount": 7, "status": "approved", "replies": [], "userID": 67319886, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1196, "createDate": "1488637730", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21684056, "editorsSelection": 0, "updateDate": "1488638240", "approveDate": "1488638240", "parentID": 21679563, "rgt": 152, "replyCount": 0, "userLocation": "Texas", "commentSequence": 21684056, "commentBody": "Richard is OK with a little socialism in healthcare because, he recognizes, the state-by-state approach will create pockets of disaster, probably well over half the nation, considering the way, historically, the Republicans would begrudgingly turn loose of funds for such programs.  Such a solution would be analogous to an automobile assembled from parts manufactured over many decades and from every known manufacturer, pulled willy-nilly from the stockpile and bolted together in no particular order.<br/><br/>But when education is the subject, any semblance of conformity among \"THESE\" [several] United States is force to be stood firm against at all costs, usually borne, in the long run, by the educatees.", "userDisplayName": "Glen", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 67607286, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 151, "createDate": "1488637773", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21684062, "editorsSelection": 0, "updateDate": "1488638240", "approveDate": "1488638240", "parentID": null, "rgt": 1199, "replyCount": 0, "userLocation": "Western NC", "commentSequence": 21684062, "commentBody": "Wisconsin is a real worker's paradise under Scott Walker. Wages are falling under Wisconsin's Right to Work laws. Civil Service laws were gutted to allow political appointees to determine who is hired and fired. Any public school teacher who can afford to leave is foolish to stay and work for reduced pay, lowered benefits, and no protections against arbitrary termination. At least  Walker was smart enough to drop out of the presidential race when it became obvious that his act wouldn't fly on a national scale.", "userDisplayName": "Trucklt", "assetID": 3466322, "recommendationCount": 7, "status": "approved", "replies": [], "userID": 72173815, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1198, "createDate": "1488637809", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21684131, "editorsSelection": 0, "updateDate": "1488638240", "approveDate": "1488638240", "parentID": null, "rgt": 1201, "replyCount": 0, "userLocation": "Highland Park, NJ", "commentSequence": 21684131, "commentBody": "In our not so distant past, certain states clamored for the right to do exactly as they pleased.  But that did not end well; it resulted in what those states euphemistically called \"The War Between the States.\"  We call it the Civil War.  Had those states prevailed, that special institution they cherished, slavery, might have survived to this day. So giving the states the right to do everything they please is not always a good thing..", "userDisplayName": "Freestyler", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 47409567, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1200, "createDate": "1488638068", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21684150, "editorsSelection": 0, "updateDate": "1488638240", "approveDate": "1488638240", "parentID": null, "rgt": 1203, "replyCount": 0, "userLocation": "Florida", "commentSequence": 21684150, "commentBody": "He must be governing a different state than Wisconsin. Wisconsin ranks in the lower half of Wallet Hub's economic success meter. It ranks 28th overall but 38th in economic development. The low ranking on economic development comes from the fact that Wisconsin is beginning to have problems finding talent. <br/><br/>One of the key reason Wisconsin cannot find talent and thus is ranked 38th is because the governor has declared a war against education. This obvious problem has led to protests.<br/><br/>By the way, during the campaign it was pointed out that citizens of Wisconsin would have lower taxes--simply by moving to Minnesota. Walker is ten pounds of excrement packaged in a five pound bag...", "userDisplayName": "Kerry", "assetID": 3466322, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 38717350, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1202, "createDate": "1488638147", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21682979, "editorsSelection": 0, "updateDate": "1488638254", "approveDate": "1488638254", "parentID": 21679991, "rgt": 1014, "replyCount": 0, "userLocation": "Fort-Lauderdale. FL", "commentSequence": 21682979, "commentBody": "What a dirty bunch of despicable liars this GOP is. Some may be decent men in private, but as a party, they are truly repugnant.<br/>So, this is the third time that the dirty tricks- in the GOP play-book- are used: first Nixon on Johnson! Second, Reagan on Carter! And now the worst, worst possible POTUS in cahoot with and unfriendly regime to steal, again, the election for the GOP!<br/>The Democrats are much too fair, honest and honorable during a campaign. Without going as low as the GOP, they could do with a little body building, to firm up that spine.           ", "userDisplayName": "JMD", "assetID": 3466329, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 62226959, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1013, "createDate": "1488633420", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21682981, "editorsSelection": 0, "updateDate": "1488638257", "approveDate": "1488638257", "parentID": 21680557, "rgt": 1254, "replyCount": 0, "userLocation": "NH", "commentSequence": 21682981, "commentBody": "Thank you!  And you're certainly right about the need for a Deep Throat again.", "userDisplayName": "Mary Feral", "assetID": 3466329, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 22628351, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1253, "createDate": "1488633440", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21684189, "editorsSelection": 0, "updateDate": "1488638289", "approveDate": "1488638289", "parentID": 21680018, "rgt": 500, "replyCount": 0, "userLocation": "NC", "commentSequence": 21684189, "commentBody": "How sane and wonderful former Republican presidents, who once seemed so awful, now seem to be.  Nixon being the exception.  Would I trade Trump for Ford, Reagan, Bush I or II?  In a nanosecond.  At least they were human beings with a semblance of dignity and intelligence. What happened to decent Republicans some of whom I once voted for?  The bunch in Congress and the man in the White House are mostly despicable.  The exception being Sen. Susan Collins of Maine.  The only one whose name comes to mind.", "userDisplayName": "amp", "assetID": 3466327, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 56141873, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 499, "createDate": "1488638272", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21684188, "editorsSelection": 0, "updateDate": "1488638290", "approveDate": "1488638290", "parentID": null, "rgt": 1343, "replyCount": 0, "userLocation": "Detroit", "commentSequence": 21684188, "commentBody": "I'm old enough to remember when the Republican party claimed to stand for \"Law and Order\".  Now they're willing to parse phrases and look away while their own denigrate the offices to which they're appointed. Sessions (at best) dissembled under oath. The Vice-President lied about using a private email server, as did the EPA head. Yet the party is in lockstep, seemingly unwilling to see the transgressions right in front of its face. I thought Republicans were the \"moral majority\". Doesn't look like it any longer.", "userDisplayName": "misterarthur", "assetID": 3466327, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 63366, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1342, "createDate": "1488638272", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/what-to-do-with-jeff-sessions.html", "userURL": "NULL"}, {"commentID": 21682983, "editorsSelection": 0, "updateDate": "1488638306", "approveDate": "1488638306", "parentID": 21682809, "rgt": 1522, "replyCount": 0, "userLocation": "Cape Cod, MA", "commentSequence": 21682983, "commentBody": "Actually, Gene, it shows the gross hypocrisy of Republicans, considering the amount of taxpayer funds that party has spent on relentless investigations into far less serious matters, like a ten-year-old already-litigated land deal, including firing the initial special prosecutor when his conclusions weren't what they wanted, so they got Kenneth Starr in there; seven years harassing a sitting president in the hopes of finding something, anything, on which to hang him, settling for a fib about a consensual affair and impeaching him over it; a committee created for the sole purpose of bringing the president and SOS down over a terrorist attack (and I remind you that Democrats got behind Pres. Bush after 9/11`. Republicans saw Benghazi as a political opportunity); a private email server, never hacked.<br/>But a US enemy illegally hacking one party's emails in order to interfere with out election and help throw it to its preferred candidate, an Attorney General lying while under oath to Congress regarding this serious matter, among others, causes yawns amongst Republicans.  It is weird and creepy that, apparently had Sessions fibbed about a consensual sex act in an actual witch hunt with no national security or risks to our democracy, that THAT would have gotten you Republicans demanding impeachment and removal.  Way. Off. Base. And dishonest.", "userDisplayName": "Virginia", "assetID": 3466329, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 15876855, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1521, "createDate": "1488633446", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21682984, "editorsSelection": 0, "updateDate": "1488638309", "approveDate": "1488638309", "parentID": null, "rgt": 2075, "replyCount": 0, "userLocation": "New York City", "commentSequence": 21682984, "commentBody": "I really want to see the \"dossier of compromising information\" that Russia supposedly has about Trump.", "userDisplayName": "FireDragon111", "assetID": 3466329, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 51583808, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 2074, "createDate": "1488633447", "commentTitle": "n/a", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21682992, "editorsSelection": 0, "updateDate": "1488638312", "approveDate": "1488638312", "parentID": 21681447, "rgt": 1464, "replyCount": 0, "userLocation": "New York City", "commentSequence": 21682992, "commentBody": "It is clear that the US made itself vulnerable by neglecting the importance of public education to maintain a common core of national understanding.", "userDisplayName": "Steve Bolger", "assetID": 3466329, "recommendationCount": 0, "status": "approved", "replies": [], "userID": 67892453, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1463, "createDate": "1488633484", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21682996, "editorsSelection": 0, "updateDate": "1488638326", "approveDate": "1488638326", "parentID": 21681584, "rgt": 1534, "replyCount": 0, "userLocation": "Walton", "commentSequence": 21682996, "commentBody": "And did anyone in team Trump have secret meetings and lie about them with say the Chinese or British? Why were they ONLY meeting with the Russians especially at a time when there was already PROOF from 17 intelligence agencies that Russia had interferred in the election?  One of these days you Trumpster voters are going to have to be honest with yourselves and admit that you voted for a traitor to the U.S. ", "userDisplayName": "Sarah", "assetID": 3466329, "recommendationCount": 1, "status": "approved", "replies": [], "userID": 77902119, "statusID": 2, "userTitle": "NULL", "commentType": "userReply", "lft": 1533, "createDate": "1488633505", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/us/politics/trump-russia-links-washington.html", "userURL": "NULL"}, {"commentID": 21683552, "editorsSelection": 0, "updateDate": "1488638328", "approveDate": "1488638328", "parentID": null, "rgt": 1205, "replyCount": 0, "userLocation": "Cheyenne WY", "commentSequence": 21683552, "commentBody": "Republicans are standing strong, right on the jugular of the nation. I really wish that the Founders, Lincoln, and (the very overrated) Reagan were here to tell your party what they think you. Benjamin Franklin would likely observe that he was impressed that we managed to hold the Republic together until McConnell, Ryan, and Trump; Lincoln would shed tears; Reagan would unleash a series of expletives at the self-destruction of his party.", "userDisplayName": "HighPlainsScribe", "assetID": 3466322, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 65735846, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1204, "createDate": "1488635879", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683568, "editorsSelection": 0, "updateDate": "1488638328", "approveDate": "1488638328", "parentID": null, "rgt": 1207, "replyCount": 0, "userLocation": "Wisconsin", "commentSequence": 21683568, "commentBody": "Walker's Wisconsin:<br/>Older, poorer and less educated. Young, educated people are fleeing this state for places like Minneapolis and other more progressive areas. Under Walker, Wisconsin has taken a giant step backwards.    ", "userDisplayName": "Richard Lorenz", "assetID": 3466322, "recommendationCount": 6, "status": "approved", "replies": [], "userID": 66171489, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1206, "createDate": "1488635927", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683613, "editorsSelection": 0, "updateDate": "1488638328", "approveDate": "1488638328", "parentID": null, "rgt": 1209, "replyCount": 0, "userLocation": "WI", "commentSequence": 21683613, "commentBody": "Mister Unintiminated is neither big nor bold...just sneaky.  Gov. Walker pushes his programs in secrecy, and when the people protest he either backs down or hides in his Capitol office with arm guards protecting him 24/7.  He has a small stature and he may suffer a Napolean complex.  \"Divide and conquer\"  is his motto.  He never reaches across the aisle, and prefers the money of billionaires to help him promote his extreme conservative programs.  Most of his adult life he has held government jobs.  Others pay off his debts because he doesn't take responsibility for his political failures.  Wisconsin is suffering under his rule. ", "userDisplayName": "Barb", "assetID": 3466322, "recommendationCount": 4, "status": "approved", "replies": [], "userID": 31144726, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1208, "createDate": "1488636065", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683620, "editorsSelection": 0, "updateDate": "1488638328", "approveDate": "1488638328", "parentID": null, "rgt": 1211, "replyCount": 0, "userLocation": "South Carolina", "commentSequence": 21683620, "commentBody": "Self Aggrandizing baloney.  Propaganda.  Our founding fathers did not see the nation as a collection of 13 individual states, in fact, that is how we started under the Articles of Confederation, which nearly resulted in another revolution after Shay's Rebellion in 1786.  The Constitutional Convention was an attempt to create a strong FEDERAL government with more authority over states.  While many including Jefferson, were leery, most favored this idea (even Jefferson when president used Federal powers over states liberally).  This is basic US history and something average high school students know.", "userDisplayName": "Scott", "assetID": 3466322, "recommendationCount": 3, "status": "approved", "replies": [], "userID": 62273568, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1210, "createDate": "1488636085", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683669, "editorsSelection": 0, "updateDate": "1488638328", "approveDate": "1488638328", "parentID": null, "rgt": 1213, "replyCount": 0, "userLocation": "Dallas", "commentSequence": 21683669, "commentBody": "Gov Walker seems to forget that Trump lost the popular vote, and despite his protests to the contrary, this isn't about helping people \"connect with employers\" or any other spin he wants to put on it. Walker is a Koch crony and has only his own best interests at heart. How the GOP continues to make people vote against their economic interests mystifies me. ", "userDisplayName": "RHD", "assetID": 3466322, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 76280226, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1212, "createDate": "1488636242", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}, {"commentID": 21683691, "editorsSelection": 0, "updateDate": "1488638328", "approveDate": "1488638328", "parentID": null, "rgt": 1215, "replyCount": 0, "userLocation": "georgia", "commentSequence": 21683691, "commentBody": "Wrong Governor Walker. You claim, \"This is how our founders envisioned our country.\" The founders did not envision one-party rule steamrolling its agenda over the opposition. James Madison warned that \"factions,\" especially majority factions, would undermine the checks and balances needed to prevent the abuse of government power. If you really wanted to honor the founders, you would hear out the opposition, whom you also represent, and seek compromise.", "userDisplayName": "steve jones", "assetID": 3466322, "recommendationCount": 2, "status": "approved", "replies": [], "userID": 66500055, "statusID": 2, "userTitle": "NULL", "commentType": "comment", "lft": 1214, "createDate": "1488636312", "commentTitle": "<br/>", "assetURL": "http://www.nytimes.com/2017/03/03/opinion/against-protests-republicans-must-stand-strong.html", "userURL": "NULL"}], "api_timestamp": "1488826220"}, "debug": {"version": 3.1}, "copyright": "Copyright (c) 2017 The New York Times Company.  All Rights Reserved.", "status": "OK"}